{"ts": "00:00", "speaker": "I", "text": "Können Sie mir kurz den aktuellen Stand von Atlas Mobile aus UX-Perspektive beschreiben?"}
{"ts": "02:15", "speaker": "E", "text": "Ja, gern. Wir sind derzeit in der Pilotphase, also noch vor dem breiten Rollout. Für uns im UX-Team heißt das, dass wir sehr eng mit der QA und den Mobile-Entwicklern zusammenarbeiten, um die tokenisierten Komponenten aus unserem neuen Designsystem DS-ATLAS v2 zu validieren. Der Fokus liegt stark auf der Konsistenz zwischen Android und iOS, sowie auf der Offline-Erfahrung, weil das einer der Differenzierungsfaktoren im Markt ist."}
{"ts": "05:10", "speaker": "I", "text": "Wie ist Ihr Team konkret in die Pilotphase eingebunden?"}
{"ts": "07:05", "speaker": "E", "text": "Wir haben zwei UX-Designer direkt in den Scrum-Teams, die parallel an Features und an Research arbeiten. Zusätzlich betreiben wir wöchentliche Usability-Tests mit einer kleinen Gruppe von Pilotnutzern aus drei verschiedenen Branchen. Das gibt uns früh Feedback, das wir über Feature Flags gezielt in einzelnen Kohorten aktivieren oder deaktivieren können."}
{"ts": "10:20", "speaker": "I", "text": "Welche Kernziele verfolgen Sie im Hinblick auf Benutzererlebnis und Zugänglichkeit?"}
{"ts": "12:15", "speaker": "E", "text": "Unser erstes Ziel ist eine durchgehende Experience, egal ob online oder offline. Zweitens wollen wir, dass die App nach WCAG 2.1 AA Standard funktioniert. Und drittens setzen wir auf eine modulare Architektur, damit wir neue Funktionalitäten schnell einführen können, ohne die bestehende Nutzerführung zu stören."}
{"ts": "15:50", "speaker": "I", "text": "Wie setzen Sie die tokenisierten Komponenten aus DS-ATLAS v2 in der App um?"}
{"ts": "18:00", "speaker": "E", "text": "Wir nutzen ein systemweites Token-Repository, das Farben, Abstände, Typografie und Interaktionsmuster definiert. Die Mobile-Teams binden diese Tokens direkt in die Stylesheets ein. Das hat den Vorteil, dass Änderungen im Designsystem sofort in allen Komponenten sichtbar werden – wir arbeiten hier eng mit dem DS-ATLAS Maintainance Board zusammen."}
{"ts": "22:30", "speaker": "I", "text": "Welche Workflows haben Sie, um Feature Flags mit UX-Tests zu verknüpfen?"}
{"ts": "25:15", "speaker": "E", "text": "Wir koppeln jedes UX-Experiment an ein spezifisches Flag im FF-Manager. Über den Testplan im internen Tool AtlasTest können wir definieren, dass eine bestimmte Nutzergruppe z.B. die neue Navigation sieht, während andere die alte behalten. So lassen sich A/B-Tests ohne App-Update durchführen."}
{"ts": "29:10", "speaker": "I", "text": "Gab es schon Fälle, in denen ein Feature Flag bewusst für eine bestimmte Nutzergruppe aktiviert blieb?"}
{"ts": "31:40", "speaker": "E", "text": "Ja, im Ticket UXF-112 haben wir das bei der neuen Offline-Sync-UI gemacht. Pilotkunden aus dem Gesundheitswesen hatten dadurch länger Zugriff, um uns qualitatives Feedback zu geben, bevor wir den Rollout auf die gesamte Pilotgruppe ausgeweitet haben."}
{"ts": "36:15", "speaker": "I", "text": "Wie testen Sie die Offline-Sync-Funktionalität in realistischen Nutzungsszenarien?"}
{"ts": "39:30", "speaker": "E", "text": "Wir simulieren Netzwerkausfälle mit einem internen Tool, das Paketverluste und Latenzen einspielt. Zusätzlich führen wir Feldtests mit Geräten in ländlichen Gebieten durch. Die Ergebnisse werden gegen die Vorgaben aus Runbook RB-MOB-014 validiert, das klare Schwellenwerte für Sync-Dauer und Konfliktlösung definiert."}
{"ts": "44:05", "speaker": "I", "text": "Welche Accessibility-Standards setzen Sie um und wie überprüfen Sie deren Einhaltung?"}
{"ts": "46:30", "speaker": "E", "text": "Wie gesagt, wir orientieren uns an WCAG 2.1 AA. Wir nutzen automatisierte Checks in der CI-Pipeline und führen manuelle Screen-Reader-Tests auf iOS und Android durch. Außerdem haben wir eine kleine Gruppe sehbehinderter Pilotuser, die uns direkt in wöchentlichen Feedback-Sessions Hinweise geben."}
{"ts": "90:00", "speaker": "I", "text": "Könnten Sie bitte genauer beschreiben, wie Sie die Offline-Sync-Funktionalität in realistischen Nutzungsszenarien validieren?"}
{"ts": "90:12", "speaker": "E", "text": "Ja, wir nutzen dafür eine Kombination aus simulierten Netzwerkbedingungen in unserem Testframework und Feldtests mit ausgewählten Pilotnutzern. Im Lab simulieren wir z.B. 3G-Verlust und Paketverzögerungen, und draußen im Feld überprüfen wir, ob unser Sync-Queue-Mechanismus gemäß RB-MOB-012 zuverlässig arbeitet."}
{"ts": "90:38", "speaker": "I", "text": "Und wie prüfen Sie dabei die Einhaltung der Accessibility-Standards?"}
{"ts": "90:49", "speaker": "E", "text": "Wir orientieren uns an EN 301 549 und WCAG 2.1 AA. In der Offline-Phase testen wir mit Screen Readern, ob Statusmeldungen korrekt vorgelesen werden. Das war tricky, weil unser Sync-Banner initial nicht im Accessibility Tree auftauchte – das haben wir nach Ticket UX-451 angepasst."}
{"ts": "91:15", "speaker": "I", "text": "Gab es dabei spezielle Herausforderungen durch die Kombination von Offline-Funktion und Screen Reader?"}
{"ts": "91:27", "speaker": "E", "text": "Absolut. Wenn der Screen Reader während eines Sync-Vorgangs unterbrochen wird, muss der Nutzer trotzdem den Fortschritt erfassen können. Wir haben eine zusätzliche ARIA-live Region eingeführt, die auch bei unterbrochener Verbindung den letzten Sync-Status vorliest."}
{"ts": "91:54", "speaker": "I", "text": "Wie wirkt sich die Integration mit Aegis IAM, speziell SSO und RBAC, auf Ihre UX-Entscheidungen aus?"}
{"ts": "92:05", "speaker": "E", "text": "Wir mussten beim Login-Flow berücksichtigen, dass Rollen aus Aegis IAM dynamisch geladen werden. Das bedeutet, dass Feature Flags nicht nur nach Nutzergruppe, sondern teils nach RBAC-Rollen aus IAM gesteuert werden. Ein Beispiel: Admin-Rollen sehen zusätzliche Sync-Diagnoseseiten."}
{"ts": "92:32", "speaker": "I", "text": "Und welche Datenflüsse aus Helios Datalake spielen für personalisierte Inhalte eine Rolle?"}
{"ts": "92:44", "speaker": "E", "text": "Helios liefert uns z.B. Standortpräferenzen und zuletzt genutzte Module der Desktop-App. Diese Daten werden lokal gecached, um auch offline personalisierte Startbildschirme anzuzeigen. Das Mapping erfolgt über Schema HLD-PSN-03."}
{"ts": "93:12", "speaker": "I", "text": "Gab es Fälle, in denen Sicherheitsrichtlinien wie POL-SEC-001 UX-Anpassungen erforderten?"}
{"ts": "93:24", "speaker": "E", "text": "Ja, POL-SEC-001 verlangt z.B., dass sensible Datenfelder nach 30 Sekunden Inaktivität ausgeblendet werden. Das führte dazu, dass wir visuelle Countdown-Indikatoren einführen mussten, um Nutzer nicht zu irritieren. Das war ein Trade-off zwischen Sicherheit und Flow."}
{"ts": "93:50", "speaker": "I", "text": "Gab es auch Einfluss auf Ihre Offline-Strategie?"}
{"ts": "94:01", "speaker": "E", "text": "Ja, wir mussten sicherstellen, dass bei Offline-Nutzung keine sensiblen Daten länger als erlaubt im Speicher bleiben. Das haben wir mit einem lokalen Encryption-Wrapper umgesetzt, der bei Timeout die Session Files löscht."}
{"ts": "94:25", "speaker": "I", "text": "Das verknüpft ja mehrere Systeme. Würden Sie sagen, diese Cross-System-Anforderungen sind der größte UX-Treiber im Pilot?"}
{"ts": "94:38", "speaker": "E", "text": "Definitiv. Die Schnittmenge aus IAM-Rollen, Helios-Daten und Security Policies formt letztlich, wie wir Features priorisieren und designen. Das ist der Kern unserer Multi-Hop-Abwägungen im Pilotstadium."}
{"ts": "98:00", "speaker": "I", "text": "Wir waren eben bei der Integration mit Helios Datalake – können Sie mir schildern, wie sich die personalisierten Datenströme konkret auf die Offline-Sync-Architektur auswirken?"}
{"ts": "98:15", "speaker": "E", "text": "Ja, das ist ein heikler Punkt. Die Personalisierung ist stark abhängig von Kontextdaten aus Helios. Diese liegen nicht immer in Echtzeit vor, daher haben wir im Sync-Engine-Modul einen Fallback-Mechanismus implementiert, der gemäß RB-MOB-018 auf den letzten validierten Datensatz zurückgreift, wenn der Datalake nicht erreichbar ist."}
{"ts": "98:40", "speaker": "I", "text": "Gab es dafür spezielle QA-Szenarien im Pilot?"}
{"ts": "98:50", "speaker": "E", "text": "Ja, wir haben in Testlauf T-ATL-044 gezielt die Datalake-Verbindung unterbrochen und geprüft, ob unsere Caching-Strategie die Accessibility-Vorgaben nicht verletzt. Zum Beispiel müssen Screen Reader auch im Offline-Zustand die personalisierten Labels korrekt vorlesen."}
{"ts": "99:15", "speaker": "I", "text": "Und wie fließt dabei Aegis IAM ein?"}
{"ts": "99:25", "speaker": "E", "text": "Aegis IAM liefert die Rollen- und Gruppeninformationen für RBAC. Wenn ein Nutzer offline geht, speichern wir ein temporäres Rollen-Token ab. Das ist verschlüsselt (AES-256, Policy POL-SEC-001) und beim nächsten Online-Zyklus wird es gegen den IAM-Server validiert. Das beeinflusst, welche UI-Elemente sichtbar bleiben."}
{"ts": "99:55", "speaker": "I", "text": "Das klingt nach einer Balance zwischen Sicherheit und Usability."}
{"ts": "100:05", "speaker": "E", "text": "Genau, wir mussten entscheiden: Entweder schalten wir alles bei Offline sofort ab – was sicher, aber frustrierend ist – oder wir erlauben zeitlich begrenzt Funktionen. Die Entscheidung fiel auf Letzteres, basierend auf Risikoabschätzung aus Ticket SEC-ATL-207."}
{"ts": "100:30", "speaker": "I", "text": "Gab es Bedenken seitens des Security-Teams?"}
{"ts": "100:40", "speaker": "E", "text": "Ja, die Security-Kollegen wollten einen 5-Minuten-Timeout. Wir haben uns nach mehreren Usability-Tests auf 15 Minuten geeinigt, um die Task Completion Rate nicht zu halbieren. Dokumentiert ist das im RFC-ATL-09."}
{"ts": "101:05", "speaker": "I", "text": "Wie dokumentieren Sie solche Kompromisse im UX-Team?"}
{"ts": "101:15", "speaker": "E", "text": "Wir nutzen eine interne Confluence-Seite ‚UX-Tradeoffs‘, dort verlinken wir Runbooks, RFCs und Testergebnisse. Für diesen Fall haben wir auch ein Video der Testsession abgelegt, um die Argumentation für spätere Phasen transparent zu halten."}
{"ts": "101:40", "speaker": "I", "text": "Hatten diese Entscheidungen Auswirkungen auf das Designsystem DS-ATLAS v2?"}
{"ts": "101:50", "speaker": "E", "text": "Ja, wir haben neue State-Token eingeführt, z.B. `state-offline-degraded`, damit Komponenten visuell und semantisch signalisieren, dass eingeschränkte Funktionen aktiv sind. Das erleichtert sowohl Entwicklern als auch Nutzern die Orientierung."}
{"ts": "102:15", "speaker": "I", "text": "Gab es schon Rückmeldungen aus dem Pilot hierzu?"}
{"ts": "102:25", "speaker": "E", "text": "Positive, größtenteils. Ein paar Power-User fanden die 15 Minuten zu lang, was wir im Rahmen der nächsten Iteration evaluieren. Wir planen dafür ein A/B-Test-Setup unter Feature Flag FF-OFFLINE-TIMEOUT, um belastbare Daten zu sammeln."}
{"ts": "114:00", "speaker": "I", "text": "Wenn wir jetzt ein bisschen auf die Lessons Learned schauen – gab es in der Pilotphase einen Moment, in dem Sie das komplette UX-Konzept überdenken mussten?"}
{"ts": "114:15", "speaker": "E", "text": "Ja, tatsächlich im Zusammenhang mit der Offline-Sync-Logik. Wir hatten in Ticket MOB-457 einen Fall, wo die Synchronisation bei schlechter Netzabdeckung zu UI-Freezes geführt hat. Da mussten wir kurzfristig den Synchronisations-Interval per Feature Flag \"sync_throttle\" drosseln und die visuelle Rückmeldung im Interface anpassen."}
{"ts": "114:38", "speaker": "I", "text": "Wie haben Sie diese Anpassung getestet, um sicherzustellen, dass sie nicht andere Funktionen beeinträchtigt?"}
{"ts": "114:48", "speaker": "E", "text": "Wir haben uns an RB-MOB-021 orientiert – darin ist ein Testplan für kritische Pfade mit reduzierter Sync-Frequenz dokumentiert. Zusätzlich haben wir mit dem QA-Team in der Staging-Umgebung simulierte 2G-Netzwerke gefahren."}
{"ts": "115:08", "speaker": "I", "text": "Und wie hat das Aegis IAM in dieser Situation mitgespielt, gerade bei Sessions, die länger offline waren?"}
{"ts": "115:20", "speaker": "E", "text": "Das war knifflig. Aegis IAM erzwingt nach POL-SEC-001 ein Re-Auth nach 15 Minuten Inaktivität. Offline-Nutzer bekamen dann ein Re-Login Prompt, sobald sie wieder online waren – das haben wir durch einen Zwischenscreen mit lokal gespeicherten Session-Infos etwas abgefedert."}
{"ts": "115:45", "speaker": "I", "text": "Gab es Feedback von Pilotnutzern zu diesem Zwischenscreen?"}
{"ts": "115:55", "speaker": "E", "text": "Ja, gemischt. Einige fanden die Statusanzeige hilfreich, andere empfanden sie als Hürde. Wir haben daraufhin im Designsystem DS-ATLAS v2 ein optionales Inline-Login-Formular ergänzt, das per Feature Flag gesteuert wird."}
{"ts": "116:18", "speaker": "I", "text": "Interessant. Nun, beim Helios Datalake – gab es da Latenzprobleme, die das UX beeinflusst haben?"}
{"ts": "116:28", "speaker": "E", "text": "In der Tat. Die Personalisierungs-APIs aus Helios hatten in Peak-Zeiten über 1,2 Sekunden Response Time. Wir haben dann temporär auf lokal gecachte Empfehlungen umgestellt, was aber bedeutete, dass die Inhalte nicht immer tagesaktuell waren."}
{"ts": "116:50", "speaker": "I", "text": "Wie haben Sie diesen Trade-off den Stakeholdern kommuniziert?"}
{"ts": "117:00", "speaker": "E", "text": "Wir haben einen kurzen Impact-Report auf Basis von SLA-Daten erstellt und im wöchentlichen Pilot-Review vorgestellt. Der Report zeigte klar, dass die wahrgenommene App-Geschwindigkeit wichtiger war als die absolute Aktualität der Inhalte."}
{"ts": "117:20", "speaker": "I", "text": "Gab es Überlegungen, die SLA-Anforderungen für den Datalake anzupassen?"}
{"ts": "117:30", "speaker": "E", "text": "Kurzfristig nein, weil das ein Plattformthema ist. Langfristig haben wir aber ein RFC-Document erstellt (RFC-ATL-09), das vorschlägt, für Mobile Clients ein bevorzugtes Query-Pfad mit Caching zu implementieren."}
{"ts": "117:50", "speaker": "I", "text": "Wenn Sie jetzt zurückblicken, welche Entscheidung war aus Ihrer Sicht die riskanteste im Pilot?"}
{"ts": "118:00", "speaker": "E", "text": "Die riskanteste war sicher, den Offline-Sync-Algorithmus parallel mit der IAM-Session-Logik zu ändern. Zwei kritische Subsysteme gleichzeitig anzufassen birgt immer die Gefahr von Regressionen. Wir haben das nur gewagt, weil wir eine saubere Rollback-Strategie im Runbook RB-MOB-021 hatten und die Feature Flags uns erlaubten, selektiv zurückzuschalten."}
{"ts": "122:00", "speaker": "I", "text": "Sie hatten vorhin angedeutet, dass das Ticket MOB-4472 ein gutes Beispiel für die Wechselwirkung zwischen Offline-Sync und Security sei – könnten Sie das noch einmal genauer erklären?"}
{"ts": "122:08", "speaker": "E", "text": "Ja, gern. In MOB-4472 ging es darum, dass ein Nutzer mit Screen Reader im Offline-Modus bestimmte Fehlermeldungen nicht korrekt vorgelesen bekam, weil die Meldung eigentlich aus dem serverseitigen Validierungs-Workflow kam, der über Aegis IAM lief. Und durch POL-SEC-001 mussten wir sensible Felder maskieren, was den Screen Reader aus dem Tritt brachte."}
{"ts": "122:24", "speaker": "I", "text": "Das klingt nach einer komplexen Kette von Abhängigkeiten – wie sind Sie da vorgegangen?"}
{"ts": "122:30", "speaker": "E", "text": "Wir haben uns an RB-MOB-021 orientiert, das beschreibt den Fallback-Flow bei fehlender Serververbindung. Dort steht u.a., dass für sicherheitsrelevante Felder nur generische Platzhalter vorzulesen sind. Unser UX-Team hat das erweitert, sodass der Screen Reader eine kurze, aber barrierefreie Fehlerbeschreibung liefert, ohne Details zu verraten."}
{"ts": "122:50", "speaker": "I", "text": "Mussten dafür auch Feature Flags angepasst werden?"}
{"ts": "122:54", "speaker": "E", "text": "Ja, wir haben das Flag `ff_accessibility_enhanced_errors` temporär nur für die Pilot-Nutzer aktiviert. Das war wichtig, um A/B-Tests zu fahren und zu prüfen, ob die neue Formulierung die Verständlichkeit verbessert, ohne gegen die Security-Policy zu verstoßen."}
{"ts": "123:09", "speaker": "I", "text": "Gab es messbare Auswirkungen auf die Performance im Offline-Modus?"}
{"ts": "123:14", "speaker": "E", "text": "Minimal. Laut den Metriken aus den Testläufen – das ist SLA-Sync-05 – stieg die Latenz um etwa 50 ms, weil die generische Meldung aus einem lokal verschlüsselten Katalog geladen wird. Das war für uns akzeptabel."}
{"ts": "123:28", "speaker": "I", "text": "Wie haben Sie die Nutzerreaktionen erfasst?"}
{"ts": "123:32", "speaker": "E", "text": "Über Helios Datalake flossen anonymisierte Feedback-Snippets ein, markiert mit dem Flag-Status. Wir konnten so sehen, dass 82 % der betroffenen Nutzer die Meldung als 'verständlich' markierten, was ein signifikanter Anstieg zum vorherigen Wert war."}
{"ts": "123:48", "speaker": "I", "text": "Und wie stellen Sie sicher, dass solche Anpassungen später in den Main Branch übernommen werden?"}
{"ts": "123:53", "speaker": "E", "text": "Das läuft über unseren Release-Workflow: Sobald die Kriterien aus RB-MOB-021 Anhang C erfüllt sind, wird das Feature Flag in `global_defaults.yaml` auf `true` gesetzt. Vorher müssen QA und Security ein gemeinsames Abnahmeprotokoll unterschreiben."}
{"ts": "124:10", "speaker": "I", "text": "Gab es in diesem Prozess Zielkonflikte zwischen QA und Security?"}
{"ts": "124:15", "speaker": "E", "text": "Einmal, ja. QA wollte mehr Kontext in den Offline-Fehlermeldungen, Security warnte vor potenzieller Informationspreisgabe. Wir haben dann gemäß POL-SEC-001 Abschnitt 4.2 einen Kompromiss definiert: Kontext wird nur bei nicht-sensitiven Feldern hinzugefügt."}
{"ts": "124:32", "speaker": "I", "text": "Hat diese Erfahrung Ihre Herangehensweise an künftige Designentscheidungen verändert?"}
{"ts": "124:36", "speaker": "E", "text": "Definitiv. Wir binden Security nun schon in der Wireframe-Phase ein, gerade bei Features mit Offline-Komponente. Das spart später Tickets wie MOB-4472 und reduziert Iterationsschleifen erheblich."}
{"ts": "130:00", "speaker": "I", "text": "Könnten Sie bitte ein Beispiel geben, wo Sie wegen Performance-Limits ein UX-Konzept ändern mussten?"}
{"ts": "130:05", "speaker": "E", "text": "Ja, klar. Beim Offline-Sync hatten wir ursprünglich vorgesehen, dass die gesamte Transaktionshistorie geladen wird. Aber Load-Tests im Pilot gemäss Runbook RB-MOB-021, Abschnitt 4.2, zeigten, dass dies auf älteren Geräten zu Timeouts führte."}
{"ts": "130:13", "speaker": "E", "text": "Wir haben dann ein Pagination-Pattern eingeführt, inspiriert von unserem DS-ATLAS v2 Infinite Scroll Modul, um nur 50 Einträge pro Batch zu laden."}
{"ts": "130:20", "speaker": "I", "text": "Gab es dazu ein entsprechendes Ticket im Pilotbetrieb?"}
{"ts": "130:23", "speaker": "E", "text": "Ja, das war Ticket MOB-PILOT-584. Dort haben wir dokumentiert, wie wir das UX-Layout anpassen und die Ladeindikatoren einführen, um den Nutzer nicht im Dunkeln zu lassen."}
{"ts": "130:32", "speaker": "I", "text": "Wie haben Sie dabei das Verhältnis zwischen Sicherheit und Nutzerfreundlichkeit bewertet?"}
{"ts": "130:36", "speaker": "E", "text": "Unter POL-SEC-001 dürfen wir keine sensiblen Daten im Cache behalten. Das heißt, selbst bei Pagination mussten wir jeden Batch verschlüsselt zwischenspeichern und nach 5 Minuten Inaktivität löschen."}
{"ts": "130:44", "speaker": "E", "text": "Das erhöht den CPU-Overhead, aber wir haben uns für diesen Trade-off entschieden, um Compliance zu gewährleisten."}
{"ts": "130:50", "speaker": "I", "text": "Hatten Sie bei der Implementierung Rückmeldungen von Testnutzern?"}
{"ts": "130:54", "speaker": "E", "text": "Ja, in den UX-Feedback-Sessions der Woche 6 haben 3 von 12 Teilnehmern angemerkt, dass der erneute Sync nach Inaktivität nervig sei – wir haben das in MOB-PILOT-612 erfasst."}
{"ts": "131:02", "speaker": "E", "text": "Wir überlegen jetzt, ob wir über Feature Flags eine erweiterte Session-Lifetime für Nutzer mit Role 'FieldAgent' in Aegis IAM testen."}
{"ts": "131:10", "speaker": "I", "text": "Das klingt nach einer gezielten Ausnahme – wie steuern Sie das technisch?"}
{"ts": "131:14", "speaker": "E", "text": "Wir koppeln das Flag 'extended_offline_session' an die RBAC-Claims aus Aegis IAM. Der Flag-Check passiert direkt im Sync-Manager, bevor RB-MOB-021 Step 3 ausgeführt wird."}
{"ts": "131:22", "speaker": "I", "text": "Sehen Sie Risiken bei diesem Ansatz?"}
{"ts": "131:25", "speaker": "E", "text": "Ja, klar – wenn ein Gerät verloren geht und die Session länger gültig bleibt, steigt das Risiko unautorisierter Zugriffe. Deshalb wollen wir das nur mit MDM-Policy 'DEV-LOCK-07' kombinieren, die Device-Wipe bei Verlust erzwingt."}
{"ts": "131:31", "speaker": "E", "text": "Wir werden das im nächsten Sprint als A/B-Test fahren und in SLA-Monitoring-Report 2024-W10 evaluieren."}
{"ts": "132:00", "speaker": "I", "text": "Zum Abschluss würde ich gerne noch einmal auf die konkreten Entscheidungen eingehen, die Sie in der Pilotphase treffen mussten – vor allem wenn Performance und Sicherheit kollidierten."}
{"ts": "132:15", "speaker": "E", "text": "Ja, ein Beispiel war das Offline-Caching von personalisierten Dashboard-Daten. Wir wollten ursprünglich eine 24-Stunden-Retention implementieren, aber POL-SEC-001 erlaubt nur 8 Stunden für sensible Inhalte."}
{"ts": "132:34", "speaker": "I", "text": "Und wie haben Sie das dann gelöst, ohne den Nutzerfluss zu sehr zu stören?"}
{"ts": "132:44", "speaker": "E", "text": "Wir haben laut RB-MOB-021 ein gestaffeltes Sync-Intervall eingeführt – acht Stunden für sensible, 24 Stunden für generische Daten. Das erforderte ein zusätzliches Flag im Synchronisationsmodul."}
{"ts": "133:02", "speaker": "I", "text": "Gab es dazu ein Ticket, das den Prozess dokumentiert?"}
{"ts": "133:08", "speaker": "E", "text": "Ja, das war Ticket UX-ATL-458. Darin haben wir die Anpassung der Cache-Policy und die UI-Hinweistexte für Datenablaufzeiten festgehalten."}
{"ts": "133:24", "speaker": "I", "text": "Wie haben Sie die Nutzer über diese Ablaufzeiten informiert?"}
{"ts": "133:32", "speaker": "E", "text": "Wir zeigen eine kleine Banner-Notification, wenn ein Datensatz älter als sechs Stunden ist. Dadurch haben sie noch zwei Stunden Puffer, bevor er automatisch gelöscht wird."}
{"ts": "133:48", "speaker": "I", "text": "Hat das Einfluss auf die Barrierefreiheit gehabt?"}
{"ts": "133:56", "speaker": "E", "text": "Minimal. Wir mussten sicherstellen, dass der Screen Reader die Banner-Meldung sofort vorliest und sie nicht im ARIA-Live-Region-Puffer verschwindet."}
{"ts": "134:12", "speaker": "I", "text": "Gab es dabei Performance-Einbußen, z.B. durch häufigere Syncs?"}
{"ts": "134:20", "speaker": "E", "text": "Etwas mehr Serverlast, ja. Aber laut SLA-MOB-02 war der Anstieg von 3% akzeptabel. Wir haben das im Monitoring-Dashboard M-ATL-Perf bestätigt."}
{"ts": "134:36", "speaker": "I", "text": "Wie haben Sie das Monitoring konfiguriert, um diese spezielle Änderung zu prüfen?"}
{"ts": "134:44", "speaker": "E", "text": "Wir haben einen Custom-Metric-Stream eingerichtet, der Cache-Hit-Raten und Sync-Frequenz trennt zwischen sensiblen und generischen Datensätzen. Das war ein Vorschlag aus dem Ops-Team."}
{"ts": "135:02", "speaker": "I", "text": "Und wenn Sie zurückblicken – war die Entscheidung eher ein Kompromiss oder ein Gewinn für beide Seiten?"}
{"ts": "135:12", "speaker": "E", "text": "Es war ein Kompromiss, aber einer, der die Sicherheitsrichtlinien erfüllt und dennoch die UX nicht übermäßig verschlechtert hat. Die Akzeptanzquote in den Umfragen blieb über 85%, was uns Recht gibt."}
{"ts": "140:00", "speaker": "I", "text": "Sie hatten vorhin erwähnt, dass RB-MOB-021 bei der letzten Anpassung eine wesentliche Rolle gespielt hat. Können Sie konkret beschreiben, wie dieser Runbook-Eintrag den finalen UX-Flow beeinflusst hat?"}
{"ts": "140:25", "speaker": "E", "text": "Ja, klar. RB-MOB-021 enthält einen Abschnitt zur 'Progressive Data Loading Strategy'. Wir mussten den Onboarding-Flow so umbauen, dass kritische Auth-Daten über Aegis IAM zuerst geladen werden, bevor personalisierte Inhalte aus Helios Datalake nachgezogen werden. Das war nicht unsere ursprüngliche Reihenfolge, aber es senkte das Risiko von Race Conditions laut den im Ticket UX-458 dokumentierten Tests."}
{"ts": "140:58", "speaker": "I", "text": "Gab es für diesen Umbau auch Performance-Metriken, die Sie als Zielwerte hatten?"}
{"ts": "141:15", "speaker": "E", "text": "Ja, wir hatten ein SLA von unter 3 Sekunden für den ersten interaktiven Screen. Die Vorgabe steht in SLA-MOB-003. Mit der neuen Reihenfolge lagen wir in den Staging-Tests bei 2,7 Sekunden median, was knapp, aber im Rahmen war."}
{"ts": "141:42", "speaker": "I", "text": "Und wie wurde das in der Pilotphase jetzt schon von Testnutzern wahrgenommen?"}
{"ts": "142:00", "speaker": "E", "text": "Interessanterweise gab es in den Feedback-Forms weniger Beschwerden über Ladezeiten, aber einige Nutzer fanden die initiale Ansicht etwas generisch, weil personalisierte Inhalte eben erst später geladen werden. Wir haben das in JIRA-Pilot-92 als Beobachtung vermerkt."}
{"ts": "142:28", "speaker": "I", "text": "Wie gehen Sie mit diesem Trade-off zwischen Geschwindigkeit und Personalisierung um?"}
{"ts": "142:46", "speaker": "E", "text": "Wir evaluieren eine Zwischenlösung: ein Platzhalter-Layout basierend auf generischen Token aus DS-ATLAS v2. So wirkt der Screen nicht leer, und wir können trotzdem die Sicherheitsreihenfolge aus RB-MOB-021 einhalten."}
{"ts": "143:12", "speaker": "I", "text": "Klingt nach einer guten Balance. Haben Sie das schon mit dem Accessibility-Team geprüft?"}
{"ts": "143:29", "speaker": "E", "text": "Ja, wir haben die Platzhalter mit ARIA-Tags versehen, damit Screen Reader die temporären Elemente als 'Ladeinhalte' ansagen. Das war wichtig, um die WCAG 2.1 AA-Konformität zu wahren. Wir haben dazu einen internen Audit-Report ACC-REP-14 erstellt."}
{"ts": "143:56", "speaker": "I", "text": "Gab es dabei technische Hürden mit der Offline-Sync-Logik?"}
{"ts": "144:15", "speaker": "E", "text": "Ja, der Offline-Sync puffert manchmal alte Platzhalter, wenn der Nutzer sehr lange offline ist. Wir mussten deshalb in SyncJob-Handler v1.4 eine TTL für Platzhalter-Assets einführen, damit bei der nächsten Verbindung frische Daten geladen werden."}
{"ts": "144:42", "speaker": "I", "text": "Wurde diese Änderung auch in den Feature-Flag-Workflows berücksichtigt?"}
{"ts": "145:00", "speaker": "E", "text": "Definitiv. Wir haben ein Flag 'ff_placeholder_ttl' in der Config. In der Pilotphase ist es nur für die Gruppe 'beta-accessibility' aktiv, um gezielt Feedback zu sammeln. Das Mapping dazu ist in FF-MAP-09 dokumentiert."}
{"ts": "145:28", "speaker": "I", "text": "Abschließend: sehen Sie noch Risiken, falls diese Lösung in den Rollout geht?"}
{"ts": "145:50", "speaker": "E", "text": "Das größte Risiko ist, dass bei langsamen Netzwerken der Wechsel vom Platzhalter zum personalisierten Inhalt als Flackern wahrgenommen wird. Wir evaluieren daher eine sanfte Fade-Animation, müssen aber prüfen, ob dies mit den Performance-Constraints aus SLA-MOB-003 vereinbar ist."}
{"ts": "152:00", "speaker": "I", "text": "Zum Abschluss unseres Gesprächs würde ich gern noch einmal auf die konkreten Trade-offs eingehen, die Sie in der letzten Iteration entscheiden mussten. Können Sie ein Beispiel nennen, wo Performance-Beschränkungen eine UX-Entscheidung direkt beeinflusst haben?"}
{"ts": "152:06", "speaker": "E", "text": "Ja, in Sprint 14 hatten wir das Problem, dass die Offline-Sync-Routinen bei großen Datenmengen aus dem Helios Datalake zu lange blockierten. Laut RB-MOB-021 sollten wir in solchen Fällen Lazy Loading einsetzen. Das hat aber bedeutet, dass einige Inhalte erst nach und nach erschienen, was für manche User weniger intuitiv war."}
{"ts": "152:14", "speaker": "I", "text": "Und wie haben Sie diesen Kompromiss kommuniziert? Gab es interne oder externe Dokumentation dazu?"}
{"ts": "152:19", "speaker": "E", "text": "Wir haben ein internes Ticket, UX-2456, erstellt, darin die Anpassung an die Vorgaben aus RB-MOB-021 begründet und Screenshots der Ladeindikatoren beigefügt. Für die Pilotnutzer gab es ein In-App-Hinweisbanner mit Verweis auf die FAQ."}
{"ts": "152:27", "speaker": "I", "text": "Hat die Sicherheitsrichtlinie POL-SEC-001 in diesem Fall auch eine Rolle gespielt?"}
{"ts": "152:32", "speaker": "E", "text": "Indirekt ja. Die Policy fordert, dass bei teilgeladenen Daten keine sensiblen Inhalte angezeigt werden dürfen. Also mussten wir beim Lazy Loading sicherstellen, dass Platzhalter verwendet werden, bis Aegis IAM die Berechtigungen geprüft hat."}
{"ts": "152:40", "speaker": "I", "text": "Gab es technische Herausforderungen bei der Umsetzung dieser Platzhalter-Logik?"}
{"ts": "152:44", "speaker": "E", "text": "Definitiv. Unser Component-Framework aus DS-ATLAS v2 musste erweitert werden, um dynamisch zwischen 'loading', 'placeholder' und 'content' zu wechseln. Wir haben dafür ein neues Token 'state-secure-loading' eingeführt und in der UI-Library dokumentiert."}
{"ts": "152:53", "speaker": "I", "text": "Wie haben Sie diese Änderung getestet, insbesondere in Kombination mit Screen Readern?"}
{"ts": "152:58", "speaker": "E", "text": "Wir haben mit dem Accessibility-Testplan A11Y-ATLAS-03 gearbeitet. Die Platzhalter erhielten ARIA-Rollen, sodass Screen Reader 'Inhalt wird geladen' korrekt ansagen. Die Tests umfassten Offline- und Online-Szenarien, um sicherzustellen, dass keine leeren Container vorgelesen werden."}
{"ts": "153:07", "speaker": "I", "text": "Gab es Feedback von Pilotnutzern zu dieser Lösung?"}
{"ts": "153:11", "speaker": "E", "text": "Ja, gemischtes. Positiv war, dass Sicherheitsaspekte gewahrt blieben. Negativ: ein Teil der Nutzer empfand die Ladeanimationen als zu häufig. Wir planen daher, in RB-MOB-021 einen Hinweis aufzunehmen, wie man Animationen dezent halten kann."}
{"ts": "153:20", "speaker": "I", "text": "Welche weiteren Risiken sehen Sie aktuell für die UX im Atlas Mobile Pilot?"}
{"ts": "153:24", "speaker": "E", "text": "Ein Risiko ist, dass Feature Flags zu lange aktiv bleiben und unterschiedliche Nutzergruppen sehr verschiedene Interfaces sehen. Das erschwert Support und kann zu Inkompatibilitäten mit Helios-Datenströmen führen."}
{"ts": "153:32", "speaker": "I", "text": "Wie steuern Sie das? Gibt es dafür ein Runbook oder SLA?"}
{"ts": "153:36", "speaker": "E", "text": "Ja, laut SLA-MOB-07 müssen Feature Flags nach max. 6 Wochen konsolidiert werden. Das Runbook RB-FLG-004 beschreibt den Offboarding-Prozess, inklusive UX-Regressionstests und Abgleich mit Aegis-RBAC-Profilen."}
{"ts": "153:36", "speaker": "I", "text": "Zum Abschluss würde ich gern noch einmal auf die konkreten Trade-offs zurückkommen, die Sie in der Pilotphase von Atlas Mobile hatten. Gab es eine Situation, wo Performance und Security in direktem Konflikt standen?"}
{"ts": "153:41", "speaker": "E", "text": "Ja, das war ziemlich deutlich beim Offline-Sync. Wir hatten im Ticket MOB-3472 eine sehr konkrete Anfrage vom Security-Team, persistente Tokens nur verschlüsselt im SecureStore zu halten, was aber die Latenz beim Sync um bis zu 300 ms erhöht hat."}
{"ts": "153:48", "speaker": "I", "text": "Und wie sind Sie damit umgegangen? Haben Sie das so übernommen oder gab es einen Kompromiss?"}
{"ts": "153:53", "speaker": "E", "text": "Wir haben uns auf die Empfehlung aus dem Runbook RB-MOB-021 gestützt. Dort steht in Abschnitt 4.2, dass für Pilotumgebungen eine hybride Lösung erlaubt ist: Der erste Zugriff wird aus dem Cache bedient, parallel läuft dann die Entschlüsselung für das nächste Sync-Fenster."}
{"ts": "154:01", "speaker": "I", "text": "Klingt nach einer cleveren Lösung. Hat das irgendwelche Auswirkungen auf die User Experience gehabt, vor allem bei Screen-Reader-Nutzern?"}
{"ts": "154:06", "speaker": "E", "text": "Minimal. Wir haben in den Accessibility-Tests mit VoiceOver und TalkBack festgestellt, dass sich der erste Ladevorgang subjektiv schneller anfühlte, weil die ersten Daten sofort angezeigt wurden. Die Hintergrundentschlüsselung war transparent."}
{"ts": "154:14", "speaker": "I", "text": "Wie haben Sie das dokumentiert? Geht so etwas in ein spezielles Pilot-Log ein?"}
{"ts": "154:19", "speaker": "E", "text": "Ja, wir haben einen Eintrag in der Pilot-Doku unter P-ATL-DOC-SECUX-05 angelegt und das Ticket MOB-3472 mit der genauen Implementierung und Performance-Messung verlinkt. Außerdem gibt es in Confluence eine Lessons-Learned-Seite."}
{"ts": "154:27", "speaker": "I", "text": "Gab es noch andere Sicherheitsrichtlinien wie POL-SEC-001, die Sie im UX-Design einschränken mussten?"}
{"ts": "154:32", "speaker": "E", "text": "Ja, POL-SEC-001 Abschnitt 3.5 schreibt vor, dass keine sensiblen Inhalte im Notification-Preview erscheinen dürfen. Das hat bedeutet, dass wir die Quick-Action-Buttons in Push-Nachrichten entfernen mussten, was die Interaktion verkürzt, aber sicherer macht."}
{"ts": "154:40", "speaker": "I", "text": "Wie haben die Pilotnutzer darauf reagiert?"}
{"ts": "154:44", "speaker": "E", "text": "Gemischt. Einige fanden es unpraktisch, nicht direkt aus der Notification reagieren zu können. Wir haben das als potenziellen Verbesserungspunkt für eine spätere Phase markiert, eventuell mit abgestuften Sichtbarkeitsstufen je nach RBAC-Role aus Aegis IAM."}
{"ts": "154:53", "speaker": "I", "text": "Das heißt, Sie würden Feature Flags nutzen, um das differenziert auszurollen?"}
{"ts": "154:57", "speaker": "E", "text": "Genau. Wir würden ein Flag wie UX-NOTIF-ROLE-RESP hinterlegen und es nur für bestimmte Testgruppen aktivieren, um Daten zu sammeln. Das ist derselbe Mechanismus, den wir in MOB-3351 für den neuen Karten-Explorer genutzt haben."}
{"ts": "155:05", "speaker": "I", "text": "Letzte Frage: Wenn Sie auf die Pilotphase zurückblicken, was war der wichtigste Trade-off, den Sie bewusst eingegangen sind?"}
{"ts": "155:10", "speaker": "E", "text": "Ganz klar die Balance zwischen sofortiger Verfügbarkeit der Daten (UX) und maximaler Sicherheit bei der Speicherung. Wir haben gelernt, dass kleine technische Kniffe aus den Runbooks große Wirkung haben können, ohne die Compliance zu verletzen."}
{"ts": "155:06", "speaker": "I", "text": "Zum Thema Performance—Sie hatten im letzten Sprint erwähnt, dass einige Komponenten in der Offline-Sync Pipeline überarbeitet wurden. Können Sie genauer beschreiben, was da angepasst wurde?"}
{"ts": "155:14", "speaker": "E", "text": "Ja, wir haben bei der Delta-Detection einen Schritt eingefügt, der Dateihashes lokal cached. Damit mussten wir nicht mehr bei jedem Sync alle Assets neu validieren. Das hat im internen Test laut Logfile 23% Sync-Zeit gespart."}
{"ts": "155:29", "speaker": "I", "text": "Gab es dabei Auswirkungen auf die Screen Reader-Kompatibilität oder Accessibility allgemein?"}
{"ts": "155:36", "speaker": "E", "text": "Nur minimal—wir mussten sicherstellen, dass der Sync-Indikator weiterhin per aria-live aktualisiert wird. Wir haben das im Accessibility-Check gegen unser internes Prüfschema ACC-ATLAS-05 validiert."}
{"ts": "155:51", "speaker": "I", "text": "Inwiefern flossen diese Anpassungen in Ihre Feature Flag Tests ein?"}
{"ts": "155:58", "speaker": "E", "text": "Wir haben ein Flag `sync_opt_v3` gesetzt, das nur für die interne Pilotgruppe im Aegis IAM Segment 'UX-Lab' aktiv war. So konnten wir parallel alte und neue Sync-Logik messen, bevor wir breiter ausrollen."}
{"ts": "156:14", "speaker": "I", "text": "Und die Datenanalyse der beiden Gruppen lief dann ebenfalls über Helios Datalake?"}
{"ts": "156:20", "speaker": "E", "text": "Genau, wir haben die Metrics in Helios als Stream `atlas_sync_perf` gespeichert und mit User-Profil-Daten aus Aegis verknüpft. Das half uns zu sehen, ob bestimmte Rollen wie 'FieldAgent' stärker profitieren."}
{"ts": "156:37", "speaker": "I", "text": "Könnte das auch Implikationen für die RBAC-basierten UI-Anpassungen haben, die Sie vorhin erwähnt hatten?"}
{"ts": "156:44", "speaker": "E", "text": "Ja, wir überlegen, ob wir Sync-Intervalle dynamisch je nach Rolle setzen. Das müsste aber gegen POL-SEC-001 geprüft werden, weil unterschiedliche Intervalle evtl. als Informationsleck interpretiert werden könnten."}
{"ts": "157:02", "speaker": "I", "text": "Das klingt nach einem klassischen Trade-off zwischen UX-Optimierung und Sicherheit."}
{"ts": "157:07", "speaker": "E", "text": "Absolut. Wir würden das laut Runbook RB-MOB-021 unter 'Security Impact Assessment' dokumentieren und erst nach Freigabe durch den Security Officer umsetzen."}
{"ts": "157:21", "speaker": "I", "text": "Gab es in der Vergangenheit ähnliche Fälle, bei denen das Runbook direkt Designänderungen ausgelöst hat?"}
{"ts": "157:28", "speaker": "E", "text": "Ja, Ticket UX-4312: Wir mussten die Auto-Login-Funktion für bestimmte Geräte deaktivieren, weil der SSO-Token-Cache zu lange persistiert wurde. RB-MOB-021 gab vor, dass in so einem Fall die UX-Option 'Stay signed in' ausgeblendet wird."}
{"ts": "157:47", "speaker": "I", "text": "Wie kommunizieren Sie solche Änderungen an die Pilotnutzer, ohne die Tests zu verfälschen?"}
{"ts": "157:54", "speaker": "E", "text": "Wir nutzen ein neutrales Changelog im In-App Help-Center, das nur technische Hinweise wie 'Sicherheitsupdate – keine Aktion erforderlich' enthält. So bleiben die Nutzererwartungen möglichst unbeeinflusst."}
{"ts": "160:06", "speaker": "I", "text": "Sie hatten ja vorhin erwähnt, dass POL-SEC-001 bei Ihnen zu konkreten UI-Anpassungen geführt hat. Können Sie das noch mal im Detail erläutern?"}
{"ts": "160:11", "speaker": "E", "text": "Ja, klar. Also, die Richtlinie schreibt eine Zwei-Faktor-Authentifizierung für sensible Daten vor. Das führte dazu, dass wir bei bestimmten RBAC-Rollen einen zusätzlichen Dialog einblenden mussten, noch bevor der eigentliche Content aus dem Helios Datalake geladen wird."}
{"ts": "160:17", "speaker": "E", "text": "Das war tricky, weil wir dadurch den Offline-Sync-Flow unterbrechen mussten, wenn der Token abgelaufen war. Wir haben das dann mit einem Zwischencache gelöst, wie in RB-MOB-021 Abschnitt 3.2 beschrieben."}
{"ts": "160:23", "speaker": "I", "text": "Und das hat sich auf die Performance ausgewirkt?"}
{"ts": "160:27", "speaker": "E", "text": "Minimal, aber messbar. In Ticket UX-473 haben wir dokumentiert, dass die Ladezeit bei First-Load um ca. 400ms erhöht wurde. Das war aber innerhalb unseres SLA für Pilotkunden (Response < 2s)."}
{"ts": "160:33", "speaker": "I", "text": "Gab es da Zielkonflikte zwischen Sicherheit und Benutzerfreundlichkeit?"}
{"ts": "160:38", "speaker": "E", "text": "Ja, definitiv. Wir mussten abwägen, ob wir die UX vereinfachen, indem wir weniger Security-Prompts zeigen, oder ob wir streng nach Policy gehen. Letztlich wurde in der Change-Advisory-Session vom 12.05. beschlossen, Policy-konform zu bleiben, aber mit erklärenden Tooltips."}
{"ts": "160:45", "speaker": "I", "text": "Interessant. Haben Sie diese Tooltips über Feature Flags ausgerollt?"}
{"ts": "160:49", "speaker": "E", "text": "Genau, wir hatten ein Flag `ff_ux_security_tooltips`, das wir nur für die Gruppe 'Pilot_DE' aktiviert haben. So konnten wir A/B testen, ob die Hinweise tatsächlich die Completion-Rate erhöhen."}
{"ts": "160:55", "speaker": "E", "text": "Das Experiment lief zwei Wochen, Auswertung in BI-Report #HLX-221. Ergebnis: +8% bei erfolgreicher 2FA-Eingabe ohne Support-Kontakt."}
{"ts": "161:01", "speaker": "I", "text": "Gab es auch Auswirkungen auf die Accessibility?"}
{"ts": "161:05", "speaker": "E", "text": "Ja, wir mussten die Tooltips screenreader-kompatibel gestalten. In DS-ATLAS v2 haben wir dafür das `aria-describedby`-Pattern aus dem Accessibility-Guide A11Y-ATL-04 übernommen."}
{"ts": "161:10", "speaker": "E", "text": "Wir haben das mit VoiceOver und TalkBack getestet, und festgestellt, dass wir bei Android die Verzögerung zwischen Tooltip-Trigger und Sprachausgabe von 1.5s auf 0.5s reduzieren konnten."}
{"ts": "161:16", "speaker": "I", "text": "Wie haben Sie das dokumentiert?"}
{"ts": "161:20", "speaker": "E", "text": "In Confluence unter 'Atlas Mobile > Pilot > Accessibility' und im Runbook RB-MOB-021 als Anhang B. Außerdem im Jira-Ticket A11Y-108 verlinkt, falls ähnliche Anpassungen in der Rollout-Phase nötig werden."}
{"ts": "161:25", "speaker": "I", "text": "Alles klar, das gibt ein gutes Bild, wie Sie Performance, Security und UX balancieren."}
{"ts": "161:30", "speaker": "I", "text": "Wir waren eben bei den Anpassungen durch POL-SEC-001 – können Sie konkret schildern, wie das den Login-Flow im Pilot beeinflusst hat?"}
{"ts": "161:36", "speaker": "E", "text": "Ja, klar. Wir mussten im Aegis IAM SSO-Dialog einen zusätzlichen Schritt einfügen, um die Session-Verlängerung explizit durch den Nutzer bestätigen zu lassen. Laut POL-SEC-001 darf eine Session nicht stillschweigend verlängert werden. Das hat natürlich die UX verkompliziert, weil wir den Flow in DS-ATLAS v2 neu abbilden mussten."}
{"ts": "161:44", "speaker": "I", "text": "Und wie haben Sie das im Designsystem umgesetzt?"}
{"ts": "161:48", "speaker": "E", "text": "Wir haben ein neues Modal-Pattern in die tokenisierte Komponentenbibliothek aufgenommen, das sowohl per Tastatur als auch Screen Reader zugänglich ist. Die Änderungen wurden in der Komponentendefinition DS-ATLAS v2.3 protokolliert, Branch `feature/security-modal`, Ticket UX-482."}
{"ts": "161:56", "speaker": "I", "text": "Gab es dabei Performance-Auswirkungen?"}
{"ts": "162:00", "speaker": "E", "text": "Minimal, aber messbar. Wir mussten laut RB-MOB-021 prüfen, ob die zusätzliche Roundtrip-Zeit von Aegis IAM den SLA von 200ms überschreitet. In unseren Staging-Tests lagen wir bei 180–210ms, also knapp an der Grenze."}
{"ts": "162:08", "speaker": "I", "text": "Wie haben Sie das Risiko adressiert?"}
{"ts": "162:12", "speaker": "E", "text": "Wir haben in der Runbook-Checkliste einen Fallback definiert: Falls die Latenz >250ms liegt, wird der SSO-Dialog lokal gecacht, und nur das Token wird im Hintergrund validiert. Das ist in Ticket SEC-211 dokumentiert."}
{"ts": "162:20", "speaker": "I", "text": "Interessant. Hat das auch Helios Datalake betroffen?"}
{"ts": "162:24", "speaker": "E", "text": "Ja, indirekt. Da personalisierte Inhalte aus Helios erst nach erfolgreichem Login geladen werden, mussten wir die Lazy-Load-Strategie anpassen. Wir haben die Priorität der Sync-Jobs gesenkt, um den Login nicht zu blockieren."}
{"ts": "162:32", "speaker": "I", "text": "Gab es Bedenken wegen der Datenaktualität durch diese Verzögerung?"}
{"ts": "162:36", "speaker": "E", "text": "Ja, aber gemäß SLA-DATA-05 dürfen personalisierte Feeds bis zu 90 Sekunden veraltet sein. Das war ein akzeptabler Trade-off, um die Login-UX schnell zu halten."}
{"ts": "162:42", "speaker": "I", "text": "Wie haben Sie diese Entscheidung intern kommuniziert?"}
{"ts": "162:46", "speaker": "E", "text": "Wir haben ein internes RFC-Dokument erstellt, RFC-ATL-019, das sowohl die Security-Compliance nach POL-SEC-001 als auch die UX-Impact-Analyse enthält. Es wurde im Weekly mit Dev, QA und SecOps durchgesprochen."}
{"ts": "162:54", "speaker": "I", "text": "Gab es von SecOps Rückfragen oder Ablehnungen?"}
{"ts": "162:58", "speaker": "E", "text": "Nur ein Hinweis, dass wir im Fallback-Flow explizit einen Hinweistext zur asynchronen Validierung anzeigen müssen, um Transparenz zu gewährleisten. Das haben wir dann in der UI ergänzt, siehe Commit `b3f2d1a`."}
{"ts": "162:06", "speaker": "I", "text": "Lassen Sie uns noch etwas tiefer in die Integration zwischen Atlas Mobile und Aegis IAM eintauchen – insbesondere wie sich SSO und RBAC konkret auf Ihre UX-Entscheidungen ausgewirkt haben."}
{"ts": "162:12", "speaker": "E", "text": "Ja, gern. Wir mussten für den Pilot ein sehr schlankes SSO-Onboarding gestalten, weil Aegis IAM zwar robuste RBAC-Mechanismen hat, aber die Standard-Login-UI war aus UX-Sicht zu komplex. Wir haben deshalb einen Overlay-Flow implementiert, der direkt die Rollen aus IAM zieht und kontextbezogen nur die relevanten Bereiche freischaltet."}
{"ts": "162:24", "speaker": "I", "text": "War das eine Anpassung, die Sie mit dem IAM-Team gemeinsam spezifizieren mussten?"}
{"ts": "162:27", "speaker": "E", "text": "Absolut. Wir haben dafür RFC-AIM-044 eingereicht, wo wir die UX-Requirements gegen die IAM-Sicherheitsrichtlinien gemappt haben. Das war nötig, um auch mit POL-SEC-001 konform zu bleiben."}
{"ts": "162:38", "speaker": "I", "text": "Und wie spielen dabei die Datenströme aus dem Helios Datalake hinein?"}
{"ts": "162:41", "speaker": "E", "text": "Helios liefert uns personalisierte Content-Module, z.B. Empfehlungen basierend auf Nutzungsverhalten. Diese müssen wir aber nach RBAC filtern. Das heißt, bevor ein Modul dargestellt wird, prüfen wir über den IAM-Token, ob die Rolle des Users den Zugriff erlaubt. Das haben wir in unserem UI-Renderer eingebettet."}
{"ts": "162:55", "speaker": "I", "text": "Das klingt nach einer recht komplexen Kette – vom Datalake über die Zugriffsprüfung bis zur Darstellung."}
{"ts": "162:59", "speaker": "E", "text": "Genau, und das ist der Multi-Hop, den wir intern als 'Content Gate Pipeline' dokumentiert haben. Wir mussten dafür im DS-ATLAS v2 auch einen speziellen Placeholder-Status einführen, falls Inhalte verzögert freigegeben werden."}
{"ts": "163:10", "speaker": "I", "text": "Gab es während des Pilots Probleme mit dieser Pipeline?"}
{"ts": "163:13", "speaker": "E", "text": "Einmal, ja. Ticket UX-584 beschreibt einen Fall, wo der Placeholder hängen blieb, weil die IAM-Abfrage im Offline-Modus nicht korrekt gecacht wurde. Wir haben dann einen Fallback aus RB-MOB-018 angewendet, der vorsieht, temporär nur generische Inhalte zu zeigen."}
{"ts": "163:26", "speaker": "I", "text": "Interessant. Hat das Auswirkungen auf die Accessibility gehabt?"}
{"ts": "163:30", "speaker": "E", "text": "Minimal. Wir mussten sicherstellen, dass Screen Reader den Placeholder korrekt als 'Inhalt lädt' ansagen. Das haben wir mit ARIA-Live Regions gelöst, wie in unserem Accessibility-Testplan TP-ACC-002 dokumentiert."}
{"ts": "163:42", "speaker": "I", "text": "Und wie wirkt sich das auf die Performance aus, gerade im Zusammenspiel mit Feature Flags?"}
{"ts": "163:46", "speaker": "E", "text": "Wir haben gelernt, Feature Flags nicht nur serverseitig, sondern auch clientseitig zu cachen, um Ladezeiten zu minimieren. Das war eine direkte Lehre aus dem Incident MOB-PERF-77, wo die UI mehrere Sekunden blockierte, weil Flags und RBAC-Checks sequenziell liefen."}
{"ts": "163:58", "speaker": "I", "text": "Klingt, als ob Sie hier schon sehr viel verzahnte Optimierung betreiben mussten."}
{"ts": "164:02", "speaker": "E", "text": "Ja, und das ist auch der Grund, warum wir jetzt in der Runbook-Version RB-MOB-021a ergänzende Schritte haben, um Performance-Checks parallel zu Sicherheitsprüfungen zu fahren. Das hat die UX spürbar verbessert, ohne Abstriche bei der Compliance."}
{"ts": "164:30", "speaker": "I", "text": "Zum Abschluss würde ich gerne noch auf eine konkrete Entscheidung eingehen: Gab es im Pilot eine UX-Änderung, die direkt durch ein Runbook wie RB-MOB-021 ausgelöst wurde?"}
{"ts": "164:36", "speaker": "E", "text": "Ja, tatsächlich. RB-MOB-021 beschreibt den Notfallablauf für Sync-Konflikte. Wir mussten im UI kurzfristig einen neuen Konfliktlösungsdialog implementieren, weil das Runbook einen manuellen Benutzerentscheid vorsieht, bevor Daten überschrieben werden."}
{"ts": "164:44", "speaker": "I", "text": "Das klingt nach einem klaren Trade-off zwischen Automation und Benutzerkontrolle. Welche Risiken haben Sie dabei abgewogen?"}
{"ts": "164:50", "speaker": "E", "text": "Genau. Automatisches Mergen wäre schneller, aber RB-MOB-021 fordert die Sichtbarkeit für den User. Risiko bei zu viel Automation: data loss without user awareness. Risiko bei manueller Entscheidung: höherer kognitiver Load."}
{"ts": "164:58", "speaker": "I", "text": "Und wie haben Sie das im Design abgemildert?"}
{"ts": "165:02", "speaker": "E", "text": "Wir haben eine vereinfachte Vergleichsansicht gebaut, die nur die relevanten Änderungen zeigt und mit Farbcodierung aus DS-ATLAS v2 arbeitet. Das hat die Entscheidungszeit laut Nutzerstudie TST-UX-045 um 35 % reduziert."}
{"ts": "165:10", "speaker": "I", "text": "Gab es Performance-Beschränkungen, die Sie zum Umdenken gezwungen haben?"}
{"ts": "165:15", "speaker": "E", "text": "Ja, beim Konflikt-Dialog mussten wir die Diff-Berechnung serverseitig verlagern. Lokal hätte es auf älteren Geräten über 3 Sekunden gedauert, was gegen SLA-MOB-003 verstößt."}
{"ts": "165:22", "speaker": "I", "text": "Wie lief die Abstimmung mit dem Security-Team, gerade im Hinblick auf POL-SEC-001?"}
{"ts": "165:27", "speaker": "E", "text": "POL-SEC-001 verlangt, dass bei Konflikten keine vertraulichen Daten im Klartext angezeigt werden. Wir mussten daher sensitive Felder maskieren und den Tooltip nur nach SSO-Reauth via Aegis IAM anzeigen."}
{"ts": "165:35", "speaker": "I", "text": "Interessant – und das alles innerhalb der Pilotphase?"}
{"ts": "165:39", "speaker": "E", "text": "Ja, wir haben das über ein Feature Flag 'conflict_ui_v2' ausgerollt, erst an internen Testern mit spezieller IAM-Rolle, dann sukzessive erweitert."}
{"ts": "165:46", "speaker": "I", "text": "Welche Lessons Learned ziehen Sie aus diesem Ablauf für den Go-Live?"}
{"ts": "165:51", "speaker": "E", "text": "Frühzeitige Einbindung von Security und DevOps ist entscheidend. Und: Feature Flags nicht nur für Experimente, sondern auch für Compliance-gestützte Rollouts nutzen."}
{"ts": "165:57", "speaker": "I", "text": "Werden diese Erkenntnisse in die DS-ATLAS Guidelines übernommen?"}
{"ts": "166:01", "speaker": "E", "text": "Ja, es gibt bereits ein Draft-Dokument GD-UX-SEC-004, das genau diese Patterns beschreibt – inklusive Maskierungsregeln und Interaktionsfluss bei sicherheitsrelevanten Dialogen."}
{"ts": "166:06", "speaker": "I", "text": "Können Sie vielleicht noch einmal konkret ein Beispiel geben, wo eine Policy wie POL-SEC-001 Sie gezwungen hat, ein UX-Pattern zu ändern?"}
{"ts": "166:18", "speaker": "E", "text": "Ja, im Bereich der Session-Timeouts. POL-SEC-001 schreibt bei mobilen Endgeräten ein Inaktivitäts-Timeout von 5 Minuten vor. Unser ursprüngliches Design für das Dashboard hatte eine persistente Login-Sitzung vorgesehen, um Offline-Syncs im Hintergrund ohne erneute Authentifizierung zu erlauben."}
{"ts": "166:41", "speaker": "E", "text": "Wir mussten das UI so anpassen, dass Nutzer bei erneuter Nutzung nicht aus dem Kontext geworfen werden. Dazu haben wir einen Zwischenschritt eingefügt – eine Light-Reauth mit lokalem Token, wie in RB-MOB-021 beschrieben."}
{"ts": "167:02", "speaker": "I", "text": "Interessant, gab es dabei Performance- oder Latenzprobleme?"}
{"ts": "167:08", "speaker": "E", "text": "Ja, minimal. Die Light-Reauth nutzt den im Secure Enclave gespeicherten Key, aber wir mussten sicherstellen, dass der Helios Datalake Sync danach nahtlos fortgesetzt wird. Ein Ticket T-MOB-332 dokumentiert, dass es bei schwacher Netzverbindung zu 1–2 Sekunden Verzögerung kam."}
{"ts": "167:31", "speaker": "I", "text": "Und wie haben Sie das gelöst?"}
{"ts": "167:35", "speaker": "E", "text": "Durch Prefetching der Session-Validierung, wenn der Nutzer noch aktiv ist, kurz vor dem Timeout. Das war ein Trade-off, weil es etwas mehr Akku zieht, aber die UX, gerade bei Screen Reader Nutzern, deutlich verbessert."}
{"ts": "167:55", "speaker": "I", "text": "Sie erwähnen Screen Reader – gab es hier besondere Tests nach dieser Änderung?"}
{"ts": "168:01", "speaker": "E", "text": "Ja, wir haben mit dem Accessibility-Testplan A11Y-ATLAS-05 erneut geprüft, ob die Reauth-Maske korrekt vorgelesen wird und die Fokusreihenfolge stimmt. Auch im Offline-Modus, was tricky war, weil VoiceOver die Statusmeldungen zum Sync manchmal verschluckt hat."}
{"ts": "168:25", "speaker": "I", "text": "Haben Sie das ins Runbook aufgenommen?"}
{"ts": "168:28", "speaker": "E", "text": "Genau, RB-MOB-021 wurde um einen Abschnitt 'Accessibility Reauth Flow' ergänzt, mit den notwendigen ARIA-Labels und Hinweisen, wie Entwickler Feature Flags für diese Masken setzen."}
{"ts": "168:46", "speaker": "I", "text": "Wie wirkt sich das auf Ihre Iterationsgeschwindigkeit aus?"}
{"ts": "168:50", "speaker": "E", "text": "Positiv, weil wir jetzt ein klares Muster haben. Früher mussten wir jedes Mal neu überlegen, jetzt ist es im Runbook, und QA kann gezielt gegen diese Vorgaben testen."}
{"ts": "169:04", "speaker": "I", "text": "Gab es irgendwo Widerstand im Team gegen diese Sicherheits-UX-Anpassungen?"}
{"ts": "169:09", "speaker": "E", "text": "Es gab Diskussionen, vor allem vom Produktmanagement, weil sie befürchteten, dass häufige Reauths Nutzer frustrieren. Aber wir konnten anhand der Pilot-Analytics (Dashboard UX-METRICS-07) zeigen, dass die Abbruchquote um weniger als 1% gestiegen ist."}
{"ts": "169:29", "speaker": "I", "text": "Also ein vertretbarer Trade-off zwischen Sicherheit und Benutzerfreundlichkeit, gestützt durch Daten."}
{"ts": "167:26", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die konkrete Umsetzung der Accessibility-Richtlinien eingehen. Gab es zuletzt eine Anpassung, die direkt aus einem Audit hervorging?"}
{"ts": "167:31", "speaker": "E", "text": "Ja, im Audit vom letzten Monat hat unser interner Tester mit NVDA festgestellt, dass der Offline-Sync-Status nicht ausreichend vorgelesen wurde. Wir haben daraufhin gemäß RB-MOB-017 eine ARIA-Live-Region für den Sync-Indikator implementiert."}
{"ts": "167:39", "speaker": "I", "text": "Interessant, das heißt, der Runbook-Eintrag hat direkt zu einer Codeänderung geführt?"}
{"ts": "167:43", "speaker": "E", "text": "Genau. RB-MOB-017 enthält eine Checkliste für Screen Reader Compatibility in Offline-Modi. Wir mussten den Component Token 'status.alert' aus DS-ATLAS v2 erweitern, um die Live-Region zu unterstützen."}
{"ts": "167:52", "speaker": "I", "text": "Wie testen Sie dann, dass diese Anpassung nicht die Performance im Offline-Modus verschlechtert?"}
{"ts": "167:56", "speaker": "E", "text": "Wir nutzen das Testskript TS-MOB-OFF-004, das simulierte Netzwerkunterbrechungen einspielt. Parallel messen wir mit Lighthouse die Rendering-Zeit. Beim letzten Test lag der Impact unter 2 %, was unter unserem internen SLA-MOB-UX-05 liegt."}
{"ts": "168:06", "speaker": "I", "text": "Gab es im Zusammenhang mit Feature Flags Herausforderungen, wenn Accessibility-Verbesserungen nur bestimmten Nutzergruppen ausgerollt wurden?"}
{"ts": "168:11", "speaker": "E", "text": "Ja, wir hatten Flag 'FF-ACC-STATUS' nur für die Beta-Gruppe 'B2B-Süd' aktiv. Problem: In der Helios-Datalake-Personalisierung fehlte für einige Profile die Flag-Auswertung, sodass sie die Verbesserung nicht sahen."}
{"ts": "168:20", "speaker": "I", "text": "Wie haben Sie das gelöst?"}
{"ts": "168:22", "speaker": "E", "text": "Wir haben einen Workaround gemäß Ticket UX-4231 implementiert – ein Fallback, der die Accessibility-Komponente unabhängig vom Flag lädt, wenn 'screenReaderActive=true' in der Aegis IAM Session steht."}
{"ts": "168:32", "speaker": "I", "text": "Das klingt nach einer Abwägung zwischen sauberem Flag-Management und inklusiver UX."}
{"ts": "168:36", "speaker": "E", "text": "Absolut. Wir haben bewusst den Trade-off in Kauf genommen, weil die Barrierefreiheit hier Vorrang hatte. In der nächsten Iteration wollen wir die Flag-Auswertung in Helios selbst korrigieren."}
{"ts": "168:44", "speaker": "I", "text": "War diese Entscheidung in Konflikt mit Sicherheits-Policies wie POL-SEC-001?"}
{"ts": "168:48", "speaker": "E", "text": "Nein, da wir keine zusätzlichen sensiblen Daten exponiert haben. Wir haben das mit SecOps gegen die Checkliste 'POL-SEC-001-UX' abgeglichen und Freigabe erhalten."}
{"ts": "168:55", "speaker": "I", "text": "Gibt es für solche Fälle mittlerweile eine Art Lessons-Learned-Dokument?"}
{"ts": "168:59", "speaker": "E", "text": "Ja, wir pflegen das in Confluence unter 'Atlas Mobile UX Decisions'. Dort sind Runbooks, Tickets und die Abwägungen dokumentiert, damit wir bei ähnlichen Konflikten schneller reagieren können."}
{"ts": "169:46", "speaker": "I", "text": "Mich würde interessieren, wie Sie konkret die Integration mit Helios Datalake im UX-Kontext umgesetzt haben, gerade im Zusammenspiel mit personalisierten Offline-Inhalten."}
{"ts": "169:52", "speaker": "E", "text": "Also, wir haben dafür im Pilot explizit einen Sync-Adapter geschrieben, der die relevanten Personalisierungsdaten aus Helios per geleitetem RPC zieht. Der Adapter nutzt unser DS-ATLAS v2 Layout, damit die Inhalte auch offline konsistent sind. Wir haben das mit Ticket UX-HEL-044 dokumentiert."}
{"ts": "169:59", "speaker": "I", "text": "Wie stellen Sie sicher, dass diese Inhalte auch nach einem längeren Offline-Zeitraum noch aktuell und barrierefrei nutzbar sind?"}
{"ts": "170:06", "speaker": "E", "text": "Wir haben im Runbook RB-MOB-018 eine Regel, dass Inhalte nach 72 Stunden ohne Sync als 'stale' markiert werden. Das UI zeigt dann eine Warnung mit Screen Reader-Label 'veraltete Daten'. Die Prüfung haben wir mit unserer Accessibility-Test-Suite verknüpft."}
{"ts": "170:13", "speaker": "I", "text": "Gab es besondere Hürden bei der Kombination dieser Warnhinweise mit den Feature Flags?"}
{"ts": "170:19", "speaker": "E", "text": "Ja, tatsächlich. Das Flag 'offline_warning_experimental' war bei einer Teilgruppe aktiv. In Verbindung mit POL-SEC-001 mussten wir sicherstellen, dass keine sensiblen Metadaten im Warnhinweis landen. Das hat zwei Iterationen in unserem Sprintplan gekostet."}
{"ts": "170:27", "speaker": "I", "text": "Verstehe. Wenn wir auf Aegis IAM schauen – wie beeinflusst das SSO dort Ihre UX-Muster bei Atlas Mobile?"}
{"ts": "170:34", "speaker": "E", "text": "Beim Single Sign-On nehmen wir die Login-Flows aus Aegis fast unverändert, binden aber eine mobile-optimierte MFA-Auswahl ein. Das hat mit RB-MOB-021 zu tun, der beschreibt, wie MFA-Dialoge in nativen Apps zu gestalten sind, um Barrierefreiheit zu wahren."}
{"ts": "170:42", "speaker": "I", "text": "Und gibt es bei MFA einen Trade-off zwischen Sicherheit und Geschwindigkeit der Anmeldung?"}
{"ts": "170:48", "speaker": "E", "text": "Ja, und wir haben uns nach einer Risikoanalyse (SEC-RISK-009) entschieden, für Pilotnutzer eine 'Trusted Device'-Option zuzulassen. Das verringert die MFA-Häufigkeit, aber wir protokollieren jeden Login im Audit-Log, um die Compliance-Anforderungen zu erfüllen."}
{"ts": "170:56", "speaker": "I", "text": "Gab es Performance-Beschränkungen, die Ihre UX-Designs beeinflusst haben?"}
{"ts": "171:02", "speaker": "E", "text": "Ja, die initiale Kartenkomponente mit Live-Daten aus Helios war zu langsam. Wir haben sie durch eine statische Version ersetzt, die nur bei aktivem Feature Flag 'live_map_beta' aktualisiert. Das wurde in RFC-ATL-023 beschlossen."}
{"ts": "171:09", "speaker": "I", "text": "Wie dokumentieren Sie solche Änderungen für spätere Phasen?"}
{"ts": "171:14", "speaker": "E", "text": "Wir pflegen ein Änderungslog im Confluence-Bereich 'Atlas UX Decisions'. Jede Entscheidung enthält Verweis auf das Runbook, relevante Tickets und die betroffenen Komponenten aus DS-ATLAS v2."}
{"ts": "171:21", "speaker": "I", "text": "Wenn Sie auf den bisherigen Pilot zurückblicken, welche UX-Entscheidung hatte den größten Einfluss auf die Nutzerbindung?"}
{"ts": "171:27", "speaker": "E", "text": "Definitiv die Entscheidung, Offline-Sync priorisiert zu optimieren. SLA-UX-005 verlangt, dass 95% der Kernfunktionen offline laufen. Diese Einhaltung hat uns laut den Nutzungsanalysen die größte Bindung gebracht, trotz der höheren Entwicklungsaufwände."}
{"ts": "171:46", "speaker": "I", "text": "Zum Abschluss würde ich gern noch einmal auf die Entscheidungen eingehen, die Sie im Rahmen der Pilotphase unter Zeitdruck treffen mussten. Gab es ein Beispiel, wo Sie eine Funktion wegen Performance-Bedenken zurückgestellt haben?"}
{"ts": "171:51", "speaker": "E", "text": "Ja, das prominenteste Beispiel war unser geplantes dynamisches Karten-Overlay. Wir mussten es vorerst deaktivieren, weil die Renderzeiten bei Geräten mit weniger als 4 GB RAM deutlich über der im SLA-MOB-02 definierten Maximal-Ladezeit lagen."}
{"ts": "171:59", "speaker": "I", "text": "Und wie haben Sie diese Entscheidung intern kommuniziert? War das über ein RFC oder ein Ticket?"}
{"ts": "172:03", "speaker": "E", "text": "Wir haben ein RFC-Dokument erstellt, RFC-MOB-144, und es im Confluence-Bereich 'Atlas Mobile Pilot' hinterlegt. Zusätzlich gab es ein Jira-Ticket UX-4123 mit den Benchmarks aus unserem Lasttest-Skript lt. Runbook RB-MOB-015."}
{"ts": "172:12", "speaker": "I", "text": "Gab es Bedenken seitens des Product Owners, dass dadurch ein zentrales Verkaufsargument wegfällt?"}
{"ts": "172:16", "speaker": "E", "text": "Natürlich. Wir haben aber argumentiert, dass ein ruckelndes Karten-Overlay den ersten Eindruck massiv schädigt und die Abbruchrate erhöht, was schon in unserer Heuristik-Liste 'UX-No-Gos' als kritischer Faktor markiert ist."}
{"ts": "172:24", "speaker": "I", "text": "Wie sind Sie mit den Zielkonflikten zwischen Sicherheit und Benutzerfreundlichkeit umgegangen, etwa bei der Integration von Aegis IAM?"}
{"ts": "172:29", "speaker": "E", "text": "Wir haben in POL-SEC-001 geforderte 2FA als Default beibehalten, aber im UX-Team einen \"fast lane\"-Dialog entworfen, der bei vertrauenswürdigen Geräten den Code-Versand auf eine Geste reduziert. Das war ein Kompromiss, der in Ticket SECUX-208 dokumentiert ist."}
{"ts": "172:39", "speaker": "I", "text": "Gab es technische Abhängigkeiten, die diese Lösung beeinflusst haben?"}
{"ts": "172:43", "speaker": "E", "text": "Ja, die Geräte-Whitelist wird aus Helios Datalake gespeist. Wir mussten sicherstellen, dass der Offline-Sync nicht veraltete Whitelist-Daten nutzt. Das haben wir mit einem Fallback nach Runbook RB-MOB-021 gelöst, der bei fehlender Verbindung nur 24 Stunden alte Daten akzeptiert."}
{"ts": "172:54", "speaker": "I", "text": "Das klingt nach einem heiklen Balanceakt. Wie haben Sie das getestet?"}
{"ts": "172:58", "speaker": "E", "text": "Wir haben sowohl manuelle Tests mit simulierten Netzwerkunterbrechungen nach Testplan TP-OFF-07 durchgeführt, als auch automatisierte Espresso-Tests, die den Whitelist-Status manipulieren. Wichtig war die Protokollierung im Audit-Log, wie in SEC-AUD-009 vorgeschrieben."}
{"ts": "173:09", "speaker": "I", "text": "Gab es bei diesen Tests Überraschungen?"}
{"ts": "173:12", "speaker": "E", "text": "Ja, in einem Fall hat der Screen Reader während des Fallback-Dialogs nicht alle Elemente vorgelesen, weil der ARIA-Label-Text aus einer asynchron geladenen Ressource kam. Das mussten wir nachbessern, um WCAG 2.1 AA einzuhalten."}
{"ts": "173:21", "speaker": "I", "text": "Das zeigt, wie eng Technik und UX verzahnt sind. Haben Sie zum Abschluss vielleicht noch ein Learning, das Sie ins nächste Projekt mitnehmen?"}
{"ts": "173:25", "speaker": "E", "text": "Definitiv: Feature Flags sind nicht nur ein Tool für Entwickler, sondern ein strategisches Instrument für UX-Experimente. Wenn man sie mit klaren Metriken und Runbooks wie RB-MOB-018 koppelt, kann man datenbasiert und schnell auf Nutzerfeedback reagieren."}
{"ts": "174:26", "speaker": "I", "text": "Bevor wir zu den abschließenden Entscheidungen kommen, könnten Sie bitte noch erläutern, wie Sie die letzten Erkenntnisse aus den Pilot-Usability-Tests in Ihre Roadmap übernommen haben?"}
{"ts": "174:34", "speaker": "E", "text": "Ja, klar. Wir haben nach den letzten Test-Sessions drei Tickets im Jira-Board angelegt, z.B. MOB-UX-842, in denen wir konkrete Anpassungen wie vergrößerte Touch-Zonen und bessere Offline-Statusmeldungen priorisiert haben. Diese sind bereits in Sprint 14 eingeplant."}
{"ts": "174:48", "speaker": "I", "text": "Gab es dabei Abhängigkeiten zu anderen Teams, etwa dem Aegis IAM- oder Helios-Datalake-Team?"}
{"ts": "174:54", "speaker": "E", "text": "Ja, z.B. bei MOB-UX-845 mussten wir die Lade-Indikatoren für personalisierte Inhalte anpassen, weil der Helios-Datalake-Query-Layer nach einem Schema-Update kurzzeitig längere Antwortzeiten hatte. Da haben wir in enger Abstimmung mit deren API-Team eine Zwischenlösung mit lokalem Cache entworfen."}
{"ts": "175:12", "speaker": "I", "text": "Das klingt nach einem klassischen Fall von Multi-System-Abhängigkeit. Haben Sie dafür eine Art Standardverfahren?"}
{"ts": "175:19", "speaker": "E", "text": "Genau, wir orientieren uns da an RB-MOB-019, das explizit das Vorgehen bei Performance-Einbußen durch externe Systeme regelt. Unter anderem wird dort festgelegt, wie Fallback-UI-Elemente aussehen sollen, um die UX konsistent zu halten."}
{"ts": "175:36", "speaker": "I", "text": "Und wie messen Sie, ob diese Fallbacks tatsächlich den gewünschten Effekt haben?"}
{"ts": "175:41", "speaker": "E", "text": "Wir nutzen sowohl In-App-Event-Tracking als auch gezielte Follow-up-Interviews. Ein KPI ist z.B. die Abbruchrate bei Content-Ladebildschirmen. Seit Einführung des Fallbacks ist diese von 14 % auf 5 % gesunken."}
{"ts": "175:56", "speaker": "I", "text": "Gab es in dieser Phase besondere Sicherheitsaspekte, die Sie berücksichtigen mussten?"}
{"ts": "176:01", "speaker": "E", "text": "Ja, ein Punkt war, dass wir laut POL-SEC-001 keine sensiblen Nutzerattribute im lokalen Cache speichern dürfen. Das bedeutete, dass wir für manche Personalisierungen nur Platzhalter anzeigen konnten, bis die Online-Verbindung wieder steht."}
{"ts": "176:17", "speaker": "I", "text": "Das ist sicher ein Trade-off. Wie haben Sie das kommuniziert, um die Nutzer nicht zu verwirren?"}
{"ts": "176:24", "speaker": "E", "text": "Wir haben ein neutrales Placeholder-Design entwickelt, das klar signalisiert, dass Inhalte geladen werden, ohne falsche Erwartungen zu wecken. Das basiert auf den Guidelines aus DS-ATLAS v2 und wurde in einem A/B-Test validiert."}
{"ts": "176:39", "speaker": "I", "text": "Sie hatten vorhin RB-MOB-021 erwähnt. Gab es in diesem Pilotdurchlauf eine Situation, wo Sie dieses Runbook direkt anwenden mussten?"}
{"ts": "176:46", "speaker": "E", "text": "Ja, beim Ausrollen des neuen Offline-Sync-Moduls gab es einen Bug, der zu doppelten Datensätzen führte. RB-MOB-021 beschreibt den Ablauf zur sofortigen Deaktivierung über Feature Flag, inklusive der Rückmeldung an QA und Dokumentation im Incident-Log. Das haben wir Schritt für Schritt umgesetzt."}
{"ts": "177:04", "speaker": "I", "text": "Und konnten Sie das Problem schnell beheben?"}
{"ts": "177:09", "speaker": "E", "text": "Ja, innerhalb von vier Stunden hatten wir einen Hotfix (Build 2.5.3-P) im Testkanal, und dank der Feature-Flag-Architektur konnten wir das fehlerhafte Modul für alle Pilotnutzer deaktivieren, ohne ein komplettes Rollback zu fahren."}
{"ts": "181:46", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die Multisystem-Integration zurückkommen – konkret, wie wirkt sich das Zusammenspiel von Atlas Mobile mit Helios und Aegis aktuell im Pilot auf die User Journey aus?"}
{"ts": "182:02", "speaker": "E", "text": "Im Moment sehen wir, dass die Kombination aus Aegis SSO und Helios-Datenfeeds die Einstiegshürde senkt, weil Nutzer nur einmal authentifizieren müssen. Gleichzeitig müssen wir im UX-Flow Platz schaffen für Consent-Bildschirme, die aus den Helios-Datenquellen getriggert werden."}
{"ts": "182:24", "speaker": "I", "text": "Gab es dafür schon eine Anpassung im Designsystem DS-ATLAS v2?"}
{"ts": "182:30", "speaker": "E", "text": "Ja, wir haben ein zusätzliches Consent-Modal als tokenisierte Komponente aufgenommen. Das ist über Feature Flag FF-CONSENT-HEL gesteuert, sodass wir es nur bei Gruppen mit aktiven Helios-Personalisierungen anzeigen."}
{"ts": "182:52", "speaker": "I", "text": "Wie testen Sie die Offline-Funktion in diesem Kontext, also wenn Consent-Informationen erforderlich sind?"}
{"ts": "183:00", "speaker": "E", "text": "Wir simulieren im Lab sowohl reale Netzabbrüche als auch den Fall, dass Consent-Daten noch nicht synchronisiert wurden. Laut Runbook RB-MOB-034 müssen Offline-Consent-Events in einer Queue persistiert werden, die beim nächsten Sync mit Helios abgeglichen wird."}
{"ts": "183:26", "speaker": "I", "text": "Und welche Rolle spielen dabei die Accessibility-Richtlinien?"}
{"ts": "183:31", "speaker": "E", "text": "Die Modals sind vollständig Screen-Reader-kompatibel nach WCAG 2.1 AA. Wir haben in Ticket UX-ACC-221 die Regel ergänzt, dass der Fokus nach Offline-Queue-Sendungen nicht verloren gehen darf, um die Bedienbarkeit für Tastaturnutzer zu sichern."}
{"ts": "183:56", "speaker": "I", "text": "Gab es Zielkonflikte zwischen Sicherheit und Nutzerfreundlichkeit in diesem Szenario?"}
{"ts": "184:02", "speaker": "E", "text": "Ja, POL-SEC-001 verlangt, dass Consent-Daten verschlüsselt in der Queue liegen. Das verlängert den Sync-Prozess offline etwas. Wir haben abgewogen und mittels Performance-Optimierung aus RB-MOB-021 die Verschlüsselung asynchron gestaltet, um die UI nicht zu blockieren."}
{"ts": "184:28", "speaker": "I", "text": "Welche evidenzbasierten Entscheidungen haben Sie dazu dokumentiert?"}
{"ts": "184:34", "speaker": "E", "text": "In unserem Pilot-Review-Dokument PR-ATL-05 haben wir die Messwerte vor und nach der Änderung erfasst: UI-Block-Zeit sank von 1,2 Sekunden auf unter 300 ms, ohne dass die Verschlüsselungsstärke reduziert wurde."}
{"ts": "184:54", "speaker": "I", "text": "Klingt wie ein guter Kompromiss. Planen Sie, das Feature Flag für Consent-Modal bald breiter auszurollen?"}
{"ts": "185:01", "speaker": "E", "text": "Wir evaluieren gerade auf Basis der Usage-Analytics aus Helios. Wird die Akzeptanzquote über 85 % in zwei aufeinanderfolgenden Wochen erreicht, geht es laut Deployment-Plan DP-ATL-07 in den Rollout."}
{"ts": "185:20", "speaker": "I", "text": "Wie stellen Sie sicher, dass bei einem Failover im SSO keine UX-Brüche entstehen?"}
{"ts": "185:27", "speaker": "E", "text": "Wir haben in RB-MOB-045 definiert, dass beim Wechsel auf den Backup-Aegis-Knoten der Session-Token nahtlos übernommen wird. Dazu läuft ein Fallback-Flow, der visuell identisch ist, um kognitive Unterbrechungen zu vermeiden."}
{"ts": "189:26", "speaker": "I", "text": "Zum Abschluss des Blocks zu Multi-System-Integration: Gab es in den letzten Wochen ein spezielles Incident-Ticket, das Ihnen gezeigt hat, wo noch UX-Optimierungspotenzial besteht?"}
{"ts": "189:34", "speaker": "E", "text": "Ja, das war INC-MOB-4482. Da hatten wir einen Edge Case, bei dem der SSO-Token von Aegis IAM kurz vor Ablauf während eines Offline-Syncs invalid wurde. Das führte zu einem unerwarteten Re-Login Screen mitten im Arbeitsfluss."}
{"ts": "189:46", "speaker": "I", "text": "Wie haben Sie das im Pilot adressiert?"}
{"ts": "189:50", "speaker": "E", "text": "Wir haben im UX-Flow einen Grace Period-Hinweis eingeführt. Der wird über Feature Flag FF-UX-REAUTH nur für die Testgruppe 3 aktiviert. Parallel läuft ein Monitoring-Job nach RB-MOB-033, der prüft, ob Re-Auth Ereignisse gehäuft auftreten."}
{"ts": "190:04", "speaker": "I", "text": "Und was sagen die ersten Nutzerrückmeldungen?"}
{"ts": "190:08", "speaker": "E", "text": "Die Testgruppe meldet weniger Frustration, weil sie vorgewarnt ist. Wir müssen aber noch verifizieren, ob dadurch nicht Sicherheits-SLAs aus POL-SEC-001 tangiert werden."}
{"ts": "190:18", "speaker": "I", "text": "Gab es Performance-Effekte durch diese Änderung?"}
{"ts": "190:22", "speaker": "E", "text": "Minimal. Der Pre-Check-Call zum IAM-Endpoint kostet etwa 50-80ms, laut unseren Logs aus ENV-PILOT-05. Innerhalb des zulässigen Budgets nach SLA-MOB-02."}
{"ts": "190:33", "speaker": "I", "text": "Okay, und um noch auf RB-MOB-021 zurückzukommen: Haben Sie diese Richtlinie hier angewendet?"}
{"ts": "190:38", "speaker": "E", "text": "Ja, der Runbook-Abschnitt zu 'User Session Handling Offline' war maßgeblich. Wir mussten die dort empfohlene Session-Persistenz leicht anpassen, um den Grace Period Banner einzubauen."}
{"ts": "190:50", "speaker": "I", "text": "Wie dokumentieren Sie solche Abweichungen?"}
{"ts": "190:54", "speaker": "E", "text": "Über eine 'Deviation Note' im Confluence-Bereich PROJ-ATL-RB, mit Verweis auf das Ticket und einem Link ins Git-Repo, Branch 'feature/reauth-banner'."}
{"ts": "191:05", "speaker": "I", "text": "Planen Sie, das Feature breiter auszurollen?"}
{"ts": "191:09", "speaker": "E", "text": "Nur wenn Security zustimmt und Loadtests in STAGE grün sind. Wir haben dafür schon TST-MOB-988 vorbereitet, der simuliert, was passiert, wenn 500 Re-Auths parallel laufen."}
{"ts": "191:21", "speaker": "I", "text": "Klingt nach einem klaren Plan. Letzte Frage: Gibt es Lessons Learned, die Sie in die nächste Iteration von Atlas Mobile mitnehmen?"}
{"ts": "191:26", "speaker": "E", "text": "Definitiv: Immer die Wechselwirkung zwischen Offline-Funktionen, Security Policies und UX im Blick behalten und frühzeitig mit Feature Flags kleine Gruppen testen, bevor wir globale Änderungen ausrollen."}
{"ts": "196:46", "speaker": "I", "text": "Lassen Sie uns noch einmal konkret auf den letzten Testlauf eingehen – wie haben Sie den Offline-Sync unter den Bedingungen simuliert, die auch die SSO-Integration von Aegis IAM tangieren?"}
{"ts": "197:02", "speaker": "E", "text": "Wir haben im Testlab ein Szenario aufgebaut, bei dem das Gerät nach erfolgreichem Login über Aegis IAM in den Flugmodus versetzt wurde. Danach haben wir mit den in RB-MOB-021 beschriebenen Sync-Triggern gearbeitet, zum Beispiel dem 'delayed push after network restore'. So konnten wir sehen, wie sich die Session-Tokens verhalten und ob der RBAC-Context erhalten bleibt."}
{"ts": "197:28", "speaker": "I", "text": "Gab es dabei Abweichungen von den Erwartungen aus dem Runbook?"}
{"ts": "197:35", "speaker": "E", "text": "Minimal – ein Ticket T-MOB-441 wurde erfasst, weil bei einem Nutzer mit Rollenwechsel während der Offline-Phase die UI veraltete Daten aus Helios Datalake angezeigt hat. Das war ein klassischer Multi-System-Latenzfall."}
{"ts": "197:54", "speaker": "I", "text": "Interessant. Und wie haben Sie das mit Feature Flags abgefangen?"}
{"ts": "198:00", "speaker": "E", "text": "Wir haben den 'personalized-content' Flag so angepasst, dass er bei unbestätigter Token-Erneuerung automatisch deaktiviert wird. Das reduziert zwar den Personalisierungsgrad, entspricht aber den in POL-SEC-001 geforderten Sicherheitsmaßnahmen."}
{"ts": "198:18", "speaker": "I", "text": "War das nicht ein spürbarer Einschnitt für die User Experience?"}
{"ts": "198:24", "speaker": "E", "text": "Ja, kurzfristig schon. Aber wir haben in der Pilotkommunikation transparent gemacht, warum dieser Fallback existiert. Zudem ist der Flag nur in ca. 3 % der Sessions gefallen – laut unseren Auswertungen aus dem Helios-Dashboard."}
