{"ts": "00:00", "speaker": "I", "text": "Können Sie bitte Ihren Verantwortungsbereich im Rahmen von Vesta FinOps skizzieren?"}
{"ts": "02:10", "speaker": "E", "text": "Gerne. Ich bin als FinOps Analyst:in primär dafür zuständig, die Cloud-Kosten über alle Vesta-Workloads hinweg zu überwachen, Budgeteinhaltung gemäß unserer Policy POL-FIN-007 sicherzustellen und Optimierungspotenziale zu identifizieren. Dazu gehört auch die Koordination zwischen den Entwicklungsteams und unserem Cloud Governance Board."}
{"ts": "06:05", "speaker": "I", "text": "Wie passen Ihre täglichen Aufgaben zu den Unternehmenswerten wie 'Safety First' oder 'Evidence over Hype'?"}
{"ts": "08:45", "speaker": "E", "text": "Safety First bedeutet für uns, dass Kostenoptimierungen niemals unsere Betriebsstabilität gefährden dürfen. Evidence over Hype setze ich um, indem ich nur Maßnahmen mit belastbaren Daten aus unseren Monitoring- und Abrechnungsquellen vorschlage. Zum Beispiel stütze ich mich bei Einsparvorschlägen immer auf Verified Usage Reports aus dem Helios Datalake."}
{"ts": "12:30", "speaker": "I", "text": "Welche KPIs verfolgen Sie aktuell für das Projekt?"}
{"ts": "14:50", "speaker": "E", "text": "Die wichtigsten sind aktuell: Cost per Active User, monatliche Cloud Spend Variance zum Budget und die Quote von ungenutzten Ressourcen. Letztere sollte unter 3% bleiben."}
{"ts": "18:15", "speaker": "I", "text": "Wie setzen Sie die Cloud Cost Budgets & Quotas Policy (POL-FIN-007) in der Praxis um?"}
{"ts": "21:05", "speaker": "E", "text": "Wir haben pro Produktbereich Quoten definiert und diese in unser internes Cloud Dashboard \"Asterix\" integriert. Alerts werden bei 80% und 95% Auslastung ausgelöst, basierend auf täglichen Datenfeeds aus Quasar Billing."}
{"ts": "25:40", "speaker": "I", "text": "Wie gehen Sie mit Abweichungen vom Budget um?"}
{"ts": "28:10", "speaker": "E", "text": "Zunächst analysiere ich in einem 24h-Drill-Down, ob die Abweichung durch Lastspitzen oder Fehlkonfigurationen entsteht. Falls nötig, eröffne ich ein Ticket im FinOps-Queue (z.B. FIN-4821) und führe mit dem betroffenen Team einen Budget Review Call durch."}
{"ts": "33:30", "speaker": "I", "text": "Wie erstellen Sie Ihre monatlichen Forecasts für Cloud-Kosten?"}
{"ts": "37:20", "speaker": "E", "text": "Ich kombiniere historische Ausgaben aus Quasar Billing mit Projektplänen aus Jira. Mittels eines Python-Skripts, das wir intern gepflegt haben, werden diese Daten mit Auslastungsmetriken aus Helios Datalake korreliert. Das erlaubt uns, neue Releases und deren erwartete Last direkt im Forecast zu berücksichtigen."}
{"ts": "42:15", "speaker": "I", "text": "Gibt es Abhängigkeiten zu Projekten wie Helios Datalake oder Quasar Billing?"}
{"ts": "46:00", "speaker": "E", "text": "Ja, absolut. Ohne Helios hätten wir keine präzisen Nutzungsdaten; ohne Quasar Billing keine verlässlichen Kosten. Ein gutes Beispiel war im April: Wir haben eine Anomalie im Helios-Feed entdeckt, die zu falschen Kostenprognosen geführt hätte. Nach einer Abstimmung mit dem Quasar-Team haben wir den Datentransfer via RFC-1438 korrigiert."}
{"ts": "51:25", "speaker": "I", "text": "Können Sie ein Beispiel für eine erfolgreiche Optimierungsinitiative nennen?"}
{"ts": "54:00", "speaker": "E", "text": "Letzten Sommer haben wir die Instanztypen für Batch-Jobs im Vesta Analytics Modul auf Spot-ähnliche Reservierungen umgestellt. Das war in Runbook RB-FIN-022 dokumentiert. Ergebnis: 18% geringere Kosten bei gleichbleibender SLA-Performance."}
{"ts": "90:00", "speaker": "I", "text": "Kommen wir nun zu den Optimierungsinitiativen. Können Sie bitte ein Beispiel für eine erfolgreiche Maßnahme nennen, die Sie im Rahmen von Vesta FinOps umgesetzt haben?"}
{"ts": "90:15", "speaker": "E", "text": "Ja, gerne. Im Februar haben wir eine Initiative zur automatisierten Instanzabschaltung außerhalb der Geschäftszeiten im Dev-Cluster umgesetzt. Laut unserem Runbook RNB-FIN-032 haben wir dabei Lambda-basierte Scheduler eingesetzt. Innerhalb des ersten Monats konnten wir rund 18 % der Compute-Kosten in diesem Segment einsparen."}
{"ts": "90:38", "speaker": "I", "text": "Und wie messen Sie den ROI solcher Optimierungsmaßnahmen? Nutzen Sie dafür ein standardisiertes Verfahren?"}
{"ts": "90:50", "speaker": "E", "text": "Wir verwenden intern das ROI-Template aus dem FinOps Toolkit. Dort vergleichen wir die Implementierungskosten – also Engineering-Zeit, eventuelle Tool-Lizenzen – mit den erwarteten und tatsächlichen Einsparungen. Für die Dev-Cluster-Abschaltung hatten wir Implementierungskosten von etwa 40 Stunden, Break-Even nach 3,2 Wochen."}
{"ts": "91:15", "speaker": "I", "text": "Wie dokumentieren Sie diese Maßnahmen, damit sie wiederholbar sind?"}
{"ts": "91:26", "speaker": "E", "text": "Neben dem erwähnten Runbook pflegen wir auch einen Eintrag im RFC-Register. Für das Beispiel war das RFC-1498. Dort sind die Architekturänderungen, das Rollout-Playbook und die Validierungsmetriken hinterlegt. So kann das Cloud Operations Team bei Bedarf dieselbe Maßnahme in anderen Umgebungen replizieren."}
{"ts": "91:50", "speaker": "I", "text": "Gab es auch Optimierungsprojekte, die nicht den erwarteten Erfolg gebracht haben?"}
{"ts": "92:02", "speaker": "E", "text": "Ja, leider. Wir hatten im letzten Quartal versucht, Storage-Klassen bei unserem Object Store zu ändern, wie in RFC-1501 beschrieben. Die Simulationen aus Helios Datalake-Daten sahen gut aus, aber Quasar Billing hat uns auf höhere Abrufkosten hingewiesen. Netto war die Einsparung nur 1 %, damit unter unserer internen Schwelle von 5 %."}
{"ts": "92:27", "speaker": "I", "text": "Das bringt uns zu den Risiken. Welche Gefahren sehen Sie bei sehr aggressiven Kostensenkungen?"}
{"ts": "92:39", "speaker": "E", "text": "Das größte Risiko ist, dass wir Performance-SLAs verletzen. POL-SLA-004 definiert für kritische Services eine Antwortzeit von 200 ms P95. Senken wir Kosten durch kleinere Instanztypen zu stark, steigt die Latenz und wir riskieren Vertragsstrafen. Außerdem kann die Developer Experience leiden, was langfristig Innovation hemmt."}
{"ts": "93:05", "speaker": "I", "text": "Wie balancieren Sie zwischen Kosteneffizienz und der Einhaltung dieser Performance-SLAs?"}
{"ts": "93:17", "speaker": "E", "text": "Wir legen in unseren Optimierungs-RFCs immer eine SLA-Impact-Analyse bei. Außerdem definieren wir in den Rollouts Feature Flags, um Änderungen schnell zurückzunehmen. In kritischen Fällen, wie bei RFC-1502, haben wir erst in einer Staging-Umgebung mit SLA-Monitoring getestet, bevor wir in Produktion gegangen sind."}
{"ts": "93:42", "speaker": "I", "text": "Können Sie die Entscheidung zu RFC-1502 kurz beschreiben und wie Sie zu Ihrem Urteil kamen?"}
{"ts": "93:55", "speaker": "E", "text": "Klar. RFC-1502 betraf die Reduzierung der Replikationsfaktoren in unserem Analytics-Cluster. Wir haben Helios Datalake-Daten zu Zugriffsmustern ausgewertet, Quasar Billing für Kostenprojektionen genutzt und über das interne FinOps Board einen Risikoworkshop durchgeführt. Die Entscheidung fiel positiv aus, weil die Risikoanalyse keine SLA-Gefahr zeigte und die Einsparung bei 12 % lag."}
{"ts": "94:25", "speaker": "I", "text": "Gab es für diese Entscheidung formale Genehmigungen oder war das ein rein operativer Beschluss?"}
{"ts": "94:38", "speaker": "E", "text": "Es gab eine formale Freigabe durch das Change Advisory Board. Das Protokoll dazu ist im Ticket CAB-2023-118 hinterlegt. Ohne CAB-Freigabe setzen wir in Vesta FinOps keine Änderungen um, die potenziell SLA-relevant sind."}
{"ts": "102:00", "speaker": "I", "text": "Kommen wir nun zu den Optimierungsinitiativen. Können Sie ein konkretes Beispiel nennen, das im Rahmen von Vesta FinOps erfolgreich umgesetzt wurde?"}
{"ts": "102:15", "speaker": "E", "text": "Ja, eines der markantesten Beispiele war die Einführung einer automatisierten Instanz-Rightsizing-Logik im Compute-Bereich. Wir haben das im Runbook RB-OPS-221 dokumentiert. Ziel war es, überdimensionierte VM-Instanzen zu identifizieren und innerhalb der genehmigten Change-Fenster herunterzuskalen."}
{"ts": "102:48", "speaker": "I", "text": "Und wie haben Sie den Erfolg dieser Maßnahme bewertet?"}
{"ts": "103:00", "speaker": "E", "text": "Wir haben vorab eine Baseline über 90 Tage erstellt. Nach der Umstellung haben wir die monatlichen Kosten dieser Workloads verglichen. Der ROI wurde in RFC-1489 festgehalten: Invest von ca. 25 Personentagen, break-even nach 2,5 Monaten, jährliche Einsparung etwa 14%. KPIs wie \"Cost per Compute Hour\" und \"Idle VM Ratio\" sind seither dauerhaft gesunken."}
{"ts": "103:38", "speaker": "I", "text": "Gab es dabei Wechselwirkungen zu den Systemen aus Helios Datalake oder Quasar Billing?"}
{"ts": "103:50", "speaker": "E", "text": "Ja, wir mussten sicherstellen, dass die geänderten Instanzgrößen auch korrekt in Quasar Billing reflektiert werden, um keine Verrechnungsfehler zu erzeugen. Außerdem haben wir aus Helios Datalake historische Lastprofile gezogen, um das Rightsizing nicht zu aggressiv anzusetzen – so vermeiden wir Performance-Einbrüche."}
{"ts": "104:20", "speaker": "I", "text": "Wie dokumentieren Sie solche Optimierungen fortlaufend?"}
{"ts": "104:32", "speaker": "E", "text": "Neben den Runbooks pflegen wir für jede größere Optimierung einen Abschnitt in unserem FinOps-Wiki. Dort verlinken wir auf das zugehörige RFC, z.B. RFC-1489, alle Monitoring-Dashboards und Lessons Learned. Das erleichtert Onboarding und vermeidet Doppelarbeit."}
{"ts": "105:00", "speaker": "I", "text": "Gab es auch Initiativen, die weniger erfolgreich waren?"}
{"ts": "105:12", "speaker": "E", "text": "Ja, wir hatten einen Versuch mit Spot-Instanzen für Batch-Jobs. Im Lab lief das gut, aber in Produktion gab es Ausfälle, weil die Vorwarnzeit für Terminierung zu kurz war. Das ist als Negativbeispiel in Runbook RB-OPS-227 dokumentiert, mit klarer Empfehlung für Fallback-Strategien."}
{"ts": "105:45", "speaker": "I", "text": "Lassen Sie uns zu Risiken und Trade-offs kommen. Welche Risiken sehen Sie bei aggressiven Kostensenkungen?"}
{"ts": "105:57", "speaker": "E", "text": "Das größte Risiko ist die Verletzung von Performance-SLAs. Beispiel: Bei zu starkem Rightsizing kann die Latenz steigen. Auch Compliance-Risiken sind relevant, wenn man etwa redundante Systeme entfernt, die für Audit-Trails nötig sind."}
{"ts": "106:20", "speaker": "I", "text": "Wie balancieren Sie zwischen Kosteneffizienz und Performance-SLAs?"}
{"ts": "106:32", "speaker": "E", "text": "Wir nutzen ein Ampelsystem, das im Runbook RB-SLA-102 definiert ist. Kostensenkungen werden nur freigegeben, wenn Messwerte wie 95th Percentile Response Time im grünen Bereich bleiben. Bei Gelb gibt es eine Pilotphase, bei Rot wird die Maßnahme gestoppt."}
{"ts": "107:00", "speaker": "I", "text": "Können Sie zum Abschluss eine Entscheidung beschreiben, die auf Basis von RFC-1502 getroffen wurde?"}
{"ts": "107:12", "speaker": "E", "text": "RFC-1502 behandelte die Einführung eines zentralen Tagging-Enforcers. Entscheidung war, diesen trotz zusätzlichen monatlichen Kosten zu implementieren, weil damit die Datenqualität für Forecasts und Budgetzuordnung um 18% stieg. Das half uns später, Optimierungspotenziale präziser zu identifizieren und untermauerte auch POL-FIN-007-Konformität."}
{"ts": "110:00", "speaker": "I", "text": "Könnten Sie bitte noch einmal auf die Lessons Learned aus der Umsetzung von RFC-1502 eingehen, speziell in Bezug auf unsere operativen SLAs?"}
{"ts": "110:10", "speaker": "E", "text": "Ja, gern. RFC-1502 hat uns gezeigt, dass wir bei Änderungen an Cost Guardrails zwingend die SLA-Matrix aus dem Runbook RB-FIN-12 gegenprüfen müssen. Wir hatten damals kurzfristige Performance-Degradationen in einem Batch-Prozess, weil wir die IOPS-Limits zu strikt gesetzt hatten."}
{"ts": "110:25", "speaker": "I", "text": "Das heißt, Sie haben eine direkte Verbindung zwischen Kostensenkungen und SLA-Verletzungen festgestellt?"}
{"ts": "110:33", "speaker": "E", "text": "Genau. Die Kostenreduktion um 8% war zwar erfolgreich, aber wir mussten danach bei zwei Kunden SLA-Credits gewähren. Das hat den Nettoeffekt auf ca. 5% reduziert. In den Lessons Learned steht jetzt explizit, immer den 'Performance Impact Check' einzubauen."}
{"ts": "110:50", "speaker": "I", "text": "Wie dokumentieren Sie solche Checks aktuell?"}
{"ts": "110:57", "speaker": "E", "text": "Wir haben im Confluence-Bereich 'FinOps Ops' ein Template ergänzt, das neben den Budget- und Quotenparametern auch eine Spalte für erwartete Performance-Auswirkungen enthält. Jeder RFC muss das ausfüllen, bevor er in die CAB-Review geht."}
{"ts": "111:15", "speaker": "I", "text": "Gab es Fälle, wo dieser neue Prozess eine Maßnahme gestoppt hat?"}
{"ts": "111:22", "speaker": "E", "text": "Ja, Ticket FIN-874 im März. Dort wollten wir Reserved Instances vorzeitig kündigen, um flexiblere Spot-Instanzen zu nutzen. Der Impact Check zeigte jedoch, dass die Spot-Kapazität in der Region sehr volatil war. Wir haben abgebrochen, um SLA-Risiken zu vermeiden."}
{"ts": "111:40", "speaker": "I", "text": "Wie stellen Sie sicher, dass solche Entscheidungen im Team nachvollziehbar bleiben?"}
{"ts": "111:48", "speaker": "E", "text": "Neben der Doku im Ticket verlinken wir alle relevanten Metriken aus dem Helios Datalake-Dashboard direkt ins JIRA-Board. So kann auch Monate später noch jeder sehen, auf welcher Datenbasis wir entschieden haben."}
{"ts": "112:05", "speaker": "I", "text": "Haben Sie vor, diesen 'Impact Check' auch auf Quasar Billing Reports anzuwenden?"}
{"ts": "112:12", "speaker": "E", "text": "Das ist in Arbeit. Wir wollen die Quasar-Abrechnungsdaten mit den Performance-Metriken korrelieren. Ziel ist ein automatisierter Alert, wenn eine Kostenmaßnahme einen KPI wie Latenz oder Throughput negativ beeinflusst."}
{"ts": "112:28", "speaker": "I", "text": "Welche Risiken sehen Sie bei dieser Automatisierung?"}
{"ts": "112:35", "speaker": "E", "text": "Ein Risiko ist, dass wir zu viele False Positives erzeugen, weil nicht jede Latenzspitze kausal mit einer Kostensenkung verknüpft ist. Wir müssen die Alert-Logik feinjustieren, sonst leidet die Akzeptanz im Betriebsteam."}
{"ts": "112:50", "speaker": "I", "text": "Planen Sie, diese Logik in einem weiteren RFC festzuhalten?"}
{"ts": "113:00", "speaker": "E", "text": "Ja, das wird RFC-1609. Wir werden darin die Korrelationsregeln, Schwellenwerte und den Freigabeprozess durch die CAB definieren, um sicherzustellen, dass Kosteneffizienz und Performance-SLAs im Gleichgewicht bleiben."}
{"ts": "118:00", "speaker": "I", "text": "Zum Abschluss würde ich gern noch hören, wie Sie Lessons Learned aus den bisherigen FinOps-Zyklen im Projekt Vesta dokumentieren."}
{"ts": "118:10", "speaker": "E", "text": "Wir pflegen dafür ein internes Confluence-Board, ergänzt durch Tickets im System NVS-Jira. Dort verlinken wir Runbook-Updates, z.B. RBK-VE-042, und erfassen auch Abweichungen von POL-FIN-007."}
{"ts": "118:25", "speaker": "I", "text": "Haben Sie ein Beispiel, wo so ein Lessons Learned direkt in eine Policy-Änderung mündete?"}
{"ts": "118:35", "speaker": "E", "text": "Ja, nach einer Forecast-Fehlkalkulation im Q1, die durch ein verspätetes Update aus dem Helios Datalake verursacht wurde, haben wir RFC-1610 eingereicht. Das führte zu einer Anpassung der Datenvalidierungsschritte in POL-FIN-007 Anhang B."}
{"ts": "118:55", "speaker": "I", "text": "Interessant. Wie binden Sie andere Projekte, etwa Helios oder Quasar, in diesen Feedback-Prozess ein?"}
{"ts": "119:05", "speaker": "E", "text": "Wir haben ein monatliches Cross-Projekt-Sync-Meeting. Dort vergleichen wir Quasar Billing-Daten mit Helios-Exporten, um Inkonsistenzen früh zu erkennen. Das ist inzwischen ein fester KPI-Checkpoint geworden."}
{"ts": "119:25", "speaker": "I", "text": "Gab es dabei auch mal Zielkonflikte zwischen Projekten?"}
{"ts": "119:35", "speaker": "E", "text": "Ja, zum Beispiel wollte Quasar ein neues Preismodell testen, das unsere Forecast-Modelle verzerrt hätte. Wir mussten im FinOps Steering Board eine Ausnahme erwirken, dokumentiert in Ticket FIN-EXC-2023-07."}
{"ts": "119:55", "speaker": "I", "text": "Wie wurde dieser Zielkonflikt gelöst?"}
{"ts": "120:05", "speaker": "E", "text": "Wir haben eine temporäre doppelte Modellierung eingeführt: einmal mit dem Testmodell und parallel mit den alten Tarifen. So konnten wir die SLA-Einhaltung prüfen, ohne unsere Budget-Quoten zu gefährden."}
{"ts": "120:25", "speaker": "I", "text": "Gab es dafür besondere Genehmigungen?"}
{"ts": "120:35", "speaker": "E", "text": "Ja, laut Runbook RBK-VE-051 musste der CTO zustimmen, zudem war ein Finance-Signoff erforderlich. Diese wurden in RFC-1622 hinterlegt."}
{"ts": "120:50", "speaker": "I", "text": "Wie stellen Sie sicher, dass solche Sonderfälle nicht zur Norm werden?"}
{"ts": "121:00", "speaker": "E", "text": "Wir setzen klare Ablaufdaten für Ausnahmen, maximal zwei Abrechnungszyklen. Danach muss ein Reassessment erfolgen, sonst wird die Ausnahme automatisch geschlossen."}
{"ts": "121:20", "speaker": "I", "text": "Abschließend: Welche offene Baustelle sehen Sie derzeit als kritischstes Risiko?"}
{"ts": "121:30", "speaker": "E", "text": "Die größte Herausforderung ist aktuell die Balance zwischen aggressiver Spot-Instance-Nutzung und der Einhaltung unserer Performance-SLAs. Ein zu aggressives Scaling Down, wie in Ticket INC-VE-884 dokumentiert, führte schon einmal zu Latenzspitzen. Wir arbeiten daher an einem heuristischen Modell, das Kostenersparnis mit SLA-Pufferwerten abgleicht."}
{"ts": "126:00", "speaker": "I", "text": "Bevor wir zum Abschluss kommen, würde mich interessieren, ob Sie seit der Umsetzung von RFC-1502 neue Muster in den Cloud-Ausgaben feststellen konnten."}
{"ts": "126:15", "speaker": "E", "text": "Ja, tatsächlich. Seit wir die im RFC-1502 definierten Instanztypen priorisieren, sehen wir ein stabileres Ausgabeverhalten, vor allem bei den Compute-Kosten. Die Peaks, die vorher durch unplanmäßige Skalierungen entstanden, sind um ca. 18 % zurückgegangen."}
{"ts": "126:37", "speaker": "I", "text": "Wie haben Sie diese Veränderung quantifiziert? Gab es dafür ein spezielles Monitoring-Setup?"}
{"ts": "126:50", "speaker": "E", "text": "Wir nutzen ein erweitertes Dashboard in der Vesta Console, das auf dem Helios Datalake basiert. Dort sind die täglichen Ausgaben pro Service visualisiert, ergänzt durch ein Alerting, das auf die Quoten aus POL-FIN-007 referenziert. Zusätzlich haben wir in Runbook RB-CC-021 beschrieben, wie diese Daten monatlich zu prüfen sind."}
{"ts": "127:18", "speaker": "I", "text": "Gab es im Zuge dessen auch Anpassungen an den SLAs, um die Kostensenkungen nicht zu gefährden?"}
{"ts": "127:32", "speaker": "E", "text": "Teilweise. Für weniger kritische Batch-Jobs haben wir das Performance-SLA von 99,9 % auf 99,5 % angepasst, dokumentiert in SLA-Appendix-2023-04. Damit konnten wir günstigere Spot-Instanzen nutzen, ohne die Kernservices wie den Zahlungsabgleich zu beeinträchtigen."}
{"ts": "127:58", "speaker": "I", "text": "Haben Sie dazu auch Feedback von den anderen Projektteams erhalten, etwa aus Helios oder Quasar?"}
{"ts": "128:12", "speaker": "E", "text": "Ja, das Helios-Team war anfangs skeptisch, weil sie befürchteten, dass längere Ladezeiten ihre ETL-Prozesse stören könnten. Nach einem zweiwöchigen Testlauf mit Performance-Metriken aus Ticket MON-482 hat sich aber gezeigt, dass die Unterschiede im Sekundenbereich liegen und tolerierbar sind."}
{"ts": "128:39", "speaker": "I", "text": "Interessant. Hat diese Kooperation auch zu neuen Optimierungsideen geführt?"}
{"ts": "128:52", "speaker": "E", "text": "Definitiv. Wir planen jetzt, Storage-Tiers dynamisch anzupassen. Das kam durch Quasar Billing, das uns auf inaktive Abrechnungsdaten hinwies. Die Umsetzung wollen wir als RFC-1530 einreichen, mit einer geschätzten Einsparung von 12 % auf den Storage-Kosten."}
{"ts": "129:20", "speaker": "I", "text": "Wie gehen Sie bei einem neuen RFC vor, um alle relevanten Stakeholder einzubinden?"}
{"ts": "129:33", "speaker": "E", "text": "Wir starten mit einem Draft im Confluence-Bereich 'FinOps RFCs', dann gibt es einen Review-Call mit Vertretern aus Security, Operations und den betroffenen Projekten wie Helios und Quasar. Erst nach deren Freigabe wandert der RFC in die Implementierungs-Pipeline."}
{"ts": "129:58", "speaker": "I", "text": "Gab es schon Fälle, wo ein RFC abgelehnt wurde aus Risikoüberlegungen?"}
{"ts": "130:10", "speaker": "E", "text": "Ja, RFC-1495 wurde gestoppt, weil die vorgeschlagene Reduktion der Backup-Frequenz zwar 5 % Kosten gespart hätte, aber laut Risk Assessment RA-22-09 die Recovery Time Objectives überschritten hätte."}
{"ts": "130:32", "speaker": "I", "text": "Das klingt nach einem klaren Trade-off zwischen Kosten und Verfügbarkeit. Würden Sie sagen, dass hier das Prinzip 'Safety First' überwogen hat?"}
{"ts": "130:45", "speaker": "E", "text": "Absolut. Wir haben uns bewusst gegen die Einsparung entschieden, weil Kundendaten und Verfügbarkeit oberste Priorität haben. Das ist auch so in unserem internen Wertekompass festgehalten, und jedes Teammitglied kennt diese Leitlinie."}
{"ts": "144:00", "speaker": "I", "text": "Könnten Sie bitte noch ein Beispiel geben, wie Sie eine Optimierungsidee von der ersten Beobachtung bis zur Umsetzung begleiten?"}
{"ts": "144:05", "speaker": "E", "text": "Ja, gern. Letztes Quartal habe ich im Helios-Datalake im CostUsageView eine anomale Spitzenlast bei Storage-IO entdeckt. Die Analyse führte mich über die Tagging-Reports zu einem Service in der Staging-Zone, der seit Monaten nicht mehr genutzt wurde."}
{"ts": "144:15", "speaker": "E", "text": "Ich habe dann zunächst ein internes Ticket FINOPS-442 erstellt, die Owner ausfindig gemacht und mit ihnen gemeinsam einen Decommission-Plan erstellt. Das Ganze wurde dann als RFC-1620 in unser Change-Board gebracht."}
{"ts": "144:23", "speaker": "I", "text": "Und wie wurde der Erfolg dieser Maßnahme gemessen?"}
{"ts": "144:27", "speaker": "E", "text": "Wir haben nach Umsetzung die Kostenentwicklung im Quasar Billing Dashboard verfolgt. Monatlich sparen wir nun etwa 4.800 € ein. Der ROI wurde im Optimierungs-Runbook ORB-17 dokumentiert."}
{"ts": "144:35", "speaker": "I", "text": "Gab es dabei Herausforderungen in Bezug auf bestehende SLAs?"}
{"ts": "144:39", "speaker": "E", "text": "Ja, minimal. Der Service war zwar inaktiv, aber laut SLA-Archiv SLA-STG-03 hätte er innerhalb von 24 h wiederherstellbar sein müssen. Wir haben daher ein Backup im Glacier-Tier angelegt, um die SLA-Anforderung zu erfüllen."}
{"ts": "144:48", "speaker": "I", "text": "Wie gehen Sie generell mit der Balance zwischen Kostensenkung und Performance um?"}
{"ts": "144:53", "speaker": "E", "text": "Wir nutzen intern die Heuristik 'Kosten runter, solange P95-Latenz < SLA-Grenze'. Das heißt, jede Optimierung wird gegen Performance-Dashboards aus Helios validiert, bevor sie live geht."}
{"ts": "145:02", "speaker": "I", "text": "Sie hatten RFC-1502 vorhin erwähnt. Gab es ähnliche Fälle mit vergleichbarem Trade-off?"}
{"ts": "145:07", "speaker": "E", "text": "Ja, bei RFC-1502 ging es um die Reduzierung von Reserved Instance Commitments. Wir haben damals Performance-Spitzen im Projekt Orion abgefangen, indem wir nur 60 % der Kapazität langfristig banden und 40 % flexibel hielten."}
{"ts": "145:15", "speaker": "I", "text": "Welche Risiken sehen Sie bei zu aggressiven Kürzungen?"}
{"ts": "145:19", "speaker": "E", "text": "Das Hauptrisiko ist Underprovisioning. Im schlimmsten Fall führt es zu SLA-Verletzungen, was gemäß unserem Incident-Runbook IR-5 zu P1-Incidents eskaliert werden müsste."}
{"ts": "145:27", "speaker": "I", "text": "Wie stellen Sie sicher, dass diese Risiken früh erkannt werden?"}
{"ts": "145:31", "speaker": "E", "text": "Wir haben in Grafana Alerts konfiguriert, die bei 80 % Auslastung der kritischen Ressourcen anschlagen. Zudem reviewen wir wöchentlich im FinOps-Standup alle offenen Optimierungs-RFCs auf Performance-Impact."}
{"ts": "145:38", "speaker": "I", "text": "Das klingt nach einem strukturierten Vorgehen, danke für die detaillierten Einblicke."}
{"ts": "146:00", "speaker": "I", "text": "Sie hatten ja vorhin die Querverbindung zwischen Helios Datalake und Quasar Billing erwähnt. Können Sie vielleicht noch einmal erläutern, wie genau diese beiden Systeme zusammenwirken, wenn es um die wöchentliche Budgetvalidierung geht?"}
{"ts": "146:05", "speaker": "E", "text": "Ja, gern. Helios Datalake aggregiert die Rohdaten aus allen Cloud-Accounts – da fließen Compute, Storage und Network Metriken rein. Quasar Billing zieht sich dann daraus die abrechnungsrelevanten Events, mapped die Kostencodes gemäss unserem internen Mapping-Runbook RB-FIN-12 und vergleicht sie mit den Quoten aus POL-FIN-007. Ohne diesen Abgleich könnten wöchentliche Budgetabweichungen leicht unbemerkt bleiben."}
{"ts": "146:13", "speaker": "I", "text": "Verstehe. Und was passiert, wenn der Abgleich eine größere Abweichung feststellt?"}
{"ts": "146:17", "speaker": "E", "text": "Dann triggert Quasar automatisch ein Ticket im System, Typ 'FIN-BUD-ALERT'. Das landet in unserem Kanban-Board und wir müssen innerhalb von 24 Stunden eine Root-Cause-Analyse starten. In manchen Fällen erstellen wir direkt eine RFC, falls es zu Konfigurationsänderungen kommt."}
{"ts": "146:25", "speaker": "I", "text": "Gab es zuletzt so einen Fall?"}
{"ts": "146:29", "speaker": "E", "text": "Ja, im März hatten wir bei einem Storage-Bucket in der EU-Region eine plötzliche Kostensteigerung um 18 %. Das Ticket FIN-BUD-ALERT-2214 führte zu RFC-1620, in dem wir die Lifecycle-Policy angepasst haben, um alte Objekte nach 30 Tagen zu löschen."}
{"ts": "146:38", "speaker": "I", "text": "Und wie wurde der Erfolg dieser Maßnahme gemessen?"}
{"ts": "146:42", "speaker": "E", "text": "Wir haben die Metriken vor und nach der Änderung im Datalake verglichen. Nach vier Wochen waren die monatlichen Storage-Kosten in dieser Region um 14 % gesunken. Das ROI-Dashboard im Optimierungsbereich hat die Einsparung direkt sichtbar gemacht."}
{"ts": "146:50", "speaker": "I", "text": "Gab es dabei Trade-offs oder Risiken, die Sie abwägen mussten?"}
{"ts": "146:54", "speaker": "E", "text": "Ja, klar. Kürzere Lifecycle-Policies können Datenlöschen beschleunigen, was bei versehentlichen Löschungen problematisch wäre. Wir haben daher gemäß RFC-1502 die Backup-Frequenz von wöchentlich auf täglich erhöht, um das Risiko zu minimieren. Der Trade-off war ein leicht höherer Backup-Speicherbedarf."}
{"ts": "147:03", "speaker": "I", "text": "Wie hat das Team auf diesen zusätzlichen Speicherbedarf reagiert?"}
{"ts": "147:07", "speaker": "E", "text": "Wir haben im Performance-SLA eine kleine Anpassung vorgenommen: Die Backup-Jobs laufen nun in Off-Peak-Zeiten, um den Compute-Impact gering zu halten. Außerdem wurde im Runbook RB-BKP-05 dokumentiert, wie diese Jobs priorisiert werden."}
{"ts": "147:15", "speaker": "I", "text": "Klingt nach einem ausgewogenen Kompromiss. Gibt es noch weitere Optimierungsbereiche, die Sie im Blick haben?"}
{"ts": "147:19", "speaker": "E", "text": "Ja, wir schauen aktuell auf die Right-Sizing-Empfehlungen für unsere Kubernetes-Cluster. Eine Pilot-Umsetzung läuft in zwei Non-Prod-Umgebungen. Die Ergebnisse kommen dann ins ROI-Dashboard und bei Erfolg in eine neue RFC."}
{"ts": "147:26", "speaker": "I", "text": "Und wie stellen Sie sicher, dass bei solchen Projekten die Budget-Policy POL-FIN-007 nicht verletzt wird?"}
{"ts": "147:30", "speaker": "E", "text": "Wir haben in Jenkins einen Pre-Deployment-Check eingebaut, der Quasar Billing anfragt und prüft, ob die geplante Änderung das Budget überschreiten könnte. Falls ja, blockt der Build und weist auf die nötige Genehmigung gemäß POL-FIN-007 hin."}
{"ts": "148:00", "speaker": "I", "text": "Könnten Sie bitte nochmal konkret beschreiben, welche täglichen Kernaufgaben Sie im Rahmen von Vesta FinOps haben?"}
{"ts": "148:05", "speaker": "E", "text": "Ja klar, mein Hauptfokus liegt auf der Einhaltung der Cloud Cost Budgets laut POL-FIN-007, also Monitoring der Quotas, Abgleich mit Forecasts und das Initiieren von Optimierungsmaßnahmen. Zusätzlich überprüfe ich täglich die Alerts aus dem Guardrail-System, um Abweichungen schnell zu erkennen."}
{"ts": "148:13", "speaker": "I", "text": "Und wie spiegeln sich dabei Unternehmenswerte wie „Safety First“ wider?"}
{"ts": "148:18", "speaker": "E", "text": "Safety First bedeutet für uns z. B., dass wir keine abrupten Kostenschnitte machen, die die Availability gefährden könnten. Wir verknüpfen Cost Reports immer mit den Service Health KPIs, um Risiken rechtzeitig zu erkennen."}
{"ts": "148:27", "speaker": "I", "text": "Bei den KPIs – welche verfolgen Sie derzeit aktiv?"}
{"ts": "148:32", "speaker": "E", "text": "Aktuell sind das u. a. Cost per Service per Tag, Budgetabweichung in Prozent, und der Optimierungs-ROI. Zusätzlich haben wir einen KPI, der die Zeit bis zur Behebung einer Budgetverletzung misst."}
{"ts": "148:40", "speaker": "I", "text": "Wie implementieren Sie konkret die Vorgaben aus POL-FIN-007?"}
{"ts": "148:45", "speaker": "E", "text": "Wir haben ein Policy Enforcement Script, das jeden Morgen im Rahmen des Helios Datalake ETL-Laufs die aktuellen Ausgaben prüft. Falls die 80%-Warnschwelle überschritten wird, erstellt es automatisch ein Ticket im FinOps-Queue, z. B. FIN-8231."}
{"ts": "148:54", "speaker": "I", "text": "Und bei Abweichungen – wie reagieren Sie?"}
{"ts": "148:59", "speaker": "E", "text": "Zuerst analysieren wir mit Quasar Billing die betroffenen Services, prüfen ob es saisonale Lastspitzen gibt. Wenn nicht, stoßen wir eine Optimierungs-RFC an, wie zuletzt RFC-1538, um etwa Instanzgrößen zu reduzieren."}
{"ts": "149:08", "speaker": "I", "text": "Sie erwähnten Forecasts – wie erstellen Sie die monatlich?"}
{"ts": "149:13", "speaker": "E", "text": "Wir ziehen Daten aus Helios Datalake (tägliche Kostenhistorie) und Quasar Billing (tagesaktuelle Nutzungsmetriken), laufen sie durch unser Prophet-basiertes Forecast-Modell und validieren die Ausreißer manuell. Das Ergebnis wird im Dashboard VES-FC1 veröffentlicht."}
{"ts": "149:23", "speaker": "I", "text": "Gibt es bei diesen Forecasts Abhängigkeiten zu anderen Projekten?"}
{"ts": "149:28", "speaker": "E", "text": "Ja, definitiv. Zum Beispiel hängen die Datenfeeds für Compute-Kosten vom Helios Datalake-Refresh ab, der wiederum von ETLs aus dem Projekt Orion Batch Processing beliefert wird. Verzögerungen dort verschieben unsere Forecast-Generierung."}
{"ts": "149:38", "speaker": "I", "text": "Das heißt, Sie müssen cross-project Dependencies managen?"}
{"ts": "149:42", "speaker": "E", "text": "Genau, wir haben dafür ein internes Dependency-Register im Confluence angelegt. Dort dokumentieren wir z. B., welche Pipelines kritisch für Vesta FinOps sind und welchen SLA-Impact eine Verzögerung hätte."}
{"ts": "149:36", "speaker": "I", "text": "Können Sie bitte noch einmal konkret umreißen, welche Verantwortung Sie im Projekt Vesta FinOps tragen?"}
{"ts": "149:40", "speaker": "E", "text": "Ja, also mein Hauptverantwortungsbereich ist die Umsetzung und das Monitoring der Cloud-Kosten-Guardrails gemäß POL-FIN-007. Ich koordiniere die Budgets für alle Business Units, setze Quoten in den jeweiligen Cloud-Accounts und überprüfe wöchentlich die Einhaltung. Außerdem bin ich Bindeglied zu den Produktteams, wenn es um Kostenanomalien geht."}
{"ts": "149:50", "speaker": "I", "text": "Wie passen Ihre täglichen Aufgaben zu den Unternehmenswerten wie „Safety First“ oder „Evidence over Hype“?"}
{"ts": "149:55", "speaker": "E", "text": "„Safety First“ bedeutet für mich, dass jede Kostenmaßnahme erst nach einer Impact-Analyse umgesetzt wird, um keine SLA-Verletzungen zu riskieren. Und „Evidence over Hype“ lebe ich, indem ich alle Optimierungsvorschläge mit Daten aus dem Helios Datalake untermauere, statt auf Trends zu setzen."}
{"ts": "150:04", "speaker": "I", "text": "Welche KPIs verfolgen Sie aktuell für das Projekt?"}
{"ts": "150:08", "speaker": "E", "text": "Primär den KPI 'Cloud Cost per Active User', die Budgetabweichung in Prozent und den Anteil automatisierter Abschaltungen außerhalb der Geschäftszeiten. Letzterer ist direkt mit unseren Runbook-Prozessen verknüpft."}
{"ts": "150:16", "speaker": "I", "text": "Wie setzen Sie konkret die Cloud Cost Budgets & Quotas Policy um?"}
{"ts": "150:21", "speaker": "E", "text": "Wir haben in Quasar Billing Quotenregeln hinterlegt. Bei 80% Auslastung wird automatisch ein Jira-Ticket generiert, z. B. FINOPS-3241, und das Team informiert. Bei 95% greift ein automatischer Deploy-Blocker, den ich nach Analyse manuell freigeben kann."}
{"ts": "150:31", "speaker": "I", "text": "Und wie gehen Sie mit Abweichungen um?"}
{"ts": "150:35", "speaker": "E", "text": "Zunächst analysiere ich den Ausreißer im Helios Datalake – oft steckt ein geplanter Lasttest dahinter. Falls nicht, leite ich gemäß Runbook RB-FIN-12 eine Eskalation ein, die auch eine kurzfristige Ressourcenanpassung beinhalten kann."}
{"ts": "150:43", "speaker": "I", "text": "Welche Tools oder Dashboards nutzen Sie für die Überwachung?"}
{"ts": "150:47", "speaker": "E", "text": "Quasar Billing für die Rechnungsdaten, Helios Datalake für die Nutzungsmetriken, und ein internes Grafana-Dashboard, das beides kombiniert. Alerts laufen über OpsNotify."}
{"ts": "150:54", "speaker": "I", "text": "Wie erstellen Sie Ihre monatlichen Forecasts?"}
{"ts": "150:58", "speaker": "E", "text": "Ich exportiere historische Nutzungsdaten aus Helios, kombiniere sie mit den Budgetdaten aus Quasar und wende ein saisonales ARIMA-Modell an. Die Ergebnisse werden in einem Forecast-Report dokumentiert, der auch Abhängigkeiten zu Projekten wie Helios Datalake Releases berücksichtigt."}
{"ts": "151:06", "speaker": "I", "text": "Gibt es Abhängigkeiten zu Quasar Billing?"}
{"ts": "151:10", "speaker": "E", "text": "Ja, insbesondere bei Preisänderungen der Cloud-Anbieter. Diese werden zuerst in Quasar Billing übernommen, und mein Forecast-Tool zieht dann automatisch die aktualisierten Tarife – das ist der Multi-Hop zwischen Abrechnung und Analyse."}
{"ts": "151:06", "speaker": "I", "text": "Wir hatten vorhin ja schon kurz Ihre Schnittstellen angesprochen. Mich würde interessieren, wie genau Sie Forecast-Daten aus Helios Datalake und Quasar Billing zusammenführen."}
{"ts": "151:13", "speaker": "E", "text": "Ja, also der Prozess ist ein bisschen… hm, verschachtelt. Zuerst ziehe ich die Rohdaten zu Compute- und Storage-Nutzung aus dem Helios Datalake, da steckt auch schon eine gewisse Voraggregation drin. Danach importiere ich die Rechnungsdaten von Quasar Billing, die im JSON-Format mit einzelnen Service-IDs vorliegen."}
{"ts": "151:27", "speaker": "I", "text": "Und wie stellen Sie sicher, dass das Matching sauber erfolgt?"}
{"ts": "151:32", "speaker": "E", "text": "Wir nutzen eine interne Mapping-Tabelle aus dem Runbook FIN-RB-042. Dort sind die Service-IDs beider Systeme harmonisiert. Das Mapping wird monatlich überprüft, um Abweichungen zu vermeiden, die sonst schnell Forecast-Fehler von fünf Prozent oder mehr verursachen könnten."}
{"ts": "151:46", "speaker": "I", "text": "Spannend. Gibt es auch Abhängigkeiten zu anderen Projekten, die diese Forecasts beeinflussen?"}
{"ts": "151:51", "speaker": "E", "text": "Ja, tatsächlich. Änderungen im Helios Datalake durch das Projekt Orion Analytics wirken sich direkt auf die Datenlatenz aus. Wenn dort ETL-Jobs verschoben werden, muss ich im Vesta-Forecast-Runbook ein temporäres Delay eintragen und die Vorhersagen anpassen. Das ist dieser Multi-Hop-Effekt, bei dem zwei unabhängige Systeme – Helios und Quasar – über unsere Prozesse gekoppelt sind."}
{"ts": "152:10", "speaker": "I", "text": "Verstehe. Und wie gehen Sie mit Abweichungen beim Budget um, wenn diese durch solche Latenzen entstehen?"}
{"ts": "152:16", "speaker": "E", "text": "Da greift POL-FIN-007 ganz klar: Wenn eine Abweichung über 2 % liegt, muss ich einen Budget-Abweichungs-Report erstellen und im Ticket-System unter FINOPS-ALERT taggen. Meistens schieben wir dann konservative Puffer in den Forecast, um nicht versehentlich Quoten zu reißen."}
{"ts": "152:30", "speaker": "I", "text": "Nutzen Sie dafür spezielle Dashboards?"}
{"ts": "152:34", "speaker": "E", "text": "Ja, wir haben ein internes Grafana-Board, das direkt an Helios und Quasar angebunden ist. Dort sehe ich in Near-Real-Time die Auslastungen und kann Alerts setzen, wenn wir in die 90 %-Zone der Quoten laufen."}
{"ts": "152:45", "speaker": "I", "text": "Gab es jüngst eine Optimierungsmaßnahme, die aus genau so einer Alarmierung resultierte?"}
{"ts": "152:50", "speaker": "E", "text": "Ja, im Februar hatten wir eine Storage-Auslastung von 92 % in einem Data-Mining-Cluster. Wir haben dann gemäß RFC-1488 entschieden, auf ein günstigeres Objekt-Storage-Tier zu migrieren. Das hat uns im Quartal rund 4 500 € gespart."}
{"ts": "153:04", "speaker": "I", "text": "Wie haben Sie den Erfolg dieser Maßnahme dokumentiert?"}
{"ts": "153:08", "speaker": "E", "text": "Neben der ROI-Berechnung im Optimierungs-Log habe ich im Runbook FIN-RB-055 die Migrationsschritte festgehalten. Das dient auch als Vorlage für künftige Cluster-Migrationen."}
{"ts": "153:18", "speaker": "I", "text": "Das klingt sehr strukturiert. Würden Sie sagen, dass diese Art von Dokumentation auch zukünftige Budget-Entscheidungen beeinflusst?"}
{"ts": "153:26", "speaker": "E", "text": "Definitiv. Wenn wir im Steering Committee nachweisen können, dass eine Maßnahme in drei Monaten Break-Even erreicht, ist die Bereitschaft höher, ähnliche Optimierungen freizugeben – selbst wenn kurzfristig Migrationskosten anfallen."}
{"ts": "153:06", "speaker": "I", "text": "Lassen Sie uns bitte nun noch einmal vertieft auf das Quotenmanagement eingehen – wie stellen Sie sicher, dass die in POL-FIN-007 definierten Quoten nicht nur eingehalten, sondern auch kontinuierlich angepasst werden?"}
{"ts": "153:12", "speaker": "E", "text": "Wir prüfen die Quoten monatlich im Cloud Spend Dashboard, das direkt aus dem Helios Datalake gespeist wird. Abweichungen >5 % triggern automatisch ein Ticket im FinOps-Board, z. B. FOPS-3421, und wir passen die Quoten an, indem wir die Parameter in der BudgetConfig.yaml der jeweiligen Business Unit aktualisieren."}
{"ts": "153:19", "speaker": "I", "text": "Und wie fließt diese Quotenanpassung dann in Ihre Forecasts ein? Nutzen Sie da einen automatisierten Abgleich?"}
{"ts": "153:25", "speaker": "E", "text": "Ja, der Forecast-Generator zieht sich die aktualisierten Quotenwerte aus dem Quasar Billing API, vergleicht sie mit den historischen Spend-Daten im Helios Datalake und recalculates die erwarteten Kosten – das ist in unserem Runbook RB-FIN-019 unter Schritt 4 dokumentiert."}
{"ts": "153:32", "speaker": "I", "text": "Gibt es dabei Abhängigkeiten zu anderen Projekten außerhalb von Vesta FinOps?"}
{"ts": "153:38", "speaker": "E", "text": "Definitiv – zum Beispiel hängt die Datenqualität stark von der zeitgerechten Verarbeitung im Helios Datalake ab, der wiederum vom ETL-Job im Projekt Helios Core abhängt. Wenn dort ein Delay auftritt, wie im Incident INC-HC-554, müssen wir den Forecast manuell mit konservativen Annahmen ergänzen."}
{"ts": "153:45", "speaker": "I", "text": "Verstehe. Können Sie ein praktisches Beispiel geben, wo diese Abhängigkeit einen Forecast stark beeinflusst hat?"}
{"ts": "153:51", "speaker": "E", "text": "Im April hatten wir einen 48-Stunden-Lag im Datalake-Refresh. Das führte dazu, dass die Quasar Billing-Daten für zwei Services fehlten. Unser Forecast wies daher eine optimistic bias von etwa 4 % auf – das haben wir in der Lessons Learned Sektion des RFC-1620 festgehalten."}
{"ts": "153:58", "speaker": "I", "text": "Sie erwähnten RFC-1620 – war dies auch mit Optimierungsmaßnahmen verknüpft?"}
{"ts": "154:04", "speaker": "E", "text": "Ja, wir haben daraufhin eine Optimierung im ETL-Prozess implementiert: statt einen kompletten Refresh zu erzwingen, nutzen wir jetzt einen Delta-Load-Mechanismus. Das reduziert das Risiko für Lags und senkt parallel die Compute-Kosten im Helios Cluster um ca. 7 %."}
{"ts": "154:11", "speaker": "I", "text": "Wie wurde der Erfolg dieser Optimierung gemessen?"}
{"ts": "154:17", "speaker": "E", "text": "Über eine Kombination aus Cost-Metriken aus Quasar Billing und Performance-Metriken aus dem Helios Monitoring Tool. Wir vergleichen drei Monate vor und nach der Änderung und berechnen den ROI nach Formel in RB-FIN-021. Ergebnis: ROI lag bei 2,8 innerhalb von sechs Monaten."}
{"ts": "154:24", "speaker": "I", "text": "Gab es bei der Einführung dieses Delta-Loads irgendwelche Risiken oder Trade-offs, die Sie berücksichtigen mussten?"}
{"ts": "154:30", "speaker": "E", "text": "Ja, der Delta-Load kann im Fehlerfall inkonsistente Datensätze hinterlassen. Wir mussten also einen zusätzlichen Validierungsschritt einbauen, der in Runbook RB-DATA-008 beschrieben ist. Dadurch verlängert sich der ETL-Job um ca. 15 Minuten, was wir gegen die Kostenersparnis abwägen mussten."}
{"ts": "154:37", "speaker": "I", "text": "Wie haben Sie diese Abwägung dokumentiert?"}
{"ts": "154:43", "speaker": "E", "text": "In RFC-1620, Abschnitt 5, ist eine Risiko-Matrix enthalten, die auf unseren SLA-Anforderungen basiert. Wir haben einen akzeptablen zusätzlichen ETL-Delay von maximal 20 Minuten definiert, sodass die 15 Minuten innerhalb der Toleranz liegen – dokumentiert und vom Change Advisory Board freigegeben."}
{"ts": "154:42", "speaker": "I", "text": "Lassen Sie uns nochmal konkret auf das Budget- und Quotenmanagement eingehen. Wie setzen Sie persönlich die Vorgaben aus der POL-FIN-007 im Tagesgeschäft um?"}
{"ts": "154:47", "speaker": "E", "text": "Also, ich überprüfe täglich die Budget-Thresholds für jede Cloud-Subscription im Guardrail-Dashboard und gleiche das mit den Quoten aus der Policy POL-FIN-007 ab. Wenn wir 80 % des Monatsbudgets erreichen, löse ich einen Alert im System aus, was dann automatisch ein Ticket im ITSM anlegt."}
{"ts": "154:53", "speaker": "I", "text": "Und wie reagieren Sie, wenn dieser Alert tatsächlich ausgelöst wird?"}
{"ts": "154:58", "speaker": "E", "text": "Zuerst analysiere ich im Helios Datalake die letzten 14 Tage Kostenverlauf. Falls ein einzelner Service auffällig ist, prüfe ich via Quasar Billing die Abrechnungsdetails. Danach entscheide ich, ob wir ein temporäres Budget-Limit setzen oder ein Optimierungs-RFC einleiten."}
{"ts": "155:04", "speaker": "I", "text": "Sie haben eben den Helios Datalake und Quasar Billing erwähnt – können Sie kurz erläutern, wie Sie diese beiden Systeme kombinieren?"}
{"ts": "155:09", "speaker": "E", "text": "Ja, das ist eine Art Multi-Hop-Prozess: Helios zieht die Rohkosten aus allen Cloud-Providern, bereinigt sie um Reservierungen, dann exportiere ich die aggregierten Tabellen in Quasar Billing. Dort werden sie mit Vertragsdaten aus dem Procurement-System verknüpft, sodass Forecasts realistischer werden."}
{"ts": "155:15", "speaker": "I", "text": "Verstehe. Und wie sichern Sie die Genauigkeit dieser Datenflüsse?"}
{"ts": "155:20", "speaker": "E", "text": "Wir haben im Runbook RB-FINOPS-021 eine wöchentliche Validierung beschrieben: Stichproben aus Helios werden gegen Provider-Rechnungen geprüft. Zusätzlich gibt es im Quasar Billing ein Schema-Check, der Inkonsistenzen bei Währung oder Zeitraum sofort markiert."}
{"ts": "155:27", "speaker": "I", "text": "Können Sie ein Beispiel einer Optimierungsinitiative nennen, die aus so einer Validierung hervorging?"}
{"ts": "155:32", "speaker": "E", "text": "Ja, im April hatten wir in RB-FINOPS-028 dokumentiert, dass mehrere Testumgebungen nicht mehr genutzt wurden. Nach RFC-1489 haben wir die automatisiert abgeschaltet. Das hat uns pro Monat etwa 4 % der Compute-Kosten eingespart."}
{"ts": "155:38", "speaker": "I", "text": "Wie messen Sie in so einem Fall den ROI?"}
{"ts": "155:43", "speaker": "E", "text": "Wir nehmen die direkten Kosteneinsparungen aus Quasar, subtrahieren die einmaligen Implementierungskosten – wie DevOps-Aufwand – und setzen das ins Verhältnis zum jährlichen Forecast. Bei den Testumgebungen lag der ROI nach drei Monaten bereits bei 180 %."}
{"ts": "155:50", "speaker": "I", "text": "Beeindruckend. Gibt es Abhängigkeiten oder Synergien mit anderen Projekten, die Einfluss auf Ihre Arbeit haben?"}
{"ts": "155:55", "speaker": "E", "text": "Ja, besonders mit Helios Datalake, der auch vom Projekt Orion DataHub genutzt wird. Änderungen dort – etwa am ETL-Plan – wirken sich direkt auf unsere Forecast-Zyklen aus. Wir stimmen uns daher wöchentlich mit dem Orion-Team ab, um Schema-Änderungen frühzeitig einzuplanen."}
{"ts": "156:00", "speaker": "I", "text": "Das klingt nach enger Abstimmung. Haben Sie dafür auch formale Kommunikationskanäle?"}
{"ts": "156:05", "speaker": "E", "text": "Ja, jeden Mittwoch gibt es ein gemeinsames Change-Review-Meeting, protokolliert im Confluence-Bereich 'Cross-Project Changes'. Außerdem verlinken wir relevante Tickets – z. B. CHG-4521 – direkt in unseren Runbooks, damit Kontext nicht verloren geht."}
{"ts": "156:02", "speaker": "I", "text": "Könnten Sie bitte erklären, wie Sie Ihre monatlichen Forecasts konkret im Helios Datalake aufbauen?"}
{"ts": "156:07", "speaker": "E", "text": "Ja, gern. Also, wir starten immer mit den Rohdaten aus Quasar Billing, die wir via ETL-Pipeline ins Helios Datalake laden. Dort werden die Daten gemäß unserem Schema 'cost_usage_v2' bereinigt und mit dem Service-Mapping aus dem Vesta-Tagging-Standard angereichert."}
{"ts": "156:16", "speaker": "E", "text": "Anschließend laufen im Datalake die Presto-Queries, die wir in Runbook RB-FIN-14 hinterlegt haben. So stellen wir sicher, dass die Forecast-Basis konsistent ist."}
{"ts": "156:25", "speaker": "I", "text": "Das heißt, Sie haben eine enge Verzahnung zwischen Quasar Billing und Helios Datalake?"}
{"ts": "156:29", "speaker": "E", "text": "Genau. Ohne die Quasar-Billing-Anreicherung würden uns wichtige Dimensionen fehlen, etwa die interne Kostenstellen-ID oder der SLA-Typ pro Service. Das ist gerade für Abgleiche mit den Performance-SLAs im Projekt Vesta FinOps essenziell."}
{"ts": "156:39", "speaker": "I", "text": "Und wie sichern Sie die Datenqualität in dieser Kette?"}
{"ts": "156:42", "speaker": "E", "text": "Wir haben in POL-FIN-007 ein Kapitel zur Datenvalidierung. Zusätzlich gibt es ein wöchentliches Delta-Check-Skript, dokumentiert in RB-FIN-22, das Quasar- und Helios-Daten stichprobenartig vergleicht. Abweichungen >2% werden als Ticket in JiraFIN-Board angelegt."}
{"ts": "156:54", "speaker": "I", "text": "Gab es zuletzt einen Fall mit signifikanter Abweichung?"}
{"ts": "156:57", "speaker": "E", "text": "Ja, vor drei Wochen. Ticket FIN-4732: Eine fehlerhafte Tag-Zuordnung bei einem Storage-Service hat die Kosten um 3,4% verschoben. Wir mussten rückwirkend das Mapping im Datalake anpassen und den Forecast korrigieren."}
{"ts": "157:08", "speaker": "I", "text": "Hat das auch Einfluss auf Optimierungsentscheidungen gehabt?"}
{"ts": "157:11", "speaker": "E", "text": "Absolut. Wir hatten parallel eine Initiative zur Abschaltung von Low-Usage-Volumes (RFC-1487). Mit den korrigierten Daten haben wir gesehen, dass der erwartete ROI niedriger ausfällt, also haben wir den Rollout gestaffelt, um SLAs nicht zu gefährden."}
{"ts": "157:22", "speaker": "I", "text": "Das klingt nach einer Entscheidung mit mehreren Einflussgrößen."}
{"ts": "157:25", "speaker": "E", "text": "Ja, es war ein klassischer Multi-Hop: Daten aus Quasar, Validierung in Helios, Abgleich mit Optimierungs-RFC und SLA-Monitoring in der Vesta Control Plane. Ohne diese Kette hätten wir wohl zu aggressiv gespart."}
{"ts": "157:36", "speaker": "I", "text": "Wie kommunizieren Sie solche Anpassungen intern?"}
{"ts": "157:39", "speaker": "E", "text": "Wir haben ein wöchentliches FinOps-Sync, in dem wir die Top-3 Abweichungen vorstellen. Dazu kommt ein Eintrag ins Change-Log des jeweiligen RFC im Confluence, damit alle Stakeholder informiert sind."}
{"ts": "157:48", "speaker": "I", "text": "Verstehe, und das alles ist Teil der laufenden Operate-Phase von Vesta FinOps."}
{"ts": "157:38", "speaker": "I", "text": "Wir hatten ja schon kurz Ihre Rolle angeschnitten – könnten Sie nochmal konkret darstellen, wie sich Ihr Verantwortungsbereich im Projekt Vesta FinOps gestaltet?"}
{"ts": "157:44", "speaker": "E", "text": "Klar, ich verantworte die laufende Überwachung der Cloud-Ausgaben aller Vesta-Mandanten. Das heißt, ich setze die Vorgaben aus POL-FIN-007 um, prüfe wöchentlich Quotenberichte und initiiere bei Überschreitungen Maßnahmen. Außerdem moderiere ich die Abstimmung mit den Tech-Leads, um Optimierungen einzusteuern."}
{"ts": "157:54", "speaker": "I", "text": "Und wie verbinden Sie diese operativen Aufgaben mit Unternehmenswerten wie \"Safety First\" oder \"Evidence over Hype\"?"}
{"ts": "158:00", "speaker": "E", "text": "Bei \"Safety First\" achte ich darauf, dass Kostensenkungen nicht zulasten der Verfügbarkeit gehen – das ist sogar als Prüfschritt im Runbook RNBK-VES-041 festgehalten. \"Evidence over Hype\" setze ich um, indem ich jede Entscheidung mit Daten aus Helios Datalake und Quasar Billing belege, bevor wir Änderungen freigeben."}
{"ts": "158:12", "speaker": "I", "text": "Welche KPIs haben Sie aktuell im Blick, um Ihren Erfolg zu messen?"}
{"ts": "158:16", "speaker": "E", "text": "Primär den Cost per Active User, die Budget-Compliance-Quote und die Mean Time to Budget Alert Resolution. Letztere soll unter 4 Stunden bleiben, wie in SLA-VES-12 definiert."}
{"ts": "158:25", "speaker": "I", "text": "Kommen wir zum Budget- und Quotenmanagement: Wie setzen Sie die Policy POL-FIN-007 konkret um?"}
{"ts": "158:30", "speaker": "E", "text": "Ich lade täglich die Budgetdaten aus Quasar Billing, vergleiche sie mit den festgelegten Quoten in unserem FinOps-Board, und bei Abweichungen >5% öffne ich ein Ticket im System JIRA-VES mit dem Tag POL-FIN-007 für Tracking. Dort dokumentiere ich auch Gegenmaßnahmen."}
{"ts": "158:42", "speaker": "I", "text": "Und wie reagieren Sie, wenn Sie solche Abweichungen feststellen?"}
{"ts": "158:46", "speaker": "E", "text": "Zunächst analysiere ich mit Helios Datalake, ob es saisonale Spitzen sind oder ein persistenter Trend. Bei Letzterem setze ich einen RFC auf – z.B. RFC-1489 für eine Speicherklassenänderung – und hole die Zustimmung der Architekturgruppe ein."}
{"ts": "158:58", "speaker": "I", "text": "Welche Tools oder Dashboards unterstützen Sie bei dieser Überwachung?"}
{"ts": "159:02", "speaker": "E", "text": "Wir nutzen ein internes Grafana-Dashboard mit Quasar-Plugin, gekoppelt an Alertmanager. Zusätzlich habe ich ein eigenes SQL-Notebook im Helios Datalake, das Forecasts und Ist-Daten visualisiert."}
{"ts": "159:12", "speaker": "I", "text": "Apropos Forecasts – wie erstellen Sie Ihre monatlichen Prognosen für die Cloud-Kosten?"}
{"ts": "159:18", "speaker": "E", "text": "Ich kombiniere historische Nutzungsdaten aus Helios mit den aktuellen Vertragskonditionen aus Quasar Billing. Das Modell berücksichtigt auch geplante Rollouts aus dem Projektplan, etwa neue Microservices, die zusätzliche Last generieren. Die Prognosevalidierung erfolgt dann gegen die letzten drei Monate."}
{"ts": "159:32", "speaker": "I", "text": "Gibt es dabei Abhängigkeiten zu anderen Projekten wie Helios Datalake oder Quasar Billing, die besonders kritisch sind?"}
{"ts": "159:38", "speaker": "E", "text": "Ja, absolut. Wenn Helios Datalake ein ETL-Fenster verschiebt, verzögert sich mein Forecasting-Run um bis zu 12 Stunden. Bei Quasar Billing haben wir eine harte Abhängigkeit, da wir dort die tagesaktuellen Preisänderungen für Spot-Instanzen einspielen – ohne das sind die Forecasts um bis zu 8% ungenau."}
{"ts": "159:08", "speaker": "I", "text": "Wir hatten eben schon über die Optimierungen gesprochen. Mich interessiert jetzt: welche konkreten Kennzahlen ziehen Sie heran, um den Erfolg einer Maßnahme zu belegen?"}
{"ts": "159:14", "speaker": "E", "text": "Ähm, ja, also wir nutzen da primär den Cost per Workload KPI aus dem FinOps-Dashboard. Zusätzlich tracken wir in unserer Confluence-Runbook-Sektion den Vergleich zwischen Forecast und Actuals über drei Monate, um Trends zu erkennen."}
{"ts": "159:23", "speaker": "I", "text": "Und diese Runbooks – sind die Teil einer formalen Dokumentation, oder eher Teamwissen?"}
{"ts": "159:28", "speaker": "E", "text": "Das ist gemischt. Die Kernschritte sind in RUN-FINOPS-012 formalisiert, inkl. Genehmigungspfad. Aber kleinere Heuristiken, etwa welche Storage-Tiers im Quasar Billing auffällig sind, stehen oft nur als Kommentar im Wiki."}
{"ts": "159:39", "speaker": "I", "text": "Gab es zuletzt Abweichungen vom Budget, die besondere Maßnahmen erfordert haben?"}
{"ts": "159:44", "speaker": "E", "text": "Ja, im letzten Quartal lag unser Compute-Budget in der EU-Region um 8 % drüber. Wir haben daraufhin gemäß POL-FIN-007 eine temporäre Quotenreduktion implementiert, dokumentiert in Ticket FIN-3421."}
{"ts": "159:53", "speaker": "I", "text": "Wie wurde das kommuniziert?"}
{"ts": "159:56", "speaker": "E", "text": "Über den wöchentlichen Ops-Call und ein Update im Vesta FinOps Slack-Channel. Wir haben auch die betroffenen Projektleiter informiert, insbesondere solche mit Helios Datalake-Workloads."}
{"ts": "160:04", "speaker": "I", "text": "Stichwort Helios Datalake – gab es da spezielle Abhängigkeiten, die den Forecast beeinflusst haben?"}
{"ts": "160:09", "speaker": "E", "text": "Ja, tatsächlich. Die Batch-Ladejobs für Quasar Billing laufen auf Helios-Infrastruktur. Als wir dort eine neue Kompressionsstufe aktiviert haben, hat sich der Netzwerk-Traffic verändert, was in den Forecast-Algorithmen zunächst falsch gewichtet war."}
{"ts": "160:20", "speaker": "I", "text": "Wie haben Sie das korrigiert?"}
{"ts": "160:23", "speaker": "E", "text": "Wir haben im Forecast-Modell des Vesta-Tools einen zusätzlichen Parameter für Network Egress eingeführt und in RFC-1502 dokumentiert. Seitdem sind die Prognosen näher an den Realwerten."}
{"ts": "160:33", "speaker": "I", "text": "Gab es bei dieser Änderung Risiken im Hinblick auf Performance-SLAs?"}
{"ts": "160:38", "speaker": "E", "text": "Ja, die Kompression spart Kosten, erhöht aber CPU-Load. Wir mussten mit den Helios-Admins abwägen: laut SLA 99,9 % Verfügbarkeit durfte die zusätzliche Belastung nicht zu Latenzspitzen führen. Ein Testlauf unter Last war daher Pflicht."}
{"ts": "160:49", "speaker": "I", "text": "Und das Ergebnis?"}
{"ts": "160:52", "speaker": "E", "text": "Die Tests zeigten maximal 2 % längere Batch-Laufzeiten, was unterhalb des internen Limits von 5 % liegt. Wir haben daher grünes Licht gegeben, dokumentiert im Abschlusskommentar von RFC-1502."}
{"ts": "161:08", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die praktische Umsetzung eingehen – wie binden Sie die Quoten-Alerts konkret in Ihre tägliche Arbeit ein?"}
{"ts": "161:14", "speaker": "E", "text": "Wir haben die Alerts aus dem FinOps-Guardrail-Framework direkt in unser Incident-Board gekoppelt. Das heißt, wenn ein Projekt 80 % seiner monatlichen Budgetquote erreicht, erzeugt das System automatisch ein Ticket im JIRA‑Board mit Label 'COST-ALERT'. Ich prüfe diese Tickets dann gemäß Runbook RB-FIN-042, Schritt 3 bis 5."}
{"ts": "161:26", "speaker": "I", "text": "Und bei diesen Prüfungen – gibt es ein festes Zeitfenster, oder reagieren Sie ad‑hoc?"}
{"ts": "161:31", "speaker": "E", "text": "Festes Zeitfenster: Wir haben in der Policy POL-FIN-007 verankert, dass Alerts innerhalb von vier Arbeitsstunden bewertet werden müssen. Ich habe dafür ein Daily-Slot um 10:00 Uhr, aber wenn ein Alert nach 15:00 Uhr kommt, reagiere ich noch am selben Tag, um Eskalationen zu vermeiden."}
{"ts": "161:44", "speaker": "I", "text": "Wie fließen diese Bewertungen dann wieder in Ihre Forecasts ein?"}
{"ts": "161:50", "speaker": "E", "text": "Wir nutzen die Alert-Daten als Frühwarnindikator. Sobald ich sehe, dass mehrere Projekte gleichzeitig die 80 %-Marke überschreiten, adjustiere ich im Forecast-Modell den Trendfaktor. Das Modell zieht historische Daten aus dem Helios Datalake, kombiniert mit Echtzeit-Billing-Daten aus Quasar Billing. Die Integration läuft über unser internes API-Gateway 'Argus'."}
{"ts": "162:06", "speaker": "I", "text": "Das klingt nach enger Verzahnung – gibt es Herausforderungen an den Schnittstellen?"}
{"ts": "162:11", "speaker": "E", "text": "Ja, zum Beispiel haben wir im letzten Quartal eine Latenz von bis zu 12 Stunden zwischen Helios und Quasar festgestellt. Das hat temporär zu ungenauen Forecasts geführt. Wir haben das als Incident INC-9721 dokumentiert und in RFC-1624 Maßnahmen zur Synchronisationsoptimierung definiert."}
{"ts": "162:25", "speaker": "I", "text": "Gab es bei der Umsetzung von RFC-1624 einen Trade‑off?"}
{"ts": "162:30", "speaker": "E", "text": "Ja, die Optimierung erforderte den Einsatz zusätzlicher Compute‑Ressourcen für ETL-Jobs, was die Kosten leicht erhöht hat. Wir haben das aber akzeptiert, weil die Genauigkeit der Forecasts dadurch um 7 % verbessert wurde und wir so Budgetüberschreitungen früher absehen konnten."}
{"ts": "162:44", "speaker": "I", "text": "Wie dokumentieren Sie diese Entscheidung, um sie später nachvollziehen zu können?"}
{"ts": "162:49", "speaker": "E", "text": "Neben dem RFC-Eintrag haben wir im Runbook RB-FIN-051 einen Abschnitt 'Kosten vs. Genauigkeit' ergänzt. Dort sind die Berechnungen zum Mehraufwand und die Begründung für die Entscheidung hinterlegt, inklusive der Genehmigung durch das Architekturboard."}
{"ts": "163:02", "speaker": "I", "text": "Gab es Bedenken hinsichtlich der Performance-SLAs während dieser Umstellung?"}
{"ts": "163:07", "speaker": "E", "text": "Kurzzeitig, ja. Die zusätzlichen ETL-Läufe haben während des Nachtfensters mehr Bandbreite verbraucht. Wir mussten die SLA‑Parameter für bestimmte Batch‑Jobs temporär anpassen, was wir in Ticket SLA-ADJ-220 dokumentiert und mit den betroffenen Service-Ownern abgestimmt haben."}
{"ts": "163:20", "speaker": "I", "text": "Wie stellen Sie sicher, dass solche Anpassungen nicht zum Standard werden und die Kostendisziplin gefährden?"}
{"ts": "163:25", "speaker": "E", "text": "Wir haben ein Review-Board, das alle temporären SLA-Anpassungen nach 30 Tagen prüft. Falls die Maßnahme noch nötig ist, muss ein neuer RFC eingereicht werden, ansonsten wird sie zurückgenommen. Das hält uns diszipliniert und im Rahmen der Unternehmenswerte 'Safety First' und 'Evidence over Hype'."}
{"ts": "162:28", "speaker": "I", "text": "Könnten wir jetzt noch etwas tiefer auf die letzte Optimierungsinitiative eingehen, die Sie in der Operate-Phase umgesetzt haben? Mich interessiert vor allem, wie die Abnahme dokumentiert wurde."}
{"ts": "162:32", "speaker": "E", "text": "Ja, gern. Wir haben im Q2 einen Reserved-Instance-Swap für die Compute-Knoten durchgeführt. Die Abnahme haben wir in Runbook RB-VES-042 festgehalten, ergänzt um Screenshots aus dem Cost Explorer und die Ticket-Referenz TCK-7741 für die Genehmigung."}
{"ts": "162:38", "speaker": "I", "text": "Und welche Stakeholder mussten da noch involviert werden, bevor Sie den Swap live schalten konnten?"}
{"ts": "162:42", "speaker": "E", "text": "Neben dem FinOps-Team auch die DevOps-Vertreter der Helios Datalake Plattform, weil deren Batch-Jobs teils andere Instance-Typen nutzen. Wir mussten sicherstellen, dass deren Throughput nicht unter die SLA-Marke von 95% fällt."}
{"ts": "162:47", "speaker": "I", "text": "Gab es da messbare Beeinträchtigungen während des Wechsels?"}
{"ts": "162:50", "speaker": "E", "text": "Kurzzeitig, ja – in einem 15-Minuten-Fenster lagen die Response Times 7% über dem Median. Das war im Monitoring-Panel sichtbar und in Ticket TCK-7750 protokolliert. Wir haben das als akzeptabel eingestuft, da es innerhalb der in RFC-1502 definierten Toleranz lag."}
{"ts": "162:56", "speaker": "I", "text": "Sie hatten RFC-1502 schon einmal erwähnt. Können Sie beschreiben, wie diese Vorgaben Ihre Entscheidung hier gesteuert haben?"}
{"ts": "163:00", "speaker": "E", "text": "RFC-1502 legt fest, dass Kostensenkungen nur freigegeben werden, wenn der prognostizierte Performance-Impact unter 10% liegt und die Recovery-Zeit unter 30 Minuten bleibt. Wir haben vorab mit dem Quasar Billing-Team die Lastprofile simuliert, um das zu validieren."}
{"ts": "163:06", "speaker": "I", "text": "Wie fließen solche Simulationen in Ihre Forecast-Modelle für die nächsten Monate ein?"}
{"ts": "163:10", "speaker": "E", "text": "Wir importieren die Simulationsergebnisse als Anpassungsfaktor in unser Prognose-Skript in der Cloud-Analytics-Pipeline. Dadurch werden erwartete Kosteneinsparungen und potenzielle SLA-Risiken automatisch in den Forecast integriert."}
{"ts": "163:15", "speaker": "I", "text": "Interessant. Gab es bei dieser Initiative auch Trade-offs, die Sie bewusst in Kauf genommen haben?"}
{"ts": "163:18", "speaker": "E", "text": "Ja, wir haben eine leicht höhere Komplexität im Capacity-Management akzeptiert. Die Reserved Instances sind nun stärker fragmentiert, was laut RB-VES-042 mehr Koordination mit den Deployment-Teams erfordert."}
{"ts": "163:23", "speaker": "I", "text": "Wie stellen Sie sicher, dass diese gesteigerte Komplexität nicht zu Budgetüberschreitungen führt?"}
{"ts": "163:26", "speaker": "E", "text": "Wir haben in POL-FIN-007 ein neues Unterkapitel ergänzt, das Quoten für fragmentierte Reservierungen definiert. Außerdem erhalten wir wöchentliche Alerts aus dem Budget-Dashboard, wenn die Auslastung unter 80% fällt."}
{"ts": "163:31", "speaker": "I", "text": "Können Sie abschließend sagen, wie Sie aus dieser Initiative Learnings ableiten, die für künftige Optimierungen relevant sind?"}
{"ts": "163:34", "speaker": "E", "text": "Wir führen nach jeder Maßnahme ein Post-Mortem durch, dokumentiert in Confluence und verlinkt zu den entsprechenden Runbooks und Tickets. Die Kernerkenntnis hier war, dass frühe Einbindung der abhängigen Projekte wie Helios und Quasar die Umsetzungszeit um rund 20% verkürzt."}
{"ts": "164:44", "speaker": "I", "text": "Wir hatten zuletzt über die Forecast-Methoden gesprochen. Mich würde jetzt interessieren, wie Sie in der Operate-Phase mit plötzlich auftretenden Kostenanomalien umgehen."}
{"ts": "164:51", "speaker": "E", "text": "Also, wenn wir eine Anomalie sehen, wird zunächst automatisch ein Alert aus dem Guardrail-Modul in unserem FinOps Dashboard ausgelöst. Das triggert dann ein Incident-Ticket, z.B. wie neulich TCK-4821, und wir prüfen sofort, ob es sich um einen Messfehler, eine Lastspitze oder um einen echten Ressourcen-Leak handelt."}
{"ts": "165:00", "speaker": "I", "text": "Und wie priorisieren Sie so ein Ticket, gerade wenn mehrere Projekte wie Helios Datalake gleichzeitig betroffen sein könnten?"}
{"ts": "165:06", "speaker": "E", "text": "Wir nutzen eine Priorisierungs-Matrix aus dem Runbook RB-VES-INC-03: Kritikalität × Auswirkung × SLA-Risiko. Wenn Helios Datalake betroffen ist, erhöhen wir automatisch die Kritikalität um eine Stufe, weil es viele Quasar Billing Abhängigkeiten gibt."}
{"ts": "165:14", "speaker": "I", "text": "Interessant, das klingt nach einem klaren Prozess. Haben Sie ein Beispiel, wo diese Matrix einen Unterschied gemacht hat?"}
{"ts": "165:20", "speaker": "E", "text": "Ja, im März hatten wir eine GCP-Compute-Kostenanomalie. Laut Roh-Daten aus Helios sah es zunächst klein aus, aber Quasar Billing meldete sofort drohende SLA-Verletzungen. Die Matrix stufte das von 'Medium' auf 'High' hoch, was eine schnellere Response auslöste."}
{"ts": "165:29", "speaker": "I", "text": "Wie dokumentieren Sie dann die Lessons Learned aus so einem Vorfall?"}
{"ts": "165:34", "speaker": "E", "text": "Wir fügen einen Abschnitt in das Incident-Post-Mortem ein und verlinken das direkt im Runbook. Außerdem aktualisieren wir die Forecast-Parameter, z.B. die Thresholds in der Anomalie-Erkennung, und markieren die Änderung über ein RFC – in dem Fall war es RFC-1527."}
{"ts": "165:44", "speaker": "I", "text": "Gab es bei RFC-1527 auch Diskussionen zu möglichen Trade-offs?"}
{"ts": "165:48", "speaker": "E", "text": "Ja, die Hauptfrage war: Senken wir den Schwellenwert für Alerts, um schneller zu reagieren, riskieren aber mehr False Positives – oder lassen wir ihn höher und riskieren, dass echte Probleme später erkannt werden. Wir haben uns für eine moderate Senkung entschieden, um die Balance zwischen Reaktionszeit und Alert-Fatigue zu halten."}
{"ts": "165:59", "speaker": "I", "text": "Haben Sie diese Entscheidung mit expliziten Metriken untermauert?"}
{"ts": "166:04", "speaker": "E", "text": "Ja, wir haben historische Daten aus den letzten sechs Monaten analysiert. Die Simulation zeigte, dass die neue Einstellung die Erkennungszeit um ca. 18 % verbessert, während die False Positive Rate nur um 6 % ansteigt. Diese Kennzahlen sind im Anhang von RFC-1527 dokumentiert."}
{"ts": "166:14", "speaker": "I", "text": "Wie wirkt sich das auf die SLA-Erfüllung aus, insbesondere bei Performance-Kriterien?"}
{"ts": "166:19", "speaker": "E", "text": "Wir haben in den letzten zwei Quartalen keinen SLA-Breach bei Performance erlebt, seit wir diese Anpassung eingeführt haben. Das Monitoring-Team meldet sogar stabilere Latenzen, weil wir Leaks in Compute-Pools schneller beheben."}
{"ts": "166:27", "speaker": "I", "text": "Wie schulen Sie neue Teammitglieder, damit sie diese Prozesse verstehen und anwenden können?"}
{"ts": "166:32", "speaker": "E", "text": "Neue Kolleg:innen bekommen ein Onboarding-Kit, das u.a. das Runbook RB-VES-INC-03, die POL-FIN-007 Policy und Fallstudien wie den März-Vorfall enthält. Zusätzlich gibt es Shadowing-Sessions, in denen sie live an Anomalie-Analysen teilnehmen."}
{"ts": "172:44", "speaker": "I", "text": "Wir hatten vorhin schon die Abhängigkeiten zu Helios Datalake und Quasar Billing angesprochen. Können Sie ein Beispiel nennen, wo beide Systeme zusammenwirken mussten, um eine Budgetabweichung zu erklären?"}
{"ts": "172:56", "speaker": "E", "text": "Ja, das war im März-Reporting. Da zeigte das Quasar Billing Dashboard einen Anstieg von 8 % in den Compute-Kosten. Helios Datalake hat uns dann durch die Job-Logs gezeigt, dass ein Batch-Workflow doppelt gelaufen ist, weil ein Retry-Skript nicht auf den Exit-Code geprüft hat."}
{"ts": "173:18", "speaker": "I", "text": "Und wie sind Sie da vorgegangen, um das Problem einzugrenzen und die Kosten zu korrigieren?"}
{"ts": "173:27", "speaker": "E", "text": "Zuerst haben wir in Runbook RBK-OPS-044 die Schritte zur Incident-Analyse befolgt, um die Ursache zu bestätigen. Anschließend haben wir ein Ticket in JIRA angelegt, COST-2217, mit Verweis auf die Logdaten und die fehlerhafte Retry-Logik."}
{"ts": "173:48", "speaker": "I", "text": "Gab es dabei auch eine Policy-Überprüfung gegen POL-FIN-007?"}
{"ts": "173:54", "speaker": "E", "text": "Ja, unter Abschnitt 4.2 der Policy steht, dass Wiederholungsjobs mit Cost Cap versehen sein müssen. Das war hier nicht implementiert, daher haben wir einen RFC eingereicht, RFC-1620, um den Cap in den Workflow zu integrieren."}
{"ts": "174:16", "speaker": "I", "text": "Hat diese Änderung dann messbare Effekte gezeigt?"}
{"ts": "174:22", "speaker": "E", "text": "Definitiv. Im April fiel der Compute-Kostenanteil um 5 %, und wir konnten im Quasar Dashboard die Einsparung pro Job-Lauf sehen. Die Forecasts aus Helios wurden entsprechend angepasst."}
{"ts": "174:38", "speaker": "I", "text": "Gab es bei dieser Anpassung irgendwelche Trade-offs in Bezug auf Performance-SLAs?"}
{"ts": "174:46", "speaker": "E", "text": "Minimal. Wir mussten einen zusätzlichen Check einbauen, der 30 Sekunden pro Job kostet, aber unsere SLA erlaubt bis zu 2 Minuten Verzögerung pro Batch. Das haben wir im SLA-Dokument VES-SLA-2023-07 festgehalten."}
{"ts": "175:05", "speaker": "I", "text": "Wie wird so ein SLA-Update intern kommuniziert?"}
{"ts": "175:11", "speaker": "E", "text": "Über den wöchentlichen FinOps-Newsletter und das Confluence-Board 'VES Service Agreements'. Außerdem gibt es ein Kurzbriefing im Teams-Channel #vesta-finops, wo wir die Runbook-Änderungen anpinnen."}
{"ts": "175:29", "speaker": "I", "text": "Hatten Sie Bedenken, dass durch diese zusätzlichen Checks bei höherer Last Probleme entstehen könnten?"}
{"ts": "175:38", "speaker": "E", "text": "Ja, deshalb haben wir vorab einen Stresstest mit den Helios-Simulationsdaten gefahren. Das steht in Testprotokoll TP-HEL-059. Ergebnis: selbst bei 150 % Last blieb die Verzögerung unter 90 Sekunden."}
{"ts": "175:56", "speaker": "I", "text": "Könnten Sie abschließend noch einmal die Lessons Learned aus diesem Fall nennen?"}
{"ts": "176:02", "speaker": "E", "text": "Klar: Erstens, Retry-Logik immer gegen Policy prüfen; zweitens, Quasar-Daten mit Helios-Logs korrelieren; drittens, Runbook- und SLA-Updates zeitnah kommunizieren. Und viertens, Simulationen vor Rollout durchführen, um Performance-Risiken früh zu erkennen."}
{"ts": "180:04", "speaker": "I", "text": "Könnten Sie bitte ein aktuelles Beispiel aus der letzten Woche beschreiben, bei dem Sie eine Budgetabweichung erkannt und adressiert haben?"}
{"ts": "180:15", "speaker": "E", "text": "Ja, ähm, am Montag haben wir im Quasar Billing Dashboard gesehen, dass das Compute-Budget für die Analytics-Cluster um 12 % über dem Monats-Soll lag. Laut POL-FIN-007 mussten wir sofort das Incident-Ticket FIN-INC-2218 eröffnen und den Runbook-Schritt RB-FIN-04 'Budget Alert Triage' anwenden."}
{"ts": "180:38", "speaker": "I", "text": "Und wie lief dieser Triage-Prozess konkret ab?"}
{"ts": "180:50", "speaker": "E", "text": "Wir haben zunächst im Helios Datalake die Raw Usage Tables gegen die letzten drei Wochen verglichen, um zu sehen, ob es ein saisonales Muster war. Dann, gemäß RB-FIN-04 Schritt 3, ein temporäres Quota-Limit in der Cloud-Konsole gesetzt und dem verantwortlichen Team per Slack-Alert informiert."}
{"ts": "181:15", "speaker": "I", "text": "Gab es dabei irgendwelche Konflikte mit laufenden SLAs?"}
{"ts": "181:27", "speaker": "E", "text": "Ja, minimal. Ein Batch-Job im Data Science Team lief etwas länger, was gegen den internen SLA-Parameter 'Batch Completion ≤ 2h' verstoßen hat. Wir haben das als Low-Severity im Ticket markiert und für den Folgemonat eine Kapazitätsanpassung in RFC-1587 beantragt."}
{"ts": "181:53", "speaker": "I", "text": "Sie erwähnen RFC-1587 – können Sie erläutern, wie dieser mit früheren Optimierungsinitiativen verknüpft ist?"}
{"ts": "182:08", "speaker": "E", "text": "Klar, RFC-1587 baut auf der Maßnahme aus RFC-1502 auf, wo wir die Instanz-Typen für das Streaming angepasst haben. In 1587 geht es nun um eine dynamische Skalierung der Cluster basierend auf Forecast-Daten aus Helios, um Kosten und Performance simultan zu optimieren."}
{"ts": "182:32", "speaker": "I", "text": "Wie stellen Sie bei solchen dynamischen Anpassungen sicher, dass die Forecasts auch wirklich belastbar sind?"}
{"ts": "182:45", "speaker": "E", "text": "Wir fahren Cross-Validation: die Helios-Datalake-Prognosen werden gegen die Quasar-Billing-Historie gematcht. Außerdem nutzen wir Anomaly Detection Scripts aus Runbook RB-FIN-09, um Ausreißer früh zu erkennen. Ohne diese Checks riskieren wir Overprovisioning oder SLA-Verletzungen."}
{"ts": "183:12", "speaker": "I", "text": "Gab es schon Fälle, wo diese Anomaly Detection falschen Alarm ausgelöst hat?"}
{"ts": "183:24", "speaker": "E", "text": "Ja, zweimal im letzten Quartal. Einmal, weil ein neues Service-Deployment im Projekt Orion kurzfristig Traffic erzeugt hat, das nicht im Forecast-Modell war. Wir haben daraus gelernt, in den Runbooks einen Pre-Deployment-Check gegen Vesta-Forecasts einzuführen."}
{"ts": "183:50", "speaker": "I", "text": "Wie dokumentieren Sie solche Lessons Learned?"}
{"ts": "184:02", "speaker": "E", "text": "Einerseits direkt im Confluence-Space 'Vesta Ops', unter der Sektion 'Post-Incident Reviews'. Andererseits fließt es als Update ins entsprechende Runbook und wird im wöchentlichen FinOps Sync-Call präsentiert."}
{"ts": "184:23", "speaker": "I", "text": "Wenn Sie auf die letzten drei Monate blicken: Welcher Trade-off war für Sie am schwierigsten?"}
{"ts": "184:36", "speaker": "E", "text": "Ganz klar der im März, wo wir 15 % Kosten sparen konnten, indem wir Non-Prod nachts abschalten. Aber ein Dev-Team hat sich über längere Startzeiten am Morgen beschwert. Wir haben nach Abwägung beschlossen, dieses Vorgehen beizubehalten und im SLA für Non-Prod die 'Ready Time' von 5 auf 15 Minuten zu erweitern, Ticket SLA-ADJ-904 dokumentiert."}
{"ts": "186:04", "speaker": "I", "text": "Lassen Sie uns noch einmal auf den Punkt der Performance-SLAs zurückkommen – wie stellen Sie im laufenden Betrieb sicher, dass Optimierungen nicht zu SLA-Verletzungen führen?"}
{"ts": "186:22", "speaker": "E", "text": "Wir haben dafür im Runbook RB-OPS-421 einen Prüfpfad definiert: Jeder Änderungsvorschlag aus einer Optimierungsinitiative muss vor Umsetzung durch das SLA-Monitoring-Team in Helios simuliert werden. Falls die Simulation eine Latenzsteigerung über 5 % anzeigt, wird ein Performance-Ausnahme-Ticket (PEX) erstellt, das in Jira-Board 'FinOps-Ops' landet."}
{"ts": "186:49", "speaker": "I", "text": "Und wie oft kommt es vor, dass so ein PEX-Ticket tatsächlich blockiert?"}
{"ts": "187:02", "speaker": "E", "text": "Ehrlich gesagt nur in etwa 8 % der Fälle. Wir haben daraus gelernt, dass viele Optimierungen, etwa Instanz-Right-Sizing, kaum negative Auswirkungen haben, während aggressive Reserved Instance Reductions in Hochlastzeiten riskanter sind."}
{"ts": "187:25", "speaker": "I", "text": "Können Sie ein Beispiel nennen, bei dem eine solche Blockade sinnvoll war?"}
{"ts": "187:38", "speaker": "E", "text": "Ja, im Ticket FIN-PEX-772 haben wir den Wechsel von m5.4xlarge auf m5.2xlarge in einem kritischen Reporting-Cluster gestoppt, weil die Simulation im Helios Datalake zeigte, dass die Query-Laufzeiten in Quasar Billing um 18 % steigen würden. Das hätte das Monatsabschluss-SLA von T+2 Tagen gefährdet."}
{"ts": "188:05", "speaker": "I", "text": "Wie dokumentieren Sie solche abgelehnten Maßnahmen?"}
{"ts": "188:16", "speaker": "E", "text": "Wir führen ein 'Rejected Optimization Log' in Confluence, verlinkt mit den zugehörigen PEX-Tickets und der jeweiligen Forecast-Version. Das ist wichtig, um später nachvollziehen zu können, warum wir bestimmte Einsparpotenziale nicht realisiert haben."}
{"ts": "188:39", "speaker": "I", "text": "Verwenden Sie diese Logs auch für Lessons Learned Sessions?"}
{"ts": "188:48", "speaker": "E", "text": "Absolut. Einmal im Quartal haben wir das sogenannte 'FinOps Retro', bei dem wir drei solcher Fälle analysieren. Ziel ist, Muster zu erkennen – z. B. welche Services besonders SLA-sensitiv sind – und diese im Runbook als Vorfilter zu hinterlegen."}
{"ts": "189:12", "speaker": "I", "text": "Gab es schon Anpassungen an POL-FIN-007 auf Basis solcher Erkenntnisse?"}
{"ts": "189:23", "speaker": "E", "text": "Ja, im RFC-1620 haben wir die Policy so erweitert, dass bei Workloads mit 'critical SLA' die Budgetabweichung bis zu 7 % toleriert wird, bevor automatisierte Optimierungen greifen. Das wurde vom FinOps Steering Committee genehmigt."}
{"ts": "189:49", "speaker": "I", "text": "Wie prüfen Sie im Forecast-Prozess, ob diese 7 %-Toleranz nicht ausgereizt wird?"}
{"ts": "190:02", "speaker": "E", "text": "Wir haben im Quasar Dashboard ein Flag, das bei 5 % Abweichung eine Warnung ausgibt. Zusätzlich läuft ein wöchentlicher Helios-Report, der die Top-10 Workloads mit SLA-Tag markiert und ihre Kostenentwicklung zeigt."}
{"ts": "190:24", "speaker": "I", "text": "Welche Risiken sehen Sie, wenn diese Toleranzgrenze häufiger überschritten wird?"}
{"ts": "190:40", "speaker": "E", "text": "Das Hauptrisiko ist, dass sich ein 'Kostenpolster' einschleicht und wir die Effizienzdisziplin verlieren. Langfristig könnten dann neue Projekte, etwa ein geplanter Data Mesh für Vesta, unterfinanziert bleiben, weil bestehende kritische Workloads zu viel Budget beanspruchen."}
{"ts": "195:44", "speaker": "I", "text": "Lassen Sie uns nun noch einmal konkret auf die im letzten Quartal identifizierten Kostensenkungspotenziale eingehen."}
{"ts": "195:51", "speaker": "E", "text": "Ja, im Q2 hatten wir zwei große Hebel: Zum einen die Umstellung von persistenter Storage-Klasse SC-3 auf SC-2 in unserer Testumgebung, was laut Runbook RNB-OPT-042 bis zu 18 % Einsparung bringt."}
{"ts": "196:02", "speaker": "E", "text": "Zum anderen haben wir mit den DevOps-Teams abgestimmt, dass nicht kritische Batch-Jobs in Low-Priority-VMs laufen, was die Compute-Kosten um rund 12 % gesenkt hat."}
{"ts": "196:15", "speaker": "I", "text": "Wie haben Sie den ROI dieser Maßnahmen berechnet?"}
{"ts": "196:20", "speaker": "E", "text": "Wir haben die Einsparungen aus den Quasar Billing Reports direkt den einmaligen Migrationskosten gegenübergestellt, dokumentiert in Ticket FINOPS-334."}
{"ts": "196:32", "speaker": "E", "text": "Der ROI lag bei der Storage-Änderung bei etwa 3,5 Monaten Amortisationszeit, die Compute-Anpassung war nach 6 Wochen 'break-even'."}
{"ts": "196:44", "speaker": "I", "text": "Gab es dabei Konflikte mit Performance-SLAs?"}
{"ts": "196:49", "speaker": "E", "text": "Bei SC-2 gab es anfänglich längere Latenzen im CI/CD-Pipeline-Testlauf. Wir haben gemäß RFC-1502 eine temporäre Ausnahme für kritische Builds definiert."}
