{"ts": "00:00", "speaker": "I", "text": "Können Sie mir bitte den aktuellen Stand der Hera QA Platform im Build-Phase-Status schildern? Es geht mir um einen präzisen Überblick, nicht nur grobe Eindrücke."}
{"ts": "05:35", "speaker": "E", "text": "Ja, natürlich. Wir sind aktuell bei Build-Phase Sprint 8 von 12. Der Core-Orchestrator ist funktionsfähig, die Flaky-Test-Analytics-Engine läuft im internen Staging-Cluster. Wir haben bereits POL-SEC-011 zu Datenmaskierung umgesetzt, sodass keine sensiblen Produktionsdaten in die Tests gelangen. Das ist einer der Kernpunkte der Sicherheitsrelevanz, die aus den Unternehmensrichtlinien zwingend sind."}
{"ts": "11:10", "speaker": "I", "text": "Welche weiteren sicherheitsrelevanten Anforderungen aus den Richtlinien sind bereits berücksichtigt?"}
{"ts": "16:30", "speaker": "E", "text": "Neben der Datenmaskierung haben wir für alle Test-APIs eine TLS 1.3-Verbindung verpflichtend gemacht, konform zu POL-NET-004. Außerdem setzen wir in der Hera QA Platform rollenbasierte Zugriffskontrollen um, die direkt mit dem Aegis IAM synchronisiert werden. Das erfüllt die Mindeststandards aus SEC-RBAC-002."}
{"ts": "21:45", "speaker": "I", "text": "Wie stellen Sie sicher, dass Testdaten keine sensiblen Informationen enthalten?"}
{"ts": "27:00", "speaker": "E", "text": "Wir nutzen ein zweistufiges Verfahren: Vor der Einspeisung werden Daten durch den Masking-Service anonymisiert. Zusätzlich prüft ein Audit-Skript nach Runbook RB-QA-017 stichprobenartig die Datensätze auf PII-Muster. Wenn Anomalien gefunden werden, wird der Build blockiert und ein Incident-Ticket im JIRA-Board 'HER-QA-SAFE' erstellt."}
{"ts": "32:20", "speaker": "I", "text": "Welche Schnittstellen bestehen aktuell zwischen Hera QA Platform und Helios Datalake?"}
{"ts": "37:45", "speaker": "E", "text": "Wir haben eine bidirektionale REST-Integration. Hera sendet Metriken zu Testausführungen an den Helios Datalake, der dann historische Trends zurückliefert. Diese Integration nutzt das interne API-Gateway, abgesichert mit Aegis IAM Tokens. Wichtig: Die Tokens haben bewusst nur Lesezugriff auf die relevanten Datalake-Views, um Missbrauch zu verhindern."}
{"ts": "43:10", "speaker": "I", "text": "Und wie wird die Authentifizierung über Aegis IAM in den Testabläufen gehandhabt?"}
{"ts": "48:30", "speaker": "E", "text": "In jedem Test-Run wird zunächst ein Service-Account-Token angefordert, basierend auf dem Policy-Set 'QA-EXEC'. Dieses Token erlaubt Zugriff auf Mock-Services und bestimmte Helios-Endpoints. Ablauf und Erneuerung sind in RB-AUT-009 dokumentiert. Wir testen die Token-Expiry-Handling-Logik in jeder dritten Nightly-Build-Session."}
{"ts": "54:00", "speaker": "I", "text": "Gibt es Abhängigkeiten, die das Risiko von Sicherheitslücken erhöhen könnten?"}
{"ts": "59:25", "speaker": "E", "text": "Ja, eine erkennbare Abhängigkeit ist, dass Helios Datalake derzeit noch eine ältere Version der Auth-Library nutzt. Wenn diese nicht vor Go-Live aktualisiert wird, könnten wir anfälliger für Replay-Angriffe sein. Wir haben das als Risiko R-HER-SEC-004 in der Risk-Register-Tabelle vermerkt und einen Blocker für Sprint 10 gesetzt."}
{"ts": "65:00", "speaker": "I", "text": "Welche Risikokategorien haben Sie für die Testplanung definiert, gerade im Hinblick auf POL-QA-014?"}
{"ts": "70:15", "speaker": "E", "text": "Wir unterscheiden Performance-Risiken, Security-Risiken und Compliance-Risiken. POL-QA-014 schreibt vor, dass kritische Pfade mit mindestens 95%iger Testabdeckung vor UAT erreicht sein müssen. Deshalb priorisieren wir Risk-Based Testing für die Schnittstellen zu Helios und die RBAC-Checks über Aegis IAM."}
{"ts": "76:00", "speaker": "I", "text": "Gab es Trade-offs zwischen Testabdeckung und Time-to-Market, und wie wurden diese begründet?"}
{"ts": "90:00", "speaker": "E", "text": "Ja, wir haben im Architekturentscheidungsprotokoll ADR-HER-007 festgehalten, dass wir bei nicht sicherheitskritischen Komponenten die Abdeckung von 92% auf 85% reduzieren, um Feature-Freeze pünktlich zu erreichen. Ticket HER-QA-321 dokumentiert die Risikoabwägung: Die eingesparten zwei Wochen wurden für zusätzliche Security-Tests auf den kritischen Pfaden genutzt, wie in Runbook RB-SEC-021 spezifiziert."}
{"ts": "90:00", "speaker": "I", "text": "Kommen wir noch einmal zu den Entscheidungen in der Build-Phase – können Sie bitte ein Beispiel nennen, wo Sie zwischen Sicherheit und Performance abwägen mussten?"}
{"ts": "90:08", "speaker": "E", "text": "Ja, sicher. Wir hatten beim Integrationstest der Streaming-Schnittstelle zum Helios Datalake die Wahl: Entweder wir aktivieren vollständige TLS v1.3-Verschlüsselung auch intern, was Latenzen von +120 ms pro Call bedeutete, oder wir nutzen internes mTLS nur auf den kritischen Pfaden. Wir haben uns für Letzteres entschieden, dokumentiert in Runbook RB-HER-SEC-03."}
{"ts": "90:25", "speaker": "I", "text": "Und wie haben Sie diese Entscheidung gegenüber den Compliance-Anforderungen gerechtfertigt?"}
{"ts": "90:32", "speaker": "E", "text": "Durch eine Risikoanalyse gemäß POL-QA-014, Abschnitt 5.2. Wir haben dort die interne Bedrohungsmodellierung angeführt, die belegt, dass die nicht abgesicherten Pfade nur simulierte Testdaten enthalten. Das Audit-Artefakt ist in Ticket HER-QA-778 hinterlegt."}
{"ts": "90:50", "speaker": "I", "text": "Gab es auch Kompromisse bei der Testabdeckung wegen der Time-to-Market-Vorgaben?"}
{"ts": "90:57", "speaker": "E", "text": "Ja, wir mussten die vollständige Cross-Browser-UI-Testmatrix verschieben. Statt 16 Browser/OS-Kombis haben wir zuerst die Top 5 umgesetzt, basierend auf Nutzungsstatistiken aus Helios Analytics. Der Rest ist als Post-Release-Backlog in HER-QA-Backlog#214 dokumentiert."}
{"ts": "91:15", "speaker": "I", "text": "Wie wurde sichergestellt, dass diese Reduktion keine kritischen Regressionen übersehen lässt?"}
{"ts": "91:22", "speaker": "E", "text": "Wir haben Risk-Based Testing angewandt: die kritischen Workflow-Pfade – wie Authentifizierung via Aegis IAM und das Speichern in den Helios Datalake – wurden immer auf allen fünf ausgewählten Kombis getestet. Fehlertolerante Teile, wie die UI-Theme-Funktion, wurden zurückgestellt."}
{"ts": "91:40", "speaker": "I", "text": "Gab es dabei Diskussionen im Team?"}
{"ts": "91:45", "speaker": "E", "text": "Ja, das Frontend-Team hat auf vollständige Abdeckung gedrängt. Wir haben in einer Entscheidungs-Review-Session (Protokoll HER-DEC-05) festgehalten, dass die Markteinführung Vorrang hat, aber mit dem Risiko, dass in seltenen Kombinationen UI-Fehler auftreten könnten."}
{"ts": "92:05", "speaker": "I", "text": "Wie gehen Sie mit diesen dokumentierten Risiken um, falls sie nach dem Go-Live auftreten?"}
{"ts": "92:12", "speaker": "E", "text": "Wir haben einen Hotfix-Runbook-Pfad RB-HER-HF-01 definiert, der innerhalb von 48h reagiert, inklusive SLA-Check mit den betroffenen Kunden. Außerdem gibt es eine vereinbarte SLO-Ausnahme im Vertrag, Ticket HER-COM-112."}
{"ts": "92:30", "speaker": "I", "text": "Wie wurde das Team auf diese Runbooks geschult?"}
{"ts": "92:35", "speaker": "E", "text": "Über zwei Simulationen im Staging-Cluster. Die Teilnehmer mussten einen simulierten IAM-Ausfall während eines Regressionstests beheben. Die Lessons Learned wurden im internen Wiki unter HER-WIKI-TRAIN-07 veröffentlicht."}
{"ts": "92:53", "speaker": "I", "text": "Abschließend: Gibt es eine Entscheidung, die Sie im Nachhinein anders treffen würden?"}
{"ts": "93:00", "speaker": "E", "text": "Vielleicht hätten wir die mTLS-Implementierung auch auf die nicht-kritischen Pfade ausrollen sollen, um spätere Diskussionen mit dem Security-Audit zu vermeiden. Das hätte aber die Build-Phase um etwa drei Wochen verlängert – und das war unter den gegebenen Deadlines kaum vertretbar."}
{"ts": "98:00", "speaker": "I", "text": "Sie hatten vorhin die Anpassung des Testfall-Mappers erwähnt. Können Sie genauer erläutern, warum das in der Build-Phase so kritisch war?"}
{"ts": "98:08", "speaker": "E", "text": "Ja, der Mapper ist das Bindeglied zwischen den orchestrierten Tests und den Metadaten im Helios Datalake. Ohne die Optimierung hätten wir bei komplexen Regression-Suites bis zu 20 % mehr Latenz gehabt, was die SLA-Vorgaben von maximal 15 Minuten Ausführungszeit pro Batch gefährdet hätte."}
{"ts": "98:22", "speaker": "I", "text": "Gab es für diese Optimierung ein formales Change Request oder lief das ad hoc?"}
{"ts": "98:27", "speaker": "E", "text": "Das lief über das RFC-Board, Ticket HER-RFC-1027. Wir haben die Änderung in Runbook QA-RB-09 dokumentiert, inklusive Rollback-Plan, falls der neue Mapper fehlerhaft mit dem Aegis IAM Token-Refresh interagiert."}
{"ts": "98:40", "speaker": "I", "text": "Wie haben Sie die Interaktion mit Aegis IAM konkret abgesichert?"}
{"ts": "98:46", "speaker": "E", "text": "Wir haben eine zusätzliche Pre-Test-Hook eingebaut, die den Token-Status prüft und bei Bedarf einen Refresh per Service-Account anstößt. Das basiert auf der Policy QAP-SEC-07, die ununterbrochene Authentifizierung für kritische Testpfade fordert."}
{"ts": "98:59", "speaker": "I", "text": "Gab es Nebenwirkungen auf andere Subsysteme?"}
{"ts": "99:04", "speaker": "E", "text": "Ja, im ersten Dry-Run hat der Token-Refresh eine Race Condition mit der Testdaten-Bereitstellung ausgelöst. Das war im Zusammenspiel mit dem anonymisierten Datenset-Loader aus Helios. Wir mussten den Loader um einen Retry-Mechanismus erweitern, siehe HER-BUG-2213."}
{"ts": "99:18", "speaker": "I", "text": "Und wie wurde das risikoseitig bewertet?"}
{"ts": "99:22", "speaker": "E", "text": "Nach POL-QA-014 haben wir es als mittleres Risiko eingestuft, Kategorie 'Subsystem-Interferenz'. Durch den Retry-Mechanismus sank die Ausfallwahrscheinlichkeit unter 2 %, was innerhalb unseres akzeptablen Toleranzbereichs liegt."}
{"ts": "99:35", "speaker": "I", "text": "War das ein Kompromiss zulasten der Time-to-Market?"}
{"ts": "99:40", "speaker": "E", "text": "Minimal. Wir haben zwei Sprints zusätzlich eingeplant, um die Stabilität sicherzustellen. Das Management hat zugestimmt, da die Abdeckung kritischer Pfade dadurch um 15 % verbessert wurde. Dieser Trade-off ist im Steering-Meeting-Protokoll vom 12.03. dokumentiert."}
{"ts": "99:54", "speaker": "I", "text": "Gab es Lessons Learned, die Sie schon ins nächste Projekt übertragen konnten?"}
{"ts": "100:00", "speaker": "E", "text": "Ja, wir haben in Runbook QA-RB-Template künftig einen Pflichtabschnitt 'Cross-System Test Impact' eingeführt. Damit wird vor Änderungen explizit geprüft, welche Services über Schnittstellen betroffen sein könnten."}
{"ts": "100:12", "speaker": "I", "text": "Zum Abschluss: Wie wird sichergestellt, dass diese Dokumentation auch in einem Audit in zwei Jahren noch auffindbar ist?"}
{"ts": "100:20", "speaker": "E", "text": "Alle Runbooks und RFCs werden im Conformity-Archiv von Novereon Systems versioniert und mit Metadaten nach COM-RET-02 versehen. Außerdem gibt es monatliche Checks, ob die Links zu Helios- und Aegis-Artefakten noch gültig sind."}
{"ts": "114:00", "speaker": "I", "text": "Sie hatten vorhin angedeutet, dass es in der Build-Phase einige kritische Architekturentscheidungen gab. Können Sie ein Beispiel aus den letzten zwei Wochen nennen?"}
{"ts": "114:05", "speaker": "E", "text": "Ja, gern. Wir haben uns entschieden, den Testorchestrator von einer monolithischen Scheduling-Logik auf ein ereignisbasiertes Event-Bus-Modell umzustellen. Das war in Ticket QA-ARCH-217 dokumentiert und basierte auf einer Empfehlung aus Runbook RB-HER-DEP-03."}
{"ts": "114:12", "speaker": "I", "text": "Welche Abwägungen spielten da eine Rolle? War das nicht mit zusätzlicher Komplexität verbunden?"}
{"ts": "114:18", "speaker": "E", "text": "Absolut, die Komplexität steigt, weil wir nun mehr asynchrone Pfade debuggen müssen. Gleichzeitig können wir damit aber Testläufe parallelisieren und Engpässe in der Helios Datalake-Ingestion vermeiden."}
{"ts": "114:26", "speaker": "I", "text": "Das heißt, die Anbindung an Helios Datalake war ein wesentlicher Treiber?"}
{"ts": "114:31", "speaker": "E", "text": "Ja, wir mussten sicherstellen, dass große Mengen Test-Metadaten ohne Verzögerung übertragen werden. Der Event-Bus triggert nur dann ein Insert in Helios, wenn Aegis IAM bereits einen gültigen Auth-Token bestätigt hat."}
{"ts": "114:40", "speaker": "I", "text": "Gab es hier Zwischenfälle, also Security- oder Performance-Vorfälle?"}
{"ts": "114:44", "speaker": "E", "text": "Einmal, ja. Im Testbetrieb gab es einen Token-Expiry mitten im Batch-Import. Das haben wir in Incident INC-HER-081 dokumentiert und in Runbook RB-AEG-HAND-02 ergänzt, um einen automatischen Token-Renewal-Workflow einzubauen."}
{"ts": "114:53", "speaker": "I", "text": "Wie stellen Sie unter POL-QA-014 sicher, dass solche Änderungen rückverfolgbar bleiben?"}
{"ts": "114:58", "speaker": "E", "text": "Wir pflegen eine Traceability-Matrix in ConTest, die jedes Architektur-Ticket mit den betroffenen Testfällen und Defekt-IDs verknüpft. Für den Token-Workflow haben wir etwa Defekt DEF-HER-552 und Testfall TC-HER-SEC-09 gelinkt."}
{"ts": "115:07", "speaker": "I", "text": "Und wie sieht es mit SLA/SLO-Überwachung in diesem neuen Setup aus?"}
{"ts": "115:12", "speaker": "E", "text": "Wir haben ein Prometheus-Dashboard, das die Event-Verarbeitungszeiten loggt. Für kritische Pfade gilt ein SLO von maximal 200 ms pro Event. SLA-Reports werden monatlich archiviert unter Audit-Paket AUD-HER-2024-05."}
{"ts": "115:21", "speaker": "I", "text": "Gab es Trade-offs zwischen Testabdeckung und Time-to-Market?"}
{"ts": "115:26", "speaker": "E", "text": "Ja, wir haben Low-Priority-Tests für selten genutzte API-Endpunkte in einen späteren Sprint verschoben, um das Release-Fenster Q3 zu halten. Das ist in Release-Dokument RD-HER-BLD-07 und im Risk-Register RSK-HER-332 vermerkt."}
{"ts": "115:36", "speaker": "I", "text": "Wie bewerten Sie dieses Risiko im Rückblick?"}
{"ts": "115:40", "speaker": "E", "text": "Es ist kalkuliert. Wir haben für diese Endpunkte eine Canary-Testing-Strategie im Live-System vorbereitet, um bei Auffälligkeiten sofort mit dem Rollback aus Runbook RB-HER-ROL-01 reagieren zu können."}
{"ts": "116:00", "speaker": "I", "text": "Könnten Sie bitte noch einmal genauer erklären, wie die Audit-Artefakte für spätere Überprüfungen vorbereitet werden? Ich möchte die Prozesskette verstehen."}
{"ts": "116:10", "speaker": "E", "text": "Ja, sicher. Wir generieren nach jedem Build einen sogenannten QA-Compliance-Report, der automatisch aus dem Orchestrator exportiert wird. Darin sind Testabdeckung, Defekttrend und SLA-Verletzungen aufgeführt. Die Artefakte werden in unserem internen Audit-Archiv unter 'HERA-AUD-20xx' versioniert abgelegt."}
{"ts": "116:34", "speaker": "I", "text": "Und diese Reports, enthalten die auch Bezüge zu den Runbooks, die Sie vorhin erwähnt haben?"}
{"ts": "116:42", "speaker": "E", "text": "Ja, jeder Report referenziert die Runbook-IDs, z. B. RB-HER-042 für das Security-Sanitizing der Testdaten und RB-HER-055 für das Risk-Based Testing nach POL-QA-014. Das erleichtert den Auditoren den Abgleich zwischen dokumentierten Verfahren und tatsächlicher Umsetzung."}
{"ts": "117:03", "speaker": "I", "text": "Verstehe. Gab es in letzter Zeit Abweichungen von den definierten Qualitätszielen, die dokumentiert werden mussten?"}
{"ts": "117:11", "speaker": "E", "text": "Ein Fall war im Build 2024.05.14, wo die Testabdeckung für kritische Pfade nur bei 87 % lag statt der geplanten 95 %. Das wurde als NCR-HER-087 im Abweichungsregister erfasst, mit einer Korrekturmaßnahme im Sprint danach."}
{"ts": "117:33", "speaker": "I", "text": "Und wie wurde diese Abweichung begründet?"}
{"ts": "117:40", "speaker": "E", "text": "Die Ursache lag in einer verspäteten Schnittstellenänderung seitens Helios Datalake, die drei kritische Testfälle invalidierte. Wir haben daraufhin ein temporäres Mocking nach Runbook RB-HER-033 eingesetzt, um die Lücke schnell zu schließen."}
{"ts": "118:02", "speaker": "I", "text": "Das klingt nach einem typischen Fall von externen Abhängigkeiten. Gab es dabei ein erhöhtes Risiko für Sicherheitslücken?"}
{"ts": "118:10", "speaker": "E", "text": "Potentiell ja, denn das Mocking deckt nicht alle Authentifizierungs-Flows aus Aegis IAM ab. Deshalb haben wir die Security-Tests priorisiert und einen zusätzlichen Review durch das IAM-Team angefordert, Ticket SEC-REQ-219."}
{"ts": "118:31", "speaker": "I", "text": "Wie schnell konnten Sie auf dieses Risiko reagieren?"}
{"ts": "118:38", "speaker": "E", "text": "Innerhalb von 48 Stunden. Unser Incident-Runbook RB-HER-099 schreibt vor, dass Sicherheitsrisiken mit CVSS-Score >7 sofort in den Hotfix-Branch integriert werden, auch in der Build-Phase."}
{"ts": "118:57", "speaker": "I", "text": "Gab es in diesem Kontext auch eine Diskussion über den Trade-off zwischen Testtiefe und dem Release-Termin?"}
{"ts": "119:05", "speaker": "E", "text": "Ja, wir haben im Steering Committee bewusst entschieden, die Regression Suite um 15 % zu kürzen, um den Termin zu halten. Das wurde in Ticket DEC-HER-2024-15 dokumentiert und mit dem Verweis auf akzeptables Restrisiko laut Risk Matrix RSK-HER-07 begründet."}
{"ts": "119:27", "speaker": "I", "text": "Wurde diese Entscheidung im Nachhinein als richtig bewertet?"}
{"ts": "119:34", "speaker": "E", "text": "Bisher ja, da keine kritischen Defekte in Produktion aufgetreten sind. Wir haben jedoch als Lesson Learned festgehalten, dass bei ähnlichen Kürzungen ein erweitertes Monitoring in den ersten 14 Tagen nach Release aktiviert werden sollte."}
{"ts": "132:00", "speaker": "I", "text": "Sie hatten vorhin angesprochen, dass die Integration mit Aegis IAM stabil läuft. Mich interessiert jetzt: Wie stellen Sie sicher, dass bei einem Ausfall von Aegis IAM die Testpipelines der Hera QA Platform trotzdem weiterlaufen?"}
{"ts": "132:15", "speaker": "E", "text": "Wir haben da ein Fallback-Mechanismus implementiert, basierend auf einem lokalen JWT-Cache, der in der Build-Phase alle 15 Minuten mit Aegis synchronisiert wird. Sollte Aegis nicht erreichbar sein, können wir bis zu 4 Stunden mit gecachten Token weiterarbeiten. Das ist in Runbook RB-HER-SEC-07 dokumentiert."}
{"ts": "132:37", "speaker": "I", "text": "Und wie gehen Sie in diesem Szenario mit der Sicherheit um? Ein Cache birgt ja auch Risiken."}
{"ts": "132:50", "speaker": "E", "text": "Richtig, deshalb sind die Token im Cache AES-256 verschlüsselt und an den Host gebunden. Zusätzlich gibt es eine Policy, die bei jedem Start einer Pipeline überprüft, ob die Token noch gültig und nicht widerrufen sind."}
{"ts": "133:09", "speaker": "I", "text": "Verstehe. Wechseln wir kurz zum Thema Traceability: Wie stellen Sie aktuell die Verbindung zwischen Anforderungen, Testfällen und Defekten her?"}
{"ts": "133:23", "speaker": "E", "text": "Wir nutzen in Hera ein verknüpftes Mapping über das Modul ReqLink. Jede Anforderung bekommt eine eindeutige HER-REQ-ID, Testfälle tragen diese Referenz, und Defekte im Bugtracker werden automatisch mit dieser ID getaggt. So können wir in der Audit-Ansicht den gesamten Lebenszyklus nachvollziehen."}
{"ts": "133:44", "speaker": "I", "text": "Gab es dabei schon einmal Probleme mit fehlender oder falscher Zuordnung?"}
{"ts": "133:57", "speaker": "E", "text": "Ja, ein Mal im März, Ticket HER-BUG-1421, da wurde ein Defekt versehentlich einer falschen Anforderungs-ID zugeordnet. Wir haben daraufhin eine Validierungsregel ergänzt, die beim Erstellen eines Bug-Eintrags die ID gegen den ReqLink-Katalog prüft."}
{"ts": "134:18", "speaker": "I", "text": "Sie hatten auch POL-QA-014 erwähnt. Wie fließt diese Policy konkret in Ihr Risk-Based Testing ein?"}
{"ts": "134:32", "speaker": "E", "text": "POL-QA-014 gibt Mindestabdeckungen für kritische Pfade vor. Wir gewichten Testfälle nach Auswirkungsgrad und Eintrittswahrscheinlichkeit. Die Top-10% der Risiken werden in jeder Regression-Run zwingend getestet, selbst wenn Time-to-Market drängt."}
{"ts": "134:53", "speaker": "I", "text": "Und das haben Sie auch bei der letzten Release-Entscheidung so durchgezogen?"}
{"ts": "135:06", "speaker": "E", "text": "Ja, beim Release R1.4 gab es Druck, einen Hotfix für das Helios-Interface schnell auszurollen. Trotzdem haben wir die kritischen Pfade gegen Helios' Streaming-API komplett getestet, siehe Testreport HER-TR-20240515."}
{"ts": "135:27", "speaker": "I", "text": "Wenn wir über Helios sprechen – gab es sicherheitsrelevante Abhängigkeiten, die Sie besonders im Blick hatten?"}
{"ts": "135:40", "speaker": "E", "text": "Ja, die Authentifizierung der Datenabfragen läuft ebenfalls über Aegis IAM. Ein Fehler dort hätte sowohl Helios als auch Hera beeinträchtigt. Deswegen haben wir Cross-System-Tests etabliert, dokumentiert in Runbook RB-HER-INT-05."}
{"ts": "136:01", "speaker": "I", "text": "Abschließend: Gab es in dieser Build-Phase Entscheidungen, die Sie im Nachhinein als riskant einstufen würden?"}
{"ts": "136:15", "speaker": "E", "text": "Wir haben uns entschieden, die Testabdeckung bei wenig genutzten Modulen temporär zu senken, um Ressourcen für die Helios-Integration freizumachen. Das war ein bewusster Trade-off, dokumentiert in RFC-HER-DEC-09, mit der Maßgabe, die Abdeckung in der nächsten Iteration wieder zu erhöhen."}
{"ts": "140:00", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die kritischen Architekturentscheidungen eingehen – speziell in Bezug auf das Testdaten-Management innerhalb der Hera QA Platform."}
{"ts": "140:15", "speaker": "E", "text": "Ja, wir haben uns bewusst für ein anonymisiertes Testdaten-Repository entschieden, das über das interne Maskierungsmodul HER-MASK-02 läuft. Dadurch stellen wir sicher, dass keine personenbezogenen Informationen in die Helios Datalake-Schnittstelle gelangen."}
{"ts": "140:35", "speaker": "I", "text": "Und wie wird dieser Maskierungsprozess überwacht? Gibt es ein Runbook dafür?"}
{"ts": "140:48", "speaker": "E", "text": "Ja, das ist in Runbook-RBT-11 dokumentiert. Darin ist beschrieben, wie der Maskierungsjob vor jedem Testlauf initiiert und im Anschluss validiert wird. Wir protokollieren die Checks im Log-Channel 'her-mask-audit'."}
{"ts": "141:12", "speaker": "I", "text": "Gab es bisher Abweichungen, bei denen sensible Daten durchgerutscht sind?"}
{"ts": "141:23", "speaker": "E", "text": "Nur in einer frühen Build-Version, Ticket-HER-178. Damals fehlte ein Mapping für ein neues Datenfeld. Seit dem Patch ist das im automatischen Feldschema enthalten."}
{"ts": "141:45", "speaker": "I", "text": "Sie erwähnten früher die Abhängigkeit zu Aegis IAM – wie wirkt sich das konkret auf den Testdurchlauf aus, wenn IAM nicht verfügbar ist?"}
{"ts": "141:59", "speaker": "E", "text": "Wenn Aegis IAM ausfällt, greifen wir auf ein temporäres Token-Fallback zurück, das in HER-RUN-07 beschrieben ist. Allerdings reduzieren wir dann die Testabdeckung für sicherheitskritische Szenarien, um keine falschen Positivmeldungen zu erzeugen."}
{"ts": "142:22", "speaker": "I", "text": "Das bedeutet, Sie akzeptieren in solchen Fällen bewusst Lücken in der Abdeckung?"}
{"ts": "142:34", "speaker": "E", "text": "Ja, aber nur temporär. Wir haben im SLA-Dokument SLA-HER-SEC-01 festgelegt, dass sicherheitsrelevante Tests binnen 24 Stunden nach Wiederherstellung nachgezogen werden müssen."}
{"ts": "142:55", "speaker": "I", "text": "Welche Risiken sehen Sie dabei im Hinblick auf die Einhaltung der Compliance-Vorgaben?"}
{"ts": "143:09", "speaker": "E", "text": "Das größte Risiko ist, dass ein nicht getesteter Pfad in Produktion gelangt. Deshalb gibt es ein automatisches Deployment-Blocker-Skript, das ohne den Nachtest den Merge in den Main-Branch verhindert."}
{"ts": "143:30", "speaker": "I", "text": "Gab es Fälle, in denen Sie diesen Blocker bewusst übergangen haben?"}
{"ts": "143:42", "speaker": "E", "text": "Nein, das ist in den Governance-Richtlinien der Novereon Systems GmbH strikt untersagt. Jeder Override würde ein Incident-Ticket mit Sev-1 auslösen."}
{"ts": "144:00", "speaker": "I", "text": "Abschließend: Welche Lessons Learned aus dieser Build-Phase möchten Sie für die nächste Phase priorisieren?"}
{"ts": "144:15", "speaker": "E", "text": "Wir wollen vor allem die automatisierte Risikoanalyse aus POL-QA-014 enger mit den Testausführungsplänen verknüpfen. Außerdem planen wir, die Schnittstellentests mit Helios und Aegis in einer isolierten Staging-Umgebung vorab zu fahren, um Time-to-Market nicht durch externe Downtimes zu verzögern."}
{"ts": "146:00", "speaker": "I", "text": "Wir haben jetzt die zentralen Trade-offs angesprochen. Mich interessiert, wie Sie in der Praxis die Verbindung zwischen den risk-basierten Tests und dem Deployment-Plan herstellen."}
{"ts": "146:05", "speaker": "E", "text": "Das machen wir über eine Verknüpfung der RBT-Matrix mit dem CI/CD-Pipeline-Scheduler. Jede Kategorie aus der Risikoanalyse, die in POL-QA-014 beschrieben ist, hat definierte Gates im Jenkins-ähnlichen Orchestrator. So werden kritische Pfade wie der Helios-Datalake-Connector erst nach bestandener Authentifizierung über Aegis IAM in den Staging-Branch gemerged."}
{"ts": "146:15", "speaker": "I", "text": "Und wie wird verhindert, dass bei einem Fail an einem Gate trotzdem versehentlich der Merge passiert?"}
{"ts": "146:19", "speaker": "E", "text": "Wir haben in Runbook-CI-Guard-12 festgehalten, dass ein Merge-Block aktiviert wird, wenn das Gate 'CriticalPathAuth' rot ist. Das wird durch ein Pre-Receive-Hook im Git-Server erzwungen. Zusätzlich gibt es einen manuellen Override, der im Ticket-System dokumentiert werden muss, z. B. INC-HER-552."}
{"ts": "146:30", "speaker": "I", "text": "Sie sprachen von Overrides – sind die auditierbar?"}
{"ts": "146:33", "speaker": "E", "text": "Ja, jeder Override erzeugt automatisch ein Audit-Artifact im Compliance-Ordner des Projekts. Es enthält den Grund, die Genehmigung durch den QA-Leiter und die betroffenen Pipeline-Logs. Diese werden quartalsweise nach POL-COMP-022 geprüft."}
{"ts": "146:42", "speaker": "I", "text": "Gab es in den letzten Wochen einen solchen Override?"}
{"ts": "146:46", "speaker": "E", "text": "Einmal, für einen Hotfix im Helios-Datalake-Adapter, dokumentiert in INC-HER-547. Wir mussten einen Security-Patch sofort ausrollen, obwohl ein nicht-kritischer Test zu den Report-Exports fehlgeschlagen war."}
{"ts": "146:56", "speaker": "I", "text": "Verstehe. Ähm, wie balancieren Sie in solchen Fällen das Risiko?"}
{"ts": "147:00", "speaker": "E", "text": "Wir nutzen eine Heuristik, die im Risk-Playbook-RBP-07 beschrieben ist: Wenn die Sicherheitsrelevanz > 8/10 ist und die betroffene Funktion nicht direkt Kundendaten transformiert, darf ein Deployment mit dokumentiertem Override erfolgen."}
{"ts": "147:09", "speaker": "I", "text": "Gibt es Feedback aus dem Betrieb, ob diese Vorgehensweise praktikabel ist?"}
{"ts": "147:13", "speaker": "E", "text": "Ja, der Operations-Report vom letzten Monat (OPS-REP-0321) zeigt, dass wir dadurch im Schnitt 12 Stunden schnellere Hotfix-Rollouts hatten, ohne SLA-Verletzungen. Allerdings erhöht sich das Monitoring-Aufkommen post-deployment um ca. 15%."}
{"ts": "147:23", "speaker": "I", "text": "Das Monitoring-Aufkommen – ist das personell oder maschinell abgedeckt?"}
{"ts": "147:27", "speaker": "E", "text": "Primär maschinell, via Prometheus-Cluster mit speziell konfigurierten Alerts für IAM-Fehlercodes und Datalake-Latenzen. Bei einem Schwellenwert-Überschreiten wird automatisch ein PagerDuty-Event ausgelöst, gemäß Runbook-MON-05."}
{"ts": "147:36", "speaker": "I", "text": "Sie erwähnen Latenzen – wie stark wirken sich die zusätzlichen Tests auf diese aus?"}
{"ts": "147:40", "speaker": "E", "text": "In der Build-Phase haben wir im Schnitt +4,2 Sekunden bei den Datalake-API-Calls festgestellt, weil die Testinstrumentierung aktiv ist. Im Live-Betrieb entfällt diese Belastung, da die Hooks nur in Staging- und Pre-Prod-Umgebungen geladen werden."}
{"ts": "148:00", "speaker": "I", "text": "Sie hatten vorhin den Runbook-RBT-09 erwähnt. Können Sie mir bitte erläutern, wie Sie diesen konkret im Build-Phase-Kontext der Hera QA Platform anwenden?"}
{"ts": "148:05", "speaker": "E", "text": "Ja, also im Build nutzen wir RBT-09 als Referenz für die Priorisierung. Es enthält z. B. eine Tabelle mit Risikokategorien von 1 bis 4, gekoppelt an die Komplexität der Testfälle. Wir mappen das direkt aus den Anforderungs-IDs, um frühe Regressionstests in kritischen Pfaden zu sichern."}
{"ts": "148:17", "speaker": "I", "text": "Und wie stellen Sie sicher, dass diese Risikoeinstufungen nicht veraltet sind, gerade wenn Schnittstellen wie zu Helios Datalake angepasst werden?"}
{"ts": "148:22", "speaker": "E", "text": "Wir haben eine wöchentliche Sync-Runde mit dem Helios-Team. Änderungen an deren API-Schema werden in unserem internen RFC-Workflow erfasst – RFC-HER-58 ist ein Beispiel – und triggern eine automatische Neubewertung der betroffenen Testfälle laut RBT-09."}
{"ts": "148:35", "speaker": "I", "text": "Okay, und greifen Sie da auch auf Aegis IAM Logs zurück, um Auth-Flows zu prüfen?"}
{"ts": "148:40", "speaker": "E", "text": "Genau, wir korrelieren die IAM-Session-Logs mit den Testausführungen. In Runbook-SEC-12 ist dokumentiert, wie wir bei verdächtigen Authentifizierungsmustern – etwa Session Token Reuse – direkte Blocker-Tickets erzeugen, wie HER-311 letzte Woche."}
{"ts": "148:55", "speaker": "I", "text": "Lassen Sie uns kurz auf die Compliance-Dokumentation zurückkommen. Dokumentieren Sie nur SLA-Erfüllung oder auch SLO-Abweichungen?"}
{"ts": "149:00", "speaker": "E", "text": "Beides. Wir haben ein wöchentliches KPI-Report-Template, das SLA-Compliance in Prozent ausweist, aber auch SLO-Trends. Bei Abweichung >5 % vom Zielwert schreiben wir einen CAPA-Report – Corrective and Preventive Action – gemäß POL-QA-014."}
{"ts": "149:15", "speaker": "I", "text": "Sie sprachen POL-QA-014 an. Wie binden Sie diese Richtlinie konkret in die Testautomatisierung ein?"}
{"ts": "149:21", "speaker": "E", "text": "Wir haben die dort geforderten Traceability-Matrix-Vorgaben direkt in unser Test-Management-Tool integriert. Jeder Testfall muss eine Requirement-ID und, falls vorhanden, ein zugehöriges Defect-Ticket referenzieren. Das wird nightly validiert."}
{"ts": "149:35", "speaker": "I", "text": "Gab es in letzter Zeit eine Situation, wo diese Traceability Ihnen geholfen hat, ein Risiko zu entschärfen?"}
{"ts": "149:40", "speaker": "E", "text": "Ja, bei Ticket-HER-327. Wir konnten über die Matrix sofort sehen, dass drei kritische Anforderungen von einer Helios-Datalake-Änderung betroffen waren. Damit haben wir Regressionstests gezielt vorgezogen und einen Ausfall im Staging vermieden."}
{"ts": "149:55", "speaker": "I", "text": "Wie reagieren Sie, wenn solche Anpassungen den Build-Plan gefährden?"}
{"ts": "150:00", "speaker": "E", "text": "Wir haben ein Eskalationsfenster von maximal 48 Stunden. Innerhalb dessen entscheidet das QA-Board, ob wir eine Build-Verzögerung in Kauf nehmen oder mit einem abgesicherten Teil-Release arbeiten. Das ist dokumentiert in Runbook-REL-04."}
{"ts": "150:15", "speaker": "I", "text": "Und bei Ihrem letzten Entscheid – war das eher ein Trade-off zugunsten der Abdeckung oder der Time-to-Market?"}
{"ts": "150:20", "speaker": "E", "text": "Beim Fall HER-327 haben wir klar die Abdeckung priorisiert. Die evidenzbasierte Entscheidung ist im QA-Board-Protokoll vom 14.05. vermerkt, inklusive Risikobewertungskarte. Das war konsistent mit unserem Lessons-Learned aus HER-243, wo wir zu schnell releast hatten und später Hotfixes nötig waren."}
{"ts": "152:00", "speaker": "I", "text": "Lassen Sie uns jetzt noch einmal gezielt auf die Risikobewertung eingehen – wie ist aktuell der Status der Risikoanalyse im Kontext von POL-QA-014?"}
{"ts": "152:06", "speaker": "E", "text": "Der Status ist, hm, zu etwa 85 % abgeschlossen. Wir haben die Risikokategorien nach Auswirkung und Eintrittswahrscheinlichkeit gemappt, und die Mapping-Matrix liegt in Confluence unter QA-RISK-BOARD-21. Besonders kritisch sind hier die Schnittstellen-Tests zu Helios, da dort Datenvolumina und Latenz eine Rolle spielen."}
{"ts": "152:17", "speaker": "I", "text": "Und wie setzen Sie konkret Risk-Based Testing um, um kritische Pfade frühzeitig zu validieren?"}
{"ts": "152:23", "speaker": "E", "text": "Wir priorisieren Test-Suites gemäss dem Impact-Score aus der Risikoanalyse. Das ist im Runbook-RBT-11 beschrieben: High-Impact-Cases laufen täglich in der Nightly Pipeline, Medium wöchentlich. Low erst vor Meilenstein-Builds. Das reduziert Testzeit und hält dennoch die Abdeckung auf den kritischen Pfaden hoch."}
{"ts": "152:36", "speaker": "I", "text": "Wie stellen Sie dabei die Traceability zwischen Anforderungen, Testfällen und Defekten sicher?"}
{"ts": "152:42", "speaker": "E", "text": "Wir nutzen das Mapping-Feature in TestOrch v4.2, wo Jira-IDs direkt mit Testfall-IDs verknüpft sind. Bei einem Defekt in HER-Module-31 sehen wir sofort, welche Anforderung aus dem Requirement-Dokument Q-REQ-202 betroffen ist. Polarion exportiert diese Beziehungen automatisch als Audit-Artefakt."}
{"ts": "152:55", "speaker": "I", "text": "Können Sie beschreiben, welche SLA- und SLO-Vorgaben für die Build-Phase relevant sind und wie Sie diese dokumentieren?"}
{"ts": "153:02", "speaker": "E", "text": "Für die Build-Phase gelten vor allem SLOs zu Testlaufzeit (< 90 Minuten für High-Impact) und Defektschlussrate (> 95 % vor Release). Wir dokumentieren das in den wöchentlichen QA-Dashboards, die als PDF in unserem Compliance-Archiv unter HER-COMP-LOG-17 abgelegt werden."}
{"ts": "153:15", "speaker": "I", "text": "Und was passiert, wenn eine Abweichung von diesen Qualitätszielen erkannt wird?"}
{"ts": "153:21", "speaker": "E", "text": "Dann wird ein Deviation-Ticket erstellt, z. B. HER-DEV-58, mit Root-Cause-Analyse innerhalb von 48 Stunden. Es gibt auch einen Eskalationspfad im Runbook-ESC-05, der vorsieht, dass das Release-Komitee involviert wird, wenn zwei Wochen in Folge Abweichungen auftreten."}
{"ts": "153:35", "speaker": "I", "text": "Gab es in dieser Phase kritische Architekturentscheidungen, die Sie dokumentieren mussten?"}
{"ts": "153:41", "speaker": "E", "text": "Ja, z. B. die Entscheidung, eine asynchrone Testausführung für Helios-Integrationen einzuführen. Das ging auf RFC-HER-ASYNC-04 zurück. Vorteil: geringere Latenzspitzen. Nachteil: komplexeres Fehler-Handling, was wir in Runbook-ERR-07 abgebildet haben."}
{"ts": "153:55", "speaker": "I", "text": "War das auch ein Trade-off zwischen Testabdeckung und Time-to-Market?"}
{"ts": "154:00", "speaker": "E", "text": "Teilweise, ja. Wir haben die vollständige Abdeckung der synchronen Pfade zugunsten einer schnelleren Auslieferung verschoben. Dokumentiert in Ticket-HER-250, mit Verweis auf Lessons Learned: Wir müssen in der nächsten Phase gezielter Async-spezifische Tests aufbauen."}
{"ts": "154:12", "speaker": "I", "text": "Können Sie dazu konkrete Risiken nennen, die Sie jetzt im Auge behalten?"}
{"ts": "154:18", "speaker": "E", "text": "Ja, Race Conditions zwischen Test-Runner und Datenbereitstellung im Helios Datalake. Wir haben Monitoring-Hooks implementiert, die im Fehlerfall Alerts via Aegis IAM triggern. Dieses Setup ist im Monitoring-Guide MON-HER-05 beschrieben und wurde im letzten Security-Review (SEC-REV-12) freigegeben."}
{"ts": "153:36", "speaker": "I", "text": "Lassen Sie uns nochmal auf die Integration mit dem Helios Datalake zurückkommen. Gibt es aktuell Engpässe, die den Datendurchsatz in der Testumgebung limitieren?"}
{"ts": "153:41", "speaker": "E", "text": "Ja, wir haben in der letzten Woche einen Bottleneck in der Staging-Pipeline festgestellt. Das war im Extract-Transform-Load-Schritt; laut Logfile HLDK-ETL-Run#5827 lagen wir bei nur 75 % der erwarteten Rate. Wir vermuten, dass ein fehlerhaftes Mapping-Skript aus der letzten RFC-Änderung daran schuld ist."}
{"ts": "153:49", "speaker": "I", "text": "Und dieser Engpass beeinflusst direkt die Testläufe in Hera QA?"}
{"ts": "153:54", "speaker": "E", "text": "Genau, weil unser Testdaten-Generator auf frische Datalake-Snapshots angewiesen ist. Wenn die Verzögerung über 30 Minuten liegt, verfallen einige Zeitstempel-abhängige Tests, was in Testreport HERA-QA-TR-2023-11 klar als Risiko markiert ist."}
{"ts": "154:02", "speaker": "I", "text": "Wie greifen hier Ihre Sicherheitsmaßnahmen? Sie hatten ja erwähnt, dass Aegis IAM in dieser Kette sitzt."}
{"ts": "154:07", "speaker": "E", "text": "Richtig. Jede ETL-Session nutzt temporäre IAM-Tokens mit einer Gültigkeit von 45 Minuten. Das ist laut Security Policy SEC-IAM-07 zwingend. Das Problem ist, wenn der ETL länger läuft, läuft das Token ab und der Job bricht ab. Wir arbeiten an einem Refresh-Mechanismus, der in Runbook-ETL-Auth-02 beschrieben ist."}
{"ts": "154:17", "speaker": "I", "text": "Klingt nach einer klassischen Cross-System-Abhängigkeit. Haben Sie das in Ihre Risiko-Matrix aufgenommen?"}
{"ts": "154:22", "speaker": "E", "text": "Ja, in der Risk Register-Tabelle unter ID-HER-RSK-19. Dort steht die Abhängigkeit Helios↔Aegis als hohe Eintrittswahrscheinlichkeit und mittlere Auswirkung, weil wir Workarounds haben, aber die Stabilität leidet."}
{"ts": "154:31", "speaker": "I", "text": "Könnte man nicht parallelisierte ETL-Läufe starten, um die Zeit zu reduzieren?"}
{"ts": "154:35", "speaker": "E", "text": "Theoretisch ja, praktisch limitiert uns die Datalake-API-Quota auf 5 gleichzeitige Verbindungen pro Service-Account. Wir könnten mehrere Accounts verwenden, aber das müsste im IAM und im Auditlog sauber nachvollziehbar sein – und das ist laut Compliance-Runbook-CMP-04 nicht trivial."}
{"ts": "154:44", "speaker": "I", "text": "Verstehe. Wechseln wir kurz: Sie haben vorhin Risk-Based Testing erwähnt. Welche Lessons Learned haben Sie aus den letzten drei Sprints gezogen?"}
{"ts": "154:49", "speaker": "E", "text": "Ein wichtiger Punkt: Wir müssen kritische Pfade noch früher in Sprint 1 adressieren. In Sprint 6 hatten wir einen Defekt in der Authentifizierung (Bug HERA-AUTH-332), der erst in der Endphase auffiel. Das hat uns fast zwei Wochen gekostet."}
{"ts": "154:57", "speaker": "I", "text": "Gab es da einen Trade-off? Ich frage wegen der früheren Diskussion zu HER-243."}
{"ts": "155:02", "speaker": "E", "text": "Ja, wir mussten entscheiden: entweder Zeit investieren, um die Testabdeckung für seltene Edge-Cases zu erhöhen, oder die Haupt-Features ausliefern. Wir haben uns für letzteres entschieden, dokumentiert im Decision Log unter DOCHER-DEC-17, mit Verweis auf Runbook-RBT-09."}
{"ts": "155:11", "speaker": "I", "text": "Wie gehen Sie mit der technischen Schuld aus dieser Entscheidung um?"}
{"ts": "155:15", "speaker": "E", "text": "Wir haben ein Backlog von ‚Quality Debt‘-Tickets, markiert mit dem Label QD-HERA. Diese werden in jedem dritten Sprint priorisiert. Zudem tracken wir Metriken wie Mean Time to Detect und Defect Leakage, um die Auswirkungen messbar zu halten."}
{"ts": "155:06", "speaker": "I", "text": "Kommen wir noch einmal zur Integration — gibt es inzwischen neue technische Details zur Schnittstelle zwischen Hera QA Platform und dem Helios Datalake?"}
{"ts": "155:11", "speaker": "E", "text": "Ja, wir haben in der Build-Phase einen gRPC-basierten Streaming-Adapter implementiert. Der Adapter nutzt den Helios Data Ingest Service, aber mit einem Filtermodul, das alle Felder, die potenziell personenbezogen sind, vor der Persistenz entfernt."}
{"ts": "155:19", "speaker": "I", "text": "Und wie wird diese Filterlogik validiert? Ich denke an die Sicherheitsrichtlinie SEC-DATA-005."}
{"ts": "155:25", "speaker": "E", "text": "Wir haben einen automatisierten Testlauf im CI, der auf Basis von Runbook-DLF-07 jede Schemaänderung gegen eine Negativliste prüft. Bei Verstoß blockiert der Merge-Check sofort den Build."}
{"ts": "155:33", "speaker": "I", "text": "Okay, das klingt stringent. Wie ist dabei die Abhängigkeit zum Aegis IAM gelöst?"}
{"ts": "155:38", "speaker": "E", "text": "Die Authentifizierung für den Adapter erfolgt ausschließlich via Aegis OAuth2 Client Credentials Flow. Zusätzlich enforced der IAM-Policy-Server eine Zeit- und IP-gebundene Access Policy, bevor überhaupt Daten ins Helios Datalake fließen."}
{"ts": "155:47", "speaker": "I", "text": "Das heißt, wenn Aegis eine Policy ändert, muss Hera QA Platform darauf reagieren können?"}
{"ts": "155:52", "speaker": "E", "text": "Genau, deshalb haben wir Event-Listener auf den Policy-Change-Topics. Bei einer Policyänderung wird die Session invalidiert und der Adapter reinitialisiert die Verbindung mit den neuen Tokens."}
{"ts": "156:00", "speaker": "I", "text": "Wie beeinflusst das Ihre Teststrategie, insbesondere risk-based Testing?"}
{"ts": "156:05", "speaker": "E", "text": "Wir haben die Policy-Change-Szenarien als High-Risk-Kategorie in der Risikomatrix. In Runbook-RBT-12 sind Testfälle definiert, die simulieren, dass während einer Testausführung ein Token entzogen wird."}
{"ts": "156:13", "speaker": "I", "text": "Und die Traceability – ist die für diese High-Risk-Tests vollständig hinterlegt?"}
{"ts": "156:18", "speaker": "E", "text": "Ja, via unserem internen Tool QLink. Jeder Testfall ist mit der Anforderung aus dem Pflichtenheft und den zugehörigen Tickets, wie z. B. HER-311, verknüpft. Bei Defekten in diesen Pfaden referenzieren wir zurück auf die Risiko-ID aus POL-QA-014."}
{"ts": "156:28", "speaker": "I", "text": "Gut, dann lassen Sie uns auf die Entscheidungen eingehen: Gab es Kompromisse, die Sie in der Build-Phase eingehen mussten, die jetzt schon absehbare Risiken bergen?"}
{"ts": "156:34", "speaker": "E", "text": "Ja, bei der Testabdeckung für die Helios-Schnittstelle mussten wir von 95 % geplanten Coverage auf 82 % runter, um den Milestone M4 zu halten. Dokumentiert ist das in Ticket-HER-362 mit Verweis auf Runbook-COV-05."}
{"ts": "156:43", "speaker": "I", "text": "Welche Risikominderung haben Sie dafür implementiert?"}
{"ts": "156:48", "speaker": "E", "text": "Wir haben zusätzliche Canary-Tests in der Staging-Umgebung eingeplant, die täglich gegen den Helios Datalake laufen. Falls ein kritischer Fehler auftritt, erlaubt uns das SLA-QA-002, den Rollout um maximal 48 Stunden zu verschieben, um zu patchen."}
{"ts": "156:30", "speaker": "I", "text": "Lassen Sie uns auf die Risikoanalyse zurückkommen: Welche zusätzlichen Risikokategorien haben Sie seit der letzten Sitzung ergänzt?"}
{"ts": "156:34", "speaker": "E", "text": "Wir haben neben den bestehenden Kategorien 'Security Breach' und 'Performance Degradation' nun auch 'Data Integrity Drift' aufgenommen, basierend auf Findings aus Testlauf HER-QA-58. Das kam durch eine Korrelation von Log-Anomalien im Helios Datalake und Aegis IAM Session-Dumps heraus."}
{"ts": "156:41", "speaker": "I", "text": "Interessant, und wie fließt das in die Teststrategie ein?"}
{"ts": "156:45", "speaker": "E", "text": "Wir erweitern die Risk-Based Testing Matrix in Runbook-RBT-12, sodass kritische Pfade mit möglicher Datenabweichung zweimal pro Sprint in den Smoke-Tests durchlaufen werden. Zusätzlich gibt es jetzt einen dedizierten Integrity-Checker, der die Ergebnisse mit den Referenzdaten aus Helios vergleicht."}
{"ts": "156:53", "speaker": "I", "text": "Und wie stellen Sie die Traceability sicher, gerade bei diesem neuen Checker?"}
{"ts": "156:57", "speaker": "E", "text": "Jeder Checker-Run erzeugt einen Trace-Link im QA-Portal, der mit der Anforderungs-ID aus dem Hera-Backlog verknüpft ist. So kann man im Defect-Tracker direkt sehen, ob ein Defekt auf eine Integrity-Abweichung zurückgeht."}
{"ts": "157:03", "speaker": "I", "text": "Gab es technische Hürden bei der Integration des Checkers in die bestehende Pipeline?"}
{"ts": "157:07", "speaker": "E", "text": "Ja, vor allem weil die Build-Agenten im Hera QA Cluster nicht direkt auf die Helios Raw-Layer zugreifen dürfen. Wir mussten einen gesicherten API-Proxy setzen, dokumentiert in RFC-HER-AP-07, um nur aggregierte Daten auszulesen."}
{"ts": "157:14", "speaker": "I", "text": "Das klingt nach einem möglichen Performance-Trade-off. Wie haben Sie den bewertet?"}
{"ts": "157:18", "speaker": "E", "text": "Wir haben im Ticket-HER-311 Lasttests gefahren. Der Proxy fügt im Schnitt 120 ms Latenz hinzu, was innerhalb des SLO von 250 ms für Integritätsprüfungen liegt. Deshalb haben wir den Trade-off zugunsten der Sicherheit entschieden."}
{"ts": "157:25", "speaker": "I", "text": "Und was sagen die Compliance-Richtlinien dazu?"}
{"ts": "157:29", "speaker": "E", "text": "POL-QA-014 verlangt explizit, dass Testdaten nur über abgesicherte Schnittstellen fließen. Wir haben die Proxy-Architektur in den Audit-Artefakten AR-HER-2024-05 hinterlegt, sodass die Revision das nachvollziehen kann."}
{"ts": "157:36", "speaker": "I", "text": "Gab es für diese Entscheidung interne Diskussionen oder gar Widerspruch?"}
{"ts": "157:40", "speaker": "E", "text": "Ja, das Architekturgremium hatte angemerkt, dass bei hoher Testlast Engpässe möglich sind. Wir haben deshalb einen Fallback-Mechanismus in Runbook-RBT-15 beschrieben: Bei Proxy-Ausfall oder Überlastung werden nur Metadaten-Checks durchgeführt, keine Vollintegritätsprüfungen."}
{"ts": "157:48", "speaker": "I", "text": "Wie bewerten Sie rückblickend diesen Kompromiss?"}
{"ts": "157:52", "speaker": "E", "text": "Es ist ein klarer Balance-Akt zwischen Time-to-Market und Prüf-Tiefe. Die evidenzbasierten Tests aus HER-311 zeigen, dass wir im Normalbetrieb keinen Engpass haben. In den Audit-Logs ist der Fallback-Zustand transparent, was das Risiko beherrschbar macht."}
{"ts": "158:06", "speaker": "I", "text": "Sie hatten vorhin kurz POL-QA-014 erwähnt. Können Sie noch einmal ausführen, wie genau diese Policy in die Build-Phase der Hera QA Platform eingeflossen ist?"}
{"ts": "158:11", "speaker": "E", "text": "Ja, gern. POL-QA-014 definiert die Mindestanforderungen für Testdaten-Anonymisierung und Logging-Sicherheit. In der Build-Phase haben wir im Modul 'TestDataSanitizer' direkt die Hashing-Algorithmen laut Abschnitt 4.2 dieser Policy implementiert und in Runbook-TDS-11 dokumentiert."}
{"ts": "158:19", "speaker": "I", "text": "Und wie überprüfen Sie, dass diese Implementierung tatsächlich policy-konform ist?"}
{"ts": "158:23", "speaker": "E", "text": "Wir fahren wöchentliche Compliance-Scans mit unserem internen Tool 'SigurdCheck'. Die Reports werden gegen die in POL-QA-014 aufgeführten Test-Cases gematcht. Abweichungen landen automatisch als Tickets, z.B. HER-312, im Jira-Board."}
{"ts": "158:31", "speaker": "I", "text": "Gibt es Schnittstellen zu Helios Datalake, die hier besondere Prüfaufgaben erfordern?"}
{"ts": "158:35", "speaker": "E", "text": "Ja, vor allem der Export von Testmetriken. Diese laufen über eine API, die mit Aegis IAM authentifiziert wird. Wir mussten deshalb in Runbook-API-07 festhalten, dass vor jedem Export ein Token-Refresh gemäß IAM-Security-Guideline 3.1 durchgeführt wird."}
{"ts": "158:44", "speaker": "I", "text": "Das klingt nach einer engen Verzahnung mehrerer Systeme. Gab es dabei unerwartete Probleme?"}
{"ts": "158:48", "speaker": "E", "text": "Definitiv. Die IAM-Token hatten anfangs nur eine Gültigkeit von 15 Minuten, was bei langen Testläufen zu Abbrüchen führte. Wir haben das mit einem asynchronen Token-Renewal-Mechanismus gelöst, siehe Ticket-HER-329 und den zugehörigen Patch in Branch 'feature/token-renewal'."}
{"ts": "158:57", "speaker": "I", "text": "Wie haben Sie das Risiko bewertet, dass solche Abbrüche die Testabdeckung beeinflussen könnten?"}
{"ts": "159:01", "speaker": "E", "text": "Wir haben im Risk Register die Kategorie 'Integration Disruption' eingeführt. Laut Bewertung in RSK-HER-12 lag das Risiko anfangs bei 0,6 auf der internen Skala, konnte aber nach dem Fix auf 0,2 reduziert werden."}
{"ts": "159:09", "speaker": "I", "text": "Wie stellen Sie sicher, dass diese Lessons Learned nicht verloren gehen?"}
{"ts": "159:13", "speaker": "E", "text": "Wir pflegen ein zentrales Confluence-Wiki mit einer Sektion 'Build-Phase Insights'. Dort sind Runbooks, Risikobewertungen und Tickets verlinkt. Für kritische Punkte wie das Token-Renewal haben wir zusätzlich ein How-To-Video erstellt."}
{"ts": "159:21", "speaker": "I", "text": "Gab es weitere architektonische Entscheidungen in dieser Phase, die Sie dokumentieren mussten?"}
{"ts": "159:25", "speaker": "E", "text": "Ja, wir haben entschieden, den Flaky-Test-Analyzer als separaten Microservice zu deployen, um unabhängig skalieren zu können. Dokumentiert in ADR-HER-07, mit Verweis auf Performance-Benchmarks aus Testlauf #B42."}
{"ts": "159:33", "speaker": "I", "text": "War das nicht ein Trade-off in Bezug auf die Komplexität der Deployment-Pipeline?"}
{"ts": "159:37", "speaker": "E", "text": "Ja, absolut. Die Pipeline hat dadurch zwei zusätzliche Stages bekommen. Wir haben das akzeptiert, weil laut SLA-QA-02 die Analysezeiten um bis zu 35% reduziert werden konnten. Das haben wir in Runbook-CICD-15 und im Abschlussbericht des Sprints 18 belegt."}
{"ts": "159:30", "speaker": "I", "text": "Sie hatten zuvor schon die Integration mit Aegis IAM erwähnt – wie wirkt sich diese denn konkret auf die Testdatenströme in Richtung Helios Datalake aus?"}
{"ts": "159:36", "speaker": "E", "text": "Also, wir haben einen mehrstufigen Auth-Flow implementiert, der in den Testpipelines simuliert wird. Das heißt, bevor ein Testjob überhaupt Daten an Helios schickt, wird über unser Mock-Aegis-Modul ein OAuth-ähnlicher Token generiert. Dadurch bleiben wir konform mit den Vorgaben aus SEC-INT-052, selbst wenn es sich nur um synthetische Daten handelt."}
{"ts": "159:45", "speaker": "I", "text": "Und wie stellen Sie sicher, dass diese Mocks nicht versehentlich produktive Tokens akzeptieren?"}
{"ts": "159:50", "speaker": "E", "text": "Wir haben in Runbook-AUTH-MOCK-07 genau dokumentiert, dass die Test-Endpoints in einer separaten Subdomain laufen und alle Produktiv-Tokens mit einem Prefix 'PRD-' geblockt werden. Zusätzlich werden bei jedem Build entsprechende Unit-Tests gefahren, die diese Blockade verifizieren."}
{"ts": "160:00", "speaker": "I", "text": "Können Sie das mit einem Beispiel aus der letzten Testreihe untermauern?"}
{"ts": "160:05", "speaker": "E", "text": "Klar, in Build 2024.05.14 hat unser Pre-Deployment-Check den Versuch, ein PRD-Token zu verwenden, korrekt als Fehler markiert. Das ist auch in Ticket-HER-312 dokumentiert, inklusive der Logauszüge aus dem Mock-Server."}
{"ts": "160:15", "speaker": "I", "text": "Sie erwähnten mehrfach Runbooks – wie halten Sie diese aktuell, wenn sich Policies ändern?"}
{"ts": "160:20", "speaker": "E", "text": "Wir haben ein wöchentliches Review mit dem QA-Governance-Team. Änderungen aus neuen RFCs, wie jüngst RFC-QA-27 zu anonymisierten Testdaten, werden direkt in die Runbooks übertragen und in der nächsten Test-Iteration validiert."}
{"ts": "160:30", "speaker": "I", "text": "Gab es dabei schon Konflikte zwischen den Policy-Updates und der Build-Phase-Timeline?"}
{"ts": "160:35", "speaker": "E", "text": "Ja, bei der Einführung der neuen Data-Masking-Library aus RFC-QA-27 mussten wir zwei Sprints umplanen. Wir haben das intern als Risk-RBT-11 geführt, weil die Integration die bestehenden Tests für Helios-Datenschemas beeinflusst hat."}
{"ts": "160:45", "speaker": "I", "text": "Wie haben Sie das Risiko mitigiert?"}
{"ts": "160:49", "speaker": "E", "text": "Wir haben eine parallele Testumgebung aufgebaut, in der die Masking-Library isoliert gegen Kopien der Helios-Schemas lief. So konnten wir Fehler schneller isolieren, ohne die Hauptpipeline zu blockieren. Das ist in Runbook-RBT-ISOL-03 beschrieben."}
{"ts": "160:59", "speaker": "I", "text": "Und die Auswirkungen auf die SLA-Compliance?"}
{"ts": "161:03", "speaker": "E", "text": "Minimal, da wir durch die Isolation die Delivery-Zeiten um nur 4 Stunden verzögert haben, was innerhalb des SLO-QA-001 Toleranzfensters liegt. Das haben wir im Compliance-Report CR-HER-05 so vermerkt."}
{"ts": "161:13", "speaker": "I", "text": "Abschließend: Welche Lehren ziehen Sie aus dieser Erfahrung für die weitere Build-Phase?"}
{"ts": "161:18", "speaker": "E", "text": "Vor allem, dass frühe Identifikation von Policy-Änderungen entscheidend ist. Wir planen jetzt ein automatisches Diff-Tool zwischen Policy-Repo und Runbooks, um Abweichungen sofort zu sehen. Das sollte zukünftige Trade-offs wie bei Ticket-HER-243 entschärfen."}
{"ts": "161:06", "speaker": "I", "text": "Lassen Sie uns noch einmal konkret auf die Audit-Artefakte eingehen, die Sie für Hera vorbereiten. Welche Formate und Inhalte werden da aktuell gepflegt?"}
{"ts": "161:12", "speaker": "E", "text": "Wir pflegen zurzeit ein kombiniertes PDF- und JSON-Format, basierend auf Runbook-COM-07. Das PDF enthält die human-readable Audit Summary, während das JSON maschinenlesbar ist und alle Testfall-IDs, Ausführungszeiten und Abweichungen gemäß SLA-QA-3.2 auflistet."}
{"ts": "161:19", "speaker": "I", "text": "Und wie stellen Sie sicher, dass diese Daten während der Übertragung zum Compliance-Archiv unverändert bleiben?"}
{"ts": "161:24", "speaker": "E", "text": "Wir nutzen eine signierte Payload nach interner Spezifikation SEC-SIG-04. Die Signatur wird mit dem Aegis IAM Service Key erzeugt und vor dem Import in das Archiv überprüft. In Ticket-HER-317 haben wir einen Fall dokumentiert, wo eine korrupt übertragene Datei durch diesen Mechanismus erkannt wurde."}
{"ts": "161:31", "speaker": "I", "text": "Gab es Anpassungen an der Teststrategie, als diese Sicherheitsüberprüfung eingeführt wurde?"}
{"ts": "161:36", "speaker": "E", "text": "Ja, wir mussten die Pipeline in Stage-3 um einen Verify-Step erweitern. Das hat laut Messung in HER-METR-12 ca. 4 Minuten pro Lauf gekostet. Dadurch wurden manche Nightly-Runs nach hinten verschoben – Time-to-Market blieb aber im Rahmen, weil wir Parallelisierung angepasst haben."}
{"ts": "161:44", "speaker": "I", "text": "Das klingt nach einer bewussten Priorisierung von Sicherheit vor Geschwindigkeit. Wurde das formal abgewogen?"}
{"ts": "161:49", "speaker": "E", "text": "Ja, in der RFC-HER-SEC-09 wurde das Pro und Contra bewertet. Eine Reduzierung des Risikos von Datenmanipulation wurde mit +3 Risikopunkten gewichtet, während der Zeitverlust nur mit -1 bewertet wurde."}
{"ts": "161:55", "speaker": "I", "text": "Wie hat sich diese Entscheidung auf die Schnittstelle zum Helios Datalake ausgewirkt?"}
{"ts": "162:00", "speaker": "E", "text": "Interessanterweise positiv: Da auch Helios seit Q2 die SEC-SIG-04 nutzt, konnten wir den Authentifizierungs-Handshake über Aegis IAM vereinheitlichen. Dadurch entfiel ein eigener Datenintegrität-Check auf Helios-Seite, was Tests dort sogar beschleunigt hat."}
{"ts": "162:07", "speaker": "I", "text": "Gab es dafür spezielle Anpassungen in Ihrer Testdaten-Generierung?"}
{"ts": "162:12", "speaker": "E", "text": "Ja, wir haben das Generator-Skript aus Runbook-TDG-05 so erweitert, dass es automatisch SHA256-Hashes für Dummy-Daten erzeugt und im JSON mitschickt. Dadurch entsprach es sofort der SEC-SIG-04-konformen Übertragung."}
{"ts": "162:18", "speaker": "I", "text": "Sie erwähnten vorhin Ticket-HER-317. Können Sie mir kurz sagen, wie das Problem behoben wurde?"}
{"ts": "162:23", "speaker": "E", "text": "Damals hat ein fehlerhafter Netzwerk-Proxy ein Byte im Transfer verändert. Nach Analyse laut Incident-Report-HER-317 haben wir den Proxy aus der CI/CD-Transferstrecke entfernt und den Verify-Step verpflichtend gemacht."}
{"ts": "162:29", "speaker": "I", "text": "Abschließend – welche Lessons Learned ziehen Sie aus dieser Phase in Bezug auf Sicherheit und Testorchestrierung?"}
{"ts": "162:34", "speaker": "E", "text": "Dass Security-by-Design in der Testorchestrierung nicht nur ein Compliance-Haken ist, sondern reale Ausfälle verhindert. Die Kombination aus Aegis IAM, SEC-SIG-04 und angepasster Testdaten-Generierung hat uns gezeigt, dass ein minimaler Mehraufwand in der Build-Phase spätere Risiken drastisch reduziert."}
{"ts": "162:06", "speaker": "I", "text": "Sie hatten ja eben die Integration mit Helios Datalake angesprochen – können Sie mir genauer erläutern, wie das Logging aus Hera QA aktuell dort eingespeist wird?"}
{"ts": "162:11", "speaker": "E", "text": "Ja, wir nutzen ein Event-Streaming-Modul, das im Build-Branch bereits aktiv ist. Die Testausführungslogs werden in JSONL-Format transformiert und über den internen Kafka-Bus in den Helios Datalake geschrieben. Dort greift dann ein Security-Filter aus Runbook-HDL-SEC-07, der personenbezogene Felder anonymisiert."}
{"ts": "162:18", "speaker": "I", "text": "Okay, und wie stellen Sie in diesem Prozess sicher, dass keine sensiblen Daten durchrutschen?"}
{"ts": "162:22", "speaker": "E", "text": "Wir haben in der CI-Pipeline einen Pre-Publish-Validator implementiert, der auf Basis der Sensitivity Tags aus Aegis IAM prüft. Falls ein Feld den Tag 'PII' trägt und nicht im Allowlist-File HDL-ALLOW-03 steht, blockt der Job und öffnet automatisch ein Ticket im Security-Board, z. B. wie bei HER-278 letzte Woche."}
{"ts": "162:31", "speaker": "I", "text": "Interessant. Gab es in der letzten Zeit Grenzfälle, wo das System zu streng oder zu lax reagiert hat?"}
{"ts": "162:36", "speaker": "E", "text": "Einmal hat der Validator bei generierten Dummy-Namen angeschlagen, weil das Regex-Muster zu breit war. Wir mussten das in Commit 4f9d2 anpassen. Umgekehrt, zu lax, hatten wir noch nicht, weil wir das Regelwerk eher konservativ einstellen."}
{"ts": "162:44", "speaker": "I", "text": "Und diese Anonymisierung – wirkt sich das auf die Analyse der flaky Tests aus?"}
{"ts": "162:48", "speaker": "E", "text": "Minimal. Manche Korrelationen, die User-IDs nutzen, sind schwieriger, aber wir mappen intern auf Surrogate Keys. Das ist im Flaky-Analysis-Runbook HER-FLAK-02 dokumentiert."}
{"ts": "162:54", "speaker": "I", "text": "Sie hatten vorhin bei den Risk-Based-Tests die kritischen Pfade genannt. Haben sich durch die Integration mit Helios Änderungen daran ergeben?"}
{"ts": "162:59", "speaker": "E", "text": "Ja, durch die Datalake-Anbindung ist der Pfad 'Export Test Artefacts' neu als kritisch eingestuft. In der Risiko-Matrix RISK-HER-04 haben wir den auf 'hoch' gesetzt, weil ein Fehler dort sowohl Data Loss Risk als auch Compliance Risk erhöht."}
{"ts": "163:07", "speaker": "I", "text": "Verstanden. Wie adressieren Sie dieses erhöhte Risiko aktuell?"}
{"ts": "163:11", "speaker": "E", "text": "Wir fahren vor jedem Export einen Dry-Run mit Mock-Daten, verifizieren Checksums und vergleichen gegen die Export-Spec aus RFC-HER-EXP-01. Erst wenn das grün ist, geht der echte Export raus. Zusätzlich haben wir einen Alert-Webhook in unser Incident-Tool angebunden."}
{"ts": "163:20", "speaker": "I", "text": "Gab es bereits Incidents in diesem Pfad?"}
{"ts": "163:23", "speaker": "E", "text": "Nur ein Minor Incident INC-HER-57, bei dem der Dry-Run-Comparator einen Hash-Mismatch meldete. Ursache: unterschiedliche Zeitzonenstempel. Das war in 45 Minuten behoben."}
{"ts": "163:30", "speaker": "I", "text": "Abschließend – wie fließt diese Erfahrung jetzt in Ihre Build-Phase-Entscheidungen ein?"}
{"ts": "163:35", "speaker": "E", "text": "Wir haben in der Build-Phase festgelegt, dass alle neuen Exporte erst die Dry-Run-Pipeline durchlaufen müssen. Das ist ein Trade-off, weil die Builds länger dauern (ca. +12 Minuten pro Job), aber wir akzeptieren das, um SLA-Breach-Risiken zu minimieren, siehe Entscheidung in Arch-Board-Protokoll HER-AB-12."}
{"ts": "164:06", "speaker": "I", "text": "Lassen Sie uns noch mal genauer auf die Schnittstellen zwischen Hera und Helios eingehen. Gibt es aktuell offene Punkte, die die Stabilität der Build-Phase beeinträchtigen?"}
{"ts": "164:14", "speaker": "E", "text": "Ja, es gibt einen bekannten Engpass bei der Event-Queue-Serialisierung. Im internen Ticket HEL-HER-57 ist dokumentiert, dass bei hoher Last die Metadatenübertragung ins Helios Datalake verzögert wird. Wir haben dafür einen Workaround im Runbook-INT-12 festgelegt."}
{"ts": "164:28", "speaker": "I", "text": "Und wie wirkt sich das auf den Testdurchlauf aus?"}
{"ts": "164:33", "speaker": "E", "text": "Das führt zu sporadischen Timeouts in den End-to-End-Tests, insbesondere dort, wo wir Datenintegrität gegen die Datalake-Schemas verifizieren. Wir haben die betroffenen Tests temporär in eine Low-Priority-Queue verschoben, um kritische Pfade nicht zu blockieren."}
{"ts": "164:48", "speaker": "I", "text": "Sie hatten vorhin Aegis IAM erwähnt. Wird im Kontext dieser Schnittstellen auch die Authentifizierungslast ein Problem?"}
{"ts": "164:55", "speaker": "E", "text": "Teilweise, ja. Aegis IAM erzeugt bei jedem Testlauf Token, die in Helios validiert werden. Wenn die Token-Validation-Latenz steigt, kumuliert sich der Effekt. Wir loggen die Latenzwerte im Audit-Log gem. Runbook-AUD-04 und korrelieren diese mit den Testfehlern."}
{"ts": "165:10", "speaker": "I", "text": "Könnten Sie den Zusammenhang zwischen diesen beiden Subsystemen noch einmal multi-hop erklären, also wie eine Störung in IAM die Datenvalidierung im Datalake beeinflusst?"}
{"ts": "165:19", "speaker": "E", "text": "Klar: Wenn Aegis IAM langsamer Tokens ausstellt, blockieren unsere Test-Orchestratoren das Senden der Payload an Helios, weil die Signaturen fehlen. Helios wiederum akzeptiert nur Payloads mit gültigen Tokens. Dadurch stauen sich die Write-Requests, was dann den Flaky-Test-Analyzer triggert, weil er plötzliche Spike-Muster erkennt. Das ist der Multi-Hop-Effekt, den wir auch im Systemdiagramm SYS-HER-03 dokumentiert haben."}
{"ts": "165:42", "speaker": "I", "text": "Verstehe. Und was bedeutet das für Ihre Risikokategorien?"}
{"ts": "165:47", "speaker": "E", "text": "Wir haben die Kategorie 'Integration Performance Risk' eingeführt. Ursprünglich hatten wir nur Security, Functional und Compliance. Integration Performance ist jetzt eine eigene Kategorie, da sie direkten Einfluss auf unsere SLA-Erfüllung hat, siehe POL-QA-014 Anhang B."}
{"ts": "166:01", "speaker": "I", "text": "Das klingt nach einer Anpassung der Teststrategie. Gab es dafür formale Freigaben?"}
{"ts": "166:06", "speaker": "E", "text": "Ja, wir haben ein RFC im internen Change-Board eingereicht, RFC-HER-22. Darin ist die Umpriorisierung von Test-Suites dokumentiert, inklusive der Anpassung der Risk-Based Testing Matrix im Runbook-RBT-10."}
{"ts": "166:19", "speaker": "I", "text": "Welche Kompromisse mussten Sie dabei eingehen?"}
{"ts": "166:23", "speaker": "E", "text": "Wir haben akzeptiert, dass die Abdeckung für weniger kritische UI-Tests temporär sinkt, um Ressourcen für die Integrationstests mit IAM und Helios freizumachen. Begründung und Genehmigung sind im Ticket-HER-312 hinterlegt. Das war ein kalkuliertes Risiko, da die UI-Tests keine sicherheitsrelevanten Fälle abdecken."}
{"ts": "166:40", "speaker": "I", "text": "Gab es Bedenken seitens Compliance?"}
{"ts": "166:44", "speaker": "E", "text": "Ja, aber wir haben gezeigt, dass die SLA-Metriken weiter eingehalten werden. Wir haben eine Sonderprüfung mit dem Compliance-Team gemacht, Audit-Report COM-HER-07, der bestätigt, dass die Qualitätsziele trotz der Prioritätsänderung erfüllt wurden."}
{"ts": "168:30", "speaker": "I", "text": "Lassen Sie uns auf die Risikoanalyse zurückkommen – welche neuen Risikokategorien haben Sie seit der letzten Bewertung ergänzt?"}
{"ts": "168:42", "speaker": "E", "text": "Wir haben zusätzlich zur bestehenden Matrix eine Kategorie für Third-Party-Library-Updates eingeführt, da wir in HER-356 gesehen haben, dass ein Minor-Update bei einer JSON-Parser-Dependency ungeplante Regressionen im Helios-Connector auslöste."}
{"ts": "168:58", "speaker": "I", "text": "Verbirgt sich dahinter auch ein Security-Aspekt oder ist das rein funktional?"}
{"ts": "169:05", "speaker": "E", "text": "Beides: Funktional, weil Schnittstellen-Tests fehlschlugen, und sicherheitsrelevant, da diese Library in der Data-Masking-Logik steckt. Ein Delay beim Patchen würde ein Known Vulnerability Exposure riskieren, siehe Risk-Log-Eintrag RL-HER-19."}
{"ts": "169:22", "speaker": "I", "text": "Wie binden Sie solche Funde in Ihre Teststrategie ein?"}
{"ts": "169:30", "speaker": "E", "text": "Wir erweitern unsere Risk-Based-Testing-Suites um gezielte Regression-Cluster. In Runbook-RBT-14 ist dokumentiert, wie wir bei kritischen Dependencies sofort Smoke-Tests im Staging fahren, bevor wir in die nightly orchestrated pipeline gehen."}
{"ts": "169:48", "speaker": "I", "text": "Sie hatten vorher erwähnt, dass Aegis IAM Tokens auch in den Testdaten auftauchen können. Wie verhindern Sie das jetzt systematisch?"}
{"ts": "169:56", "speaker": "E", "text": "Wir haben in den Data-Generators einen Pre-Sanitization-Hook eingebaut. Der greift vor jedem Commit an den Helios Datalake, validiert gegen RegEx-Pattern aus SecPolicy-SP-12 und entfernt alles, was wie ein JWT oder API-Key aussieht."}
{"ts": "170:15", "speaker": "I", "text": "Und das ist Teil der Compliance-Nachweise?"}
{"ts": "170:22", "speaker": "E", "text": "Ja, wir loggen jeden Sanitization-Run mit Audit-ID und verknüpfen das mit den entsprechenden Test-Runs in unserem Traceability-Tool. So können wir bei einer ISO 27001-Prüfung zeigen, dass keine sensitiven Daten in den Testfluss geraten."}
{"ts": "170:40", "speaker": "I", "text": "Gab es in dieser Build-Phase noch weitere kritische Architekturentscheidungen außer dem Trade-off aus Ticket-HER-243?"}
{"ts": "170:48", "speaker": "E", "text": "Ja, wir haben uns entschieden, die Flaky-Test-Erkennung als separaten Microservice auszulagern, statt sie in den Orchestrator-Kern zu bauen. Das war in RFC-HER-07 beschrieben und wurde wegen Wartbarkeit und Deployment-Flexibilität so umgesetzt."}
{"ts": "171:05", "speaker": "I", "text": "Gab es dabei keine Bedenken hinsichtlich Latenz?"}
{"ts": "171:12", "speaker": "E", "text": "Doch, die gab es. Wir haben das mitigiert, indem wir asynchrone Event-Queues nutzen und im SLA-SLO-Dokument SLO-HER-02 eine Maximalverzögerung von 200ms definiert haben. Messungen in Build 0.9 lagen bisher bei 137ms Peak."}
{"ts": "171:28", "speaker": "I", "text": "Wie werden diese Messwerte dokumentiert und wer sieht sie?"}
{"ts": "171:35", "speaker": "E", "text": "Die Latenzmetriken landen in unserem zentralen Monitoring-Board und werden wöchentlich im QA-Guild-Meeting besprochen. Abweichungen >10% vom SLO triggern automatisch ein Review-Ticket, zum Beispiel HER-389 letzte Woche."}
{"ts": "176:30", "speaker": "I", "text": "Könnten Sie bitte noch einmal konkret erläutern, wie Sie die Traceability zwischen Anforderungen, Testfällen und Defekten sicherstellen?"}
{"ts": "176:38", "speaker": "E", "text": "Ja, wir nutzen dafür unser internes Tool QA-Link, das über eine direkte API an Jira angebunden ist. Jede Anforderung bekommt eine eindeutige HERA-ID, die in den Test-Suites und den Defekt-Tickets wiederverwendet wird. So können wir jederzeit von einer User Story zu den zugehörigen Testfällen und etwaigen Bugs springen."}
{"ts": "176:55", "speaker": "I", "text": "Und wie wird das dann im Rahmen der Build-Phase überprüft?"}
{"ts": "177:02", "speaker": "E", "text": "Wir fahren wöchentliche Traceability-Reports, die mit den Vorgaben aus POL-QA-014 abgeglichen werden. Bei Abweichungen wird automatisch ein Jira-Ticket generiert, etwa wie im Fall HER-317 letzte Woche."}
{"ts": "177:18", "speaker": "I", "text": "Sie hatten vorhin Helios Datalake erwähnt. Gibt es hier besondere Risiken bei der Übergabe von Testdaten?"}
{"ts": "177:25", "speaker": "E", "text": "Ja, absolut. Wir müssen sicherstellen, dass alle Testdaten vor dem Push in Helios durch den Anonymisierungs-Job aus Runbook-DL-05 laufen. Dieser entfernt PII und sensitive Geschäftskennzahlen. Einmal hatten wir einen Incident, ID DL-INC-442, der genau daraus resultierte, dass dieser Schritt übersprungen wurde."}
{"ts": "177:45", "speaker": "I", "text": "Und wie wurde das gelöst?"}
{"ts": "177:50", "speaker": "E", "text": "Wir haben in der CI/CD-Pipeline einen Blocker eingebaut, der den Deployment-Job abbricht, wenn das Anonymisierungsergebnis nicht \"Pass\" zurückgibt. Zusätzlich wurde eine manuelle Review-Pflicht für Sonderfälle eingeführt."}
{"ts": "178:05", "speaker": "I", "text": "Kommen wir zu den Audit-Artefakten – welche werden aktuell vorbereitet?"}
{"ts": "178:12", "speaker": "E", "text": "Wir bereiten für jede Build-Iteration ein Compliance-Paket vor: Enthalten sind die Testabdeckungsberichte, SLA/SLO-Tracking-Tabellen, Security-Scan-Logs und die Liste aller kritischen Defekte mit Status. Diese werden im Archiv HERA-AUD-Store versioniert abgelegt."}
{"ts": "178:29", "speaker": "I", "text": "Gab es in dieser Phase Entscheidungen, die bewusst von den Standards abgewichen sind?"}
{"ts": "178:36", "speaker": "E", "text": "Ja, beim Modul für Flaky Test Analytics haben wir entschieden, anfangs nur die zehn häufigsten Muster zu analysieren, um schneller Feedback zu bekommen. Das weicht von der Vorgabe POL-QA-014 Abschnitt 5.3 ab, wurde aber in Entscheidungsticket HER-278 begründet."}
{"ts": "178:53", "speaker": "I", "text": "Welche Risiken haben Sie dabei einkalkuliert?"}
{"ts": "179:00", "speaker": "E", "text": "Das Hauptrisiko ist, dass seltene, aber kritische Flaky-Patterns unentdeckt bleiben. Wir haben das mitigiert, indem wir quartalsweise eine Vollanalyse fahren, siehe Runbook-RBT-13, und bei kritischen Releases einen manuellen erweiterten Check anfordern."}
{"ts": "179:15", "speaker": "I", "text": "Wie ist die Resonanz aus dem Dev-Team auf diese Kompromisse?"}
{"ts": "179:21", "speaker": "E", "text": "Das Feedback war grundsätzlich positiv, da die schnellere Bereitstellung der Kernfunktionen als wertvoller angesehen wurde. In Retrospektiven wurde jedoch angemerkt, dass die manuelle Zusatzarbeit bei den Vollanalysen besser eingeplant werden muss."}
{"ts": "183:30", "speaker": "I", "text": "Kommen wir noch einmal zurück auf die Integration mit Helios Datalake – gab es unerwartete technische Herausforderungen beim Zusammenspiel mit der Hera QA Platform?"}
{"ts": "183:43", "speaker": "E", "text": "Ja, tatsächlich, wir haben bei den ersten Batch-Läufen festgestellt, dass die Streaming-Ingestion aus Helios unsere Testausführungen verlangsamt hat, weil die Standard-Limits gemäß INF-HEL-12 nicht beachtet wurden. Wir mussten einen dedizierten Test-Connector entwickeln."}
{"ts": "183:59", "speaker": "I", "text": "War das in irgendeiner Form sicherheitsrelevant oder eher ein Performance-Thema?"}
{"ts": "184:07", "speaker": "E", "text": "Primär Performance, aber indirekt sicherheitsrelevant – wenn Testläufe zu lange dauern, verschiebt sich das Zeitfenster für Security-Scans gemäß SLA-Sec-05. Das kann im schlimmsten Fall zu verspäteten Findings führen."}
{"ts": "184:21", "speaker": "I", "text": "Wie haben Sie diese Verzögerung mitigiert?"}
{"ts": "184:26", "speaker": "E", "text": "Wir haben den Connector so angepasst, dass er nur anonymisierte Subsets lädt. Dafür gibt es jetzt ein Pre-Filter-Skript, dokumentiert in Runbook-HEL-Conn-07. Damit reduzieren wir Volumen und halten die Scan-Fenster ein."}
{"ts": "184:42", "speaker": "I", "text": "Und diese Anonymisierung – entspricht sie voll den Unternehmensrichtlinien?"}
{"ts": "184:49", "speaker": "E", "text": "Ja, die Logik ist an die Data-Masking-Richtlinie DM-Policy-03 angelehnt. Wir haben sogar ein internes Audit mit dem InfoSec-Team gemacht, Ticket-HER-301 beschreibt die Abnahme."}
{"ts": "185:05", "speaker": "I", "text": "Gut. Sie sagten vorhin, dass die Authentifizierung über Aegis IAM läuft. Haben Sie dort Anpassungen vorgenommen, um Testautomatisierung zu erleichtern?"}
{"ts": "185:16", "speaker": "E", "text": "Ja, wir nutzen für Test-Suites Service Accounts mit temporären Tokens, generiert via Aegis-API. Das musste in der Hera Orchestrierungs-Engine implementiert werden, siehe Patch-HER-Auth-22."}
{"ts": "185:31", "speaker": "I", "text": "Hatte das Auswirkungen auf die Compliance-Dokumentation?"}
{"ts": "185:37", "speaker": "E", "text": "Ja, weil temporäre Tokens nur 90 Minuten gültig sind, mussten wir in den Testprotokollen Start- und Endzeit explizit erfassen, um bei Audits den Zugriffspfad nachvollziehen zu können. Das steht jetzt in der Checkliste QA-CL-05."}
{"ts": "185:53", "speaker": "I", "text": "Gab es Situationen, in denen diese Token-Logik Probleme verursacht hat?"}
{"ts": "186:00", "speaker": "E", "text": "Einmal ist ein Langläufer-Test abgelaufen, bevor der Token erneuert wurde. Das hat den kritischen Pfad blockiert. Wir haben daraufhin in Runbook-RBT-Token-01 eine automatische Erneuerung dokumentiert."}
{"ts": "186:15", "speaker": "I", "text": "Klingt nach einer spezifischen Lessons Learned. Würden Sie sagen, dass sich der Mehraufwand gelohnt hat?"}
{"ts": "186:22", "speaker": "E", "text": "Ja, weil wir dadurch eine Lücke in der Audit-Trail-Sicherung geschlossen haben. Auch wenn es initial Entwicklungszeit gekostet hat, ist das Risiko einer nicht nachvollziehbaren Testauthentifizierung jetzt praktisch eliminiert."}
{"ts": "192:50", "speaker": "I", "text": "Bevor wir auf die finalen Risiken eingehen, könnten Sie mir nochmal den aktuellen Build-Status der Hera QA Platform nennen, insbesondere in Bezug auf die Sicherheitsprüfungen?"}
{"ts": "193:04", "speaker": "E", "text": "Ja, wir sind bei 82 % Feature-Completion, und die Security-Scans – basierend auf unserem internen Runbook-SCAN-12 – sind für die Kernmodule abgeschlossen. Die letzten beiden Schnittstellen zu Helios Datalake sind noch in der Penetration-Test-Pipeline, geplant für nächste Woche."}
{"ts": "193:26", "speaker": "I", "text": "Sie erwähnten Helios gerade – wie genau werden die Datenverbindungen dort abgesichert?"}
{"ts": "193:39", "speaker": "E", "text": "Das läuft über TLS 1.3 mit mutual auth, und wir nutzen zusätzlich die Token-Verteilung aus Aegis IAM. Wichtig ist hier, dass wir nach Policy SEC-DATA-07 keine personenbezogenen Testdaten in den Datalake leiten; das enforced ein Filtermodul im Hera-Ingest-Service."}
{"ts": "193:58", "speaker": "I", "text": "Gab es bei dieser Integration schon Komplikationen oder unerwartete Abhängigkeiten?"}
{"ts": "194:11", "speaker": "E", "text": "Ja, tatsächlich. Die Token-Refresh-Intervalle von Aegis waren kürzer als unsere Tests dauerten. Wir mussten daher im Test-Orchestrator eine Refresh-Routine implementieren, dokumentiert in Ticket-HER-301 und ergänzt durch Update im Runbook-AUTH-05."}
{"ts": "194:33", "speaker": "I", "text": "Kommen wir zur Risikobewertung: Welche Kategorien haben Sie priorisiert?"}
{"ts": "194:45", "speaker": "E", "text": "Wir arbeiten mit vier Hauptkategorien: Security Breach, Data Integrity Loss, Performance Degradation und Compliance Violation. Jede Kategorie hat eine Gewichtung, wie in der Risk-Matrix aus POL-QA-014 beschrieben."}
{"ts": "195:04", "speaker": "I", "text": "Und wie setzen Sie Risk-Based Testing unter diesen Bedingungen praktisch um?"}
{"ts": "195:17", "speaker": "E", "text": "Wir mappen die gewichteten Risiken auf Testfälle mit hoher Kritikalität. Zum Beispiel werden Szenarien mit potenzieller Data Integrity Loss zuerst automatisiert, bevor weniger relevante Pfade manuell geprüft werden. Das Mapping liegt im Artefakt RBT-MAP-02."}
{"ts": "195:38", "speaker": "I", "text": "Wie halten Sie die Traceability zwischen Anforderungen, Tests und Defects?"}
{"ts": "195:51", "speaker": "E", "text": "Über unser internes Tool TraceLinker. Jede Anforderung aus dem Spec-Dokument HERA-REQ-v1.4 ist mit Testfall-IDs und Defect-IDs verknüpft. Tickets wie HER-315 zeigen diese Chain-of-Custody klar auf."}
{"ts": "196:10", "speaker": "I", "text": "Können Sie Beispiele nennen, wie Sie SLA- und SLO-Vorgaben dokumentieren?"}
{"ts": "196:23", "speaker": "E", "text": "Ja, wir haben ein Dashboard, das die in SLA-QA-2024 festgelegten Response Times und Error Rates in Echtzeit anzeigt. Monatliche Reports werden als Audit-Artefakte in Conformity-Repo abgelegt, referenziert in AuditLog-#556."}
{"ts": "196:44", "speaker": "I", "text": "Abschließend: Gab es noch weitere Trade-offs, die Sie dokumentiert haben?"}
{"ts": "196:57", "speaker": "E", "text": "Ja, beim Load-Testing mussten wir auf umfassende Szenarien verzichten, um die Build-Deadline zu halten. Dokumentiert in HER-329 und im Abschnitt 'Performance Scope Cut' von Runbook-RBT-09, mit klarer Risikoakzeptanz durch das Lenkungsgremium."}
{"ts": "200:10", "speaker": "I", "text": "Kommen wir zurück zu den sicherheitsrelevanten Anforderungen – gab es seit letzter Woche Änderungen in den Policies, die die Hera QA Platform betreffen?"}
{"ts": "200:24", "speaker": "E", "text": "Ja, die interne Richtlinie SEC-PL-202 wurde leicht angepasst, insbesondere beim Logging von Authentifizierungsversuchen. Wir mussten unser Test-Logging-Modul anpassen, um keine Maskierungs-Lücken bei den Aegis IAM Token zu lassen."}
{"ts": "200:46", "speaker": "I", "text": "Und wie schnell konnten Sie das ins Build integrieren?"}
{"ts": "200:53", "speaker": "E", "text": "Innerhalb von zwei Tagen, dank eines vorbereiteten Hooks aus Runbook-SEC-11. Das beschreibt genau, wie wir sensitive Felder in Testdaten anonymisieren, bevor sie in den Helios Datalake geschrieben werden."}
{"ts": "201:15", "speaker": "I", "text": "Das klingt reibungslos. Gab es trotzdem Nebeneffekte auf die Performance?"}
{"ts": "201:23", "speaker": "E", "text": "Minimal, etwa 3 % längere Laufzeiten in den orchestrierten Testsuiten. Die Hashing-Operation für Tokenmaskierung ist CPU-bound, aber im Build-Cluster noch im akzeptablen Rahmen laut SLO-QA-03."}
{"ts": "201:44", "speaker": "I", "text": "Sie hatten vorhin die Traceability erwähnt – wie genau wird die Verbindung zwischen Anforderungen, Testfällen und Defects im aktuellen Stand gepflegt?"}
{"ts": "201:56", "speaker": "E", "text": "Wir nutzen das interne Tool TraceLinker. Jedes Requirement aus dem Hera-Backlog bekommt ein ID-Tag, das in die TestCase-Datenbank übernommen wird. Bei Defects wie in Ticket-HER-301 wird automatisch das Requirement verlinkt. Das ist Teil des Compliance-Katalogs nach POL-QA-014."}
