{"ts": "00:00", "speaker": "I", "text": "Können Sie mir kurz erläutern, wie Sie die Risk-Based Testing Policy, äh, POL-QA-014, konkret auf Hera anwenden?"}
{"ts": "04:55", "speaker": "E", "text": "Ja, gern. Also, in der Build-Phase nutzen wir POL-QA-014 als Rahmen, um Testfälle nach Business Impact und technischer Kritikalität zu priorisieren. Für Hera heißt das: API-Endpoints mit direktem Zugriff auf Auth-Module bekommen automatisch eine höhere Gewichtung, vor allem wenn sie in den SLA-Kategorien 1 oder 2 liegen. We also tag these scenarios in our orchestration engine so that any change triggers a mandatory security regression suite."}
{"ts": "09:30", "speaker": "I", "text": "Welche Haupt-Schnittstellen haben Sie zu anderen Abteilungen wie Security oder SRE?"}
{"ts": "14:15", "speaker": "E", "text": "Mit Security arbeiten wir eng über das wöchentliche Secure Testing Sync-Meeting zusammen, da fließen Findings direkt in unsere Test-Sets. Mit SRE gibt es ein Incident-Channel im internen Chat, wo wir bei Test-Orchestrator-Ausfällen sofort eskalieren. Additionally, SRE feeds us telemetry from production-like staging environments, which we use to adjust flaky test thresholds."}
{"ts": "18:40", "speaker": "I", "text": "How do you balance speed of test orchestration with the safety-first value?"}
{"ts": "23:20", "speaker": "E", "text": "Das ist immer ein Trade-off. Wir nutzen einen zweistufigen Ansatz: schnelle Smoke- und Contract-Tests laufen in unter 20 Minuten, um Developer-Feedback zu geben, und parallel dazu eine Full-Regressions-Pipeline über Nacht. Safety-first bleibt gewahrt, weil kritische Checks (aus POL-QA-014) immer in der schnellen Stage sind. In other words, we never skip tier-1 security validations."}
{"ts": "28:05", "speaker": "I", "text": "Wie stellen Sie sicher, dass sicherheitsrelevante Regressionen in der Test-Orchestrierung früh erkannt werden?"}
{"ts": "33:10", "speaker": "E", "text": "Wir haben Sentinel-Jobs im Orchestrator, die speziell für Security-Regressionen gebaut sind. Die ziehen sich die letzten 5 Builds und vergleichen die Ergebnisse von sicherheitskritischen Tests. Außerdem wird jeder Commit, der einen Codebereich mit Label 'SEC-HIGH' betrifft, automatisch in einen isolierten Build mit verstärktem Logging geschickt. That allows us to spot anomalies before they reach merge."}
{"ts": "38:00", "speaker": "I", "text": "Can you walk me through how you link test cases to specific RFCs or SLAs for traceability?"}
{"ts": "42:45", "speaker": "E", "text": "Jeder Testfall bekommt in unserem Test-Repository ein Metafeld 'linked_artifact'. Dort referenzieren wir RFC-IDs wie RFC-HER-032 oder SLA-IDs wie SLA-HER-1.2. The orchestration engine then enforces that any change to an RFC automatically flags all linked tests for re-run, ensuring traceability and compliance."}
{"ts": "47:20", "speaker": "I", "text": "Welche Maßnahmen treffen Sie, um Flaky Tests zu identifizieren und deren Risiko zu bewerten?"}
{"ts": "52:15", "speaker": "E", "text": "Wir aggregieren historische Testergebnisse in einem Flakiness-Dashboard. Tests mit >5% intermittierenden Fehlern werden markiert und in eine Quarantäne-Queue verschoben. In dieser Queue wird das Risiko anhand des betroffenen Moduls und der SLA-Kategorie bewertet. For example, a flaky test on the Hera-Gateway adapter with SLA-1 is treated more urgently than one on a low-impact reporting module."}
{"ts": "57:05", "speaker": "I", "text": "Gibt es Testfälle in Hera, die direkt Abhängigkeiten zu Gateway- oder IAM-Komponenten prüfen?"}
{"ts": "62:50", "speaker": "E", "text": "Ja, wir haben die Suite 'CrossSys-GW-IAM' im Orchestrator, die Szenarien wie Token-Validation über das Orion Edge Gateway bis ins Aegis IAM prüft. Diese Tests nutzen simulierte End-to-End-Flows mit Mocked Latencies, um auch Performance-Aspekte zu sehen. And when Orion's API schema changes, these tests are auto-triggered to catch integration breaks."}
{"ts": "68:10", "speaker": "I", "text": "How do you coordinate with other teams when a cross-system bug is found, e.g., impacting RB-GW-011 and RB-IAM-075?"}
{"ts": "90:00", "speaker": "E", "text": "Wenn so ein Bug auftaucht, öffnen wir einen Cross-Project Incident in unserem Tracker, verlinken die betroffenen Runbooks RB-GW-011 und RB-IAM-075, und laden die Tech-Leads beider Projekte in ein Ad-hoc-War-Room-Meeting ein. We also attach recent orchestration logs and failing test artifacts, so that root cause analysis can start immediately. This reduces time-to-fix while preserving a clear audit trail."}
{"ts": "90:00", "speaker": "I", "text": "Lassen Sie uns, äh, tiefer in einen konkreten Cross-System Bug gehen—können Sie ein Beispiel nennen, das sowohl Hera als auch das Orion Edge Gateway betroffen hat?"}
{"ts": "90:05", "speaker": "E", "text": "Ja, klar. Im März hatten wir einen Defekt, ID BUG-HER-218, der bei einer bestimmten API-Handshake-Sequenz den Payload falsch serialisierte. Auf Gateway-Seite wurde das als RB-GW-011 gemappt, und das IAM-System, also Aegis, hat dann Auth-Token verworfen."}
{"ts": "90:15", "speaker": "I", "text": "And how did you guys coordinate between three teams on that?"}
{"ts": "90:21", "speaker": "E", "text": "Wir haben ein gemeinsames Incident Bridge Call-Format, das im Runbook RB-INC-004 beschrieben ist. Daraus ergibt sich, dass QA-Leads die Testreihenfolge abstimmen—erst Fix im Hera Branch validieren, dann gegen Orion Edge Regression Suite fahren, schließlich den IAM Smoke-Test."}
{"ts": "90:33", "speaker": "I", "text": "Gab es dabei Probleme mit der Traceability der Tests zu den jeweiligen RFCs?"}
{"ts": "90:39", "speaker": "E", "text": "Ja, teilweise. RFC-HER-045 war im Hera-Testfall verlinkt, aber Orion hatte nur einen generischen SLA-Check. Wir mussten manuell im Test-Orchestrator das Mapping ergänzen, damit alle drei Artefakte im Audit-Log auftauchen."}
{"ts": "90:52", "speaker": "I", "text": "Das klingt nach hohem manuellen Aufwand. Any undocumented heuristics you applied to decide which cross-project tests to run first?"}
{"ts": "90:59", "speaker": "E", "text": "In solchen Fällen priorisiere ich nach 'Blast Radius'. Das ist intern so ein Bauchgefühl-Score: Welche Komponente hat die meisten Downstream-Calls? Gateway war hier zuerst, weil es fünf Consumer-Services hat, Hera nur zwei."}
{"ts": "91:12", "speaker": "I", "text": "Und wie dokumentieren Sie diese Bauchentscheidungen, falls später jemand im Audit fragt?"}
{"ts": "91:18", "speaker": "E", "text": "Wir hängen eine kurze Notiz im Jira-Ticket an, mit Tag HEUR-DECISION, und verlinken auf ein internes Confluence-Page, wo die Heuristik erklärt ist. Nicht perfekt, aber auditierbar genug laut QA-Governance."}
{"ts": "91:31", "speaker": "I", "text": "Did this approach ever conflict with the Safety-First value you mentioned earlier?"}
{"ts": "91:36", "speaker": "E", "text": "Manchmal ja. Zum Beispiel bei einem Aegis-IAM-Bug RB-IAM-075 war der Blast Radius gering, aber Security-Risiko hoch. Da haben wir die Heuristik überstimmt und Security-Tests sofort gefahren."}
{"ts": "91:48", "speaker": "I", "text": "Das heißt, Sie mischen harte Policies mit flexiblen Heuristiken?"}
{"ts": "91:53", "speaker": "E", "text": "Genau. Policies wie POL-QA-014 geben den Rahmen, und die Heuristiken füllen die Lücken, wenn Policies nicht granular genug sind."}
{"ts": "92:02", "speaker": "I", "text": "Und wie schnell schaffen Sie es, solche Cross-System Bugs zu retesten once a fix is deployed?"}
{"ts": "92:08", "speaker": "E", "text": "Unser Ziel laut SLA-QA-002 ist unter 4 Stunden. In dem März-Fall waren wir bei 3 Stunden 40, weil wir den Hera-Orion-IAM-Chain-Test als vorgefertigtes Orchestrator-Template hatten."}
{"ts": "98:00", "speaker": "I", "text": "Wir hatten vorhin schon die Cross-System Bugs besprochen. Können Sie mir jetzt ein Beispiel nennen, wo Sie bei Hera zwischen Abdeckung und schneller Auslieferung abwägen mussten?"}
{"ts": "98:18", "speaker": "E", "text": "Ja, äh, im Sprint 14 stand der Release-Druck hoch, weil der Kunde für das Staging-Environment ein GoLive-Fenster von nur 48 Stunden hatte. We had a set of 27 low-priority regression tests for the analytics module, die wir laut POL-QA-014 eigentlich hätten fahren müssen."}
{"ts": "98:44", "speaker": "I", "text": "Und wie sind Sie da vorgegangen?"}
{"ts": "98:50", "speaker": "E", "text": "Wir haben anhand des Risk Matrix Templates aus Runbook QA-RB-022 bewertet: likelihood low, impact low, keine sicherheitskritischen Pfade. So konnten wir justified skip dokumentieren und nur smoke + high-risk tests fahren."}
{"ts": "99:12", "speaker": "I", "text": "Welche Evidenz haben Sie dafür abgelegt?"}
{"ts": "99:18", "speaker": "E", "text": "Ticket QA-HER-451 im Jira-Board, angehängt das ausgefüllte Risk Matrix PDF und ein Verweis auf Audit-Log AL-HER-09. Plus ein Kommentar mit Link auf das SLA-Dokument SLA-HER-2023-04, das die minimal required coverage definiert."}
{"ts": "99:42", "speaker": "I", "text": "War das alles auch im Nachhinein auditierbar?"}
{"ts": "99:48", "speaker": "E", "text": "Ja, wir halten diese Artefakte im Confluence Space HER-QA, Section 'Release Exceptions'. Auditors können per Filter 'exception:true' alle Fälle nachvollziehen. Zusätzlich haben wir im Change Record CR-HER-78 die Time-to-Market Begründung vermerkt."}
{"ts": "100:12", "speaker": "I", "text": "Gab es intern Kritik an dieser Entscheidung?"}
{"ts": "100:18", "speaker": "E", "text": "Ein Teil des Security-Teams war skeptisch, weil historic data zeigt, dass einige low-prio analytics tests doch mal security side-effects uncovered haben. We addressed that by scheduling them in the immediate post-release regression cycle."}
{"ts": "100:42", "speaker": "I", "text": "Das heißt, Sie haben die Tests einfach verschoben?"}
{"ts": "100:48", "speaker": "E", "text": "Genau, wir haben im Test Orchestration Plan (TOP-HER-05) einen delayed execution slot definiert, 24h nach GoLive. Damit blieb die SLA-Compliance bei critical tests erhalten, und wir konnten das Releasefenster nutzen."}
{"ts": "101:10", "speaker": "I", "text": "Wie dokumentieren Sie solche Trade-offs allgemein?"}
{"ts": "101:16", "speaker": "E", "text": "Es gibt ein Template 'Decision Log QA-DL-Template-v3', where we capture context, options, risk assessment, chosen path, und die Reviewer. Das ist ein ungeschriebenes Gesetz hier: keine mündliche Ausnahme ohne Decision Log."}
{"ts": "101:38", "speaker": "I", "text": "Und wenn später ein ähnlicher Fall auftritt?"}
{"ts": "101:44", "speaker": "E", "text": "Dann referenzieren wir die Decision Log ID, z.B. DL-HER-14, im neuen Ticket. That way, wir sparen uns die komplette Neubewertung und können nur die veränderten Parameter analysieren."}
{"ts": "114:00", "speaker": "I", "text": "Lassen Sie uns jetzt konkret auf die Entscheidung eingehen, die Sie vergangene Woche getroffen haben, als das Build-Fenster auf 48 Stunden verkürzt wurde."}
{"ts": "114:06", "speaker": "E", "text": "Ja, das war heikel. Wir mussten den Regression-Block von 320 auf 190 Testfälle reduzieren, basierend auf der Risk-Based Testing Policy POL-QA-014."}
{"ts": "114:14", "speaker": "I", "text": "Und wie haben Sie das konkrete Set ausgewählt?"}
{"ts": "114:18", "speaker": "E", "text": "Ich habe mich auf die Risk Matrix aus Runbook RB-HER-RT-07 gestützt und zusätzlich die Flaky-Score-Daten aus der letzten Woche eingerechnet, um high-risk Bereiche zu priorisieren."}
{"ts": "114:28", "speaker": "I", "text": "Could you give an example where that prioritization clearly avoided a critical issue?"}
{"ts": "114:33", "speaker": "E", "text": "Sure, the IAM session expiry test set HER-IAM-SEC-12 caught a misconfigured token lifetime; without it, we'd have shipped with a 24h instead of 2h expiry."}
{"ts": "114:44", "speaker": "I", "text": "Und das war ein Cross-Project Bug, korrekt?"}
{"ts": "114:48", "speaker": "E", "text": "Richtig, es war in RFC-IAM-075 dokumentiert und betraf auch Orion Gateway, da die Session-Validation dort durchgereicht wird."}
{"ts": "114:56", "speaker": "I", "text": "Wie haben Sie das in der Kürze koordiniert?"}
{"ts": "115:00", "speaker": "E", "text": "Wir haben unser Incident Bridge Protocol aus Runbook RB-XSYS-INC-03 aktiviert, SRE und Security sofort hinzugezogen, und das Ticket HER-BUG-442 mit den relevanten Logs aus den QA-Pipelines verknüpft."}
{"ts": "115:12", "speaker": "I", "text": "Gab es Diskussionen über die Auditierbarkeit dieser Entscheidung?"}
{"ts": "115:16", "speaker": "E", "text": "Ja, das Audit-Team hat im wöchentlichen Review explizit nach der Begründung gefragt; wir haben die Jira-Historie, Slack-Threads und die Test-Auswahl-CSV als Evidenz archiviert."}
{"ts": "115:26", "speaker": "I", "text": "Would you say such reduced scopes are becoming more common under current release pressure?"}
{"ts": "115:31", "speaker": "E", "text": "Yes, unfortunately. Deshalb pushen wir für automatisierte Risk-Scoring in Hera, um diese Entscheidungen schneller, aber nachvollziehbar zu machen."}
{"ts": "115:40", "speaker": "I", "text": "Und welche Risiken sehen Sie, falls dieses automatisierte Scoring fehlerhaft wäre?"}
{"ts": "115:45", "speaker": "E", "text": "Dann könnten Low-Risk-Bereiche fälschlich depriorisiert werden und kritische Bugs durchrutschen; deshalb haben wir im RFC-HER-AT-02 einen zweistufigen manuellen Review der Top-20 Testfälle verankert."}
{"ts": "116:00", "speaker": "I", "text": "Kommen wir noch einmal zurück auf die Schnittstelle zu SRE. Wie integrieren Sie im Hera Build-Phase-Kontext die Eskalationspfade, wenn ein orchestrierter Test eine kritische Latenzabweichung zeigt?"}
{"ts": "116:10", "speaker": "E", "text": "Also, wir haben da einen klaren Flow im Runbook RB-HER-QA-052 definiert. Sobald eine Latenz >15% über dem SLA-QA-003 liegt, triggert unser Orchestrator einen Alert an den SRE-Channel im internen Chat. Then, the duty SRE checks the related Grafana panel and opens a TEMP ticket in JIRA-HER with the label 'latency-critical'."}
{"ts": "116:27", "speaker": "I", "text": "Und wie stellen Sie sicher, dass dieser Prozess nicht im Tagesgeschäft untergeht?"}
{"ts": "116:33", "speaker": "E", "text": "Wir haben weekly standups, in denen ein QA-Engineer die offenen 'latency-critical'-Tickets reviewed. Zusätzlich enforce ich in POL-QA-014, dass kein Release-Tag gesetzt werden darf, solange solche Tickets offen sind. That’s a hard gate, so teams respect it."}
{"ts": "116:50", "speaker": "I", "text": "In der Mitte des Projekts hatten wir einige Cross-System Bugs. Können Sie ein Beispiel nennen, wie Sie mit Orion Edge Gateway zusammenarbeiten mussten?"}
{"ts": "116:59", "speaker": "E", "text": "Ja, der Vorfall mit Bug-ID RB-GW-011 war prägnant. Our flaky test detector in Hera flagged intermittent failures in the TLS handshake sequence. Upon root cause, we saw Orion's gateway firmware pushing an outdated cipher suite. Wir haben dann ein gemeinsames Patch-Testing mit dem Orion-Team gefahren, documented in Testlink suite HER-TLS-042."}
{"ts": "117:20", "speaker": "I", "text": "Das heißt, Sie mussten zwei Orchestratoren koppeln?"}
{"ts": "117:25", "speaker": "E", "text": "Genau. Wir haben einen temporären Bridge-Job in Jenkins eingerichtet, der Hera-Suites und Orion-Integrationstests sequenziell ausführt. This ensured the patched gateway was validated before IAM dependencies were touched."}
{"ts": "117:39", "speaker": "I", "text": "Und wie kam IAM ins Spiel?"}
{"ts": "117:44", "speaker": "E", "text": "Das Aegis IAM nutzte dieselbe TLS-Library. Nachdem wir den Gateway-Patch geprüft hatten, haben wir via Cross-Project Testplan HER-IAM-009 verifiziert, dass die Auth flows nicht regressieren. Only then we closed RB-IAM-075."}
{"ts": "117:59", "speaker": "I", "text": "Gab es dafür formelle Koordinationsmeetings oder eher Ad-hoc?"}
{"ts": "118:05", "speaker": "E", "text": "Mix aus beidem. Wir haben ein wöchentliches Cross-Project QA Sync, aber in dem Fall haben wir eine adhoc war room im Videochat gestartet. This was critical to meet the release window without cutting corners."}
{"ts": "118:19", "speaker": "I", "text": "Zum Abschluss: Beschreiben Sie bitte eine späte Entscheidung in Hera, bei der Sie bewusst Risiko in Kauf genommen haben."}
{"ts": "118:26", "speaker": "E", "text": "Kurz vor dem Beta-Release hatten wir 12 Low-Priority Flaky Tests. Ich habe entschieden, diese nicht zu stabilisieren, um zwei Tage zu sparen. Die Begründung liegt in Ticket HER-QA-889, supported by Runbook deviation log DEV-HER-014. Ich habe das Risiko als akzeptabel eingeschätzt, da kein sicherheitskritischer Pfad betroffen war."}
{"ts": "118:45", "speaker": "I", "text": "Wie wurde diese Entscheidung dokumentiert, um sie auditierbar zu halten?"}
{"ts": "118:51", "speaker": "E", "text": "Ich habe eine Decision Record im Confluence-Bereich 'Hera QA Governance' erstellt, mit Links zu den betroffenen Testfällen, den Slack-Threads und den Auszügen aus POL-QA-014. That way, any future audit can trace the rationale and context precisely."}
{"ts": "124:00", "speaker": "I", "text": "Wenn wir jetzt noch mal auf die Multi-Projekt-Abhängigkeiten schauen – können Sie ein aktuelles Beispiel nennen, bei dem Hera Tests eine direkte Auswirkung auf das Orion Edge Gateway hatten?"}
{"ts": "124:06", "speaker": "E", "text": "Ja, klar, äh, wir hatten letzte Woche ein Fail in Test-Suite HERA-INT-072. Das hat eine API-Änderung im Gateway-Service aufgedeckt, die in RFC-GW-223 beschrieben war. Ohne die Cross-Project Pipeline wäre das erst in der Staging-Phase aufgefallen."}
{"ts": "124:17", "speaker": "I", "text": "And how did you detect it that early?"}
{"ts": "124:21", "speaker": "E", "text": "Wir nutzen im Hera Orchestrator ein Dependency-Mapping-Modul. Das matched Testfälle automatisch mit den zugehörigen Komponenten aus anderen Projekten – in diesem Fall hat das Mapping den neuen Gateway-Endpoint erkannt und den Regression-Trigger ausgelöst."}
{"ts": "124:33", "speaker": "I", "text": "Gab es eine spezielle Koordination mit dem Gateway-Team?"}
{"ts": "124:36", "speaker": "E", "text": "Yes, after the failure we created ticket QA-CROSS-558. Wir haben einen Hotfix-Test in deren CI eingefügt, basierend auf unserem Runbook RB-CROSS-04. So konnten wir innerhalb von 4 Stunden die Ursache im Gateway-Code isolieren."}
{"ts": "124:48", "speaker": "I", "text": "Welche nicht dokumentierten Heuristiken haben Sie dabei genutzt?"}
{"ts": "124:52", "speaker": "E", "text": "Ehrlich gesagt, wir schauen oft auf die Fehler-Historie des letzten Quartals. Wenn ein Modul mehr als zwei kritische Incidents in 90 Tagen hatte, erhöhen wir automatisch die Priorität solcher Cross-Tests – das steht so nicht im offiziellen POL-QA-014, ist aber gelebte Praxis."}
{"ts": "125:04", "speaker": "I", "text": "That sounds like a risk-based shortcut. How do you justify it to audits?"}
{"ts": "125:09", "speaker": "E", "text": "Wir loggen diese Priorisierung im Evidence-Tab des Test Management Tools. Dort hängen wir einen Screenshot der Incident-Statistik und den Verweis auf das interne Heuristik-Dokument HINT-QA-3 an. So haben wir bei Audits eine klare Begründung."}
{"ts": "125:21", "speaker": "I", "text": "Und wie wirken sich solche priorisierten Tests auf die Build-Zeit aus?"}
{"ts": "125:25", "speaker": "E", "text": "They do add about 12% to orchestration time. Aber wir kompensieren das durch Parallelisierung in den Kubernetes Test Pods, referenziert in Runbook RB-HERA-DEP-11."}
{"ts": "125:35", "speaker": "I", "text": "Gibt es ein Risiko, dass dadurch andere Projekte wie Aegis IAM zu kurz kommen?"}
{"ts": "125:39", "speaker": "E", "text": "Ja, potenziell. Deshalb haben wir eine wöchentliche Cross-QA-Sync, in der wir alle offenen Cross-Tickets wie QA-CROSS-558, RB-GW-011 und RB-IAM-075 durchgehen und notfalls die Test-Slots rotieren."}
{"ts": "125:50", "speaker": "I", "text": "How do you decide when to rotate slots?"}
{"ts": "125:54", "speaker": "E", "text": "Das ist meist eine Kombination aus SLA-Druck – wenn ein SLA wie SLA-IAM-202 verletzt zu werden droht – und dem Severity-Score aus unserem Risk Engine Modul. Severity 8+ bekommt Priorität, documented in QA-RISK-LOG."}
{"ts": "128:00", "speaker": "I", "text": "Lassen Sie uns nochmal zu den Cross-Project Dependencies zurückkommen. Wie genau haben Sie bei Hera die Schnittstellen zum Orion Edge Gateway getestet, ohne die eigenen Pipelines zu blockieren?"}
{"ts": "128:20", "speaker": "E", "text": "Wir haben dafür im Build-Phase-Plan die sogenannten *asynchronous smoke contracts* eingerichtet. Die laufen parallel zu Hera’s Core-Suites und triggern nur die Gateway-Endpoints, die laut RB-GW-011 in der letzten RFC-Review geändert wurden. Dadurch konnten wir parallelisieren, ohne den Hera-CI zu stoppen."}
{"ts": "128:44", "speaker": "I", "text": "Und wie haben Sie sichergestellt, dass Security-Teams über relevante Findings sofort informiert werden?"}
{"ts": "129:00", "speaker": "E", "text": "Wir haben im Runbook QA-HERA-SEC-07 eine Webhook-Integration mit dem SecOps-Channel definiert. Wenn ein Smoke-Test ein Policy-Violation-Pattern erkennt, wird automatisch ein Ticket im SEC-Jira-Projekt erstellt, z.B. SEC-4712, und mit der entsprechenden RFC-ID verknüpft."}
{"ts": "129:28", "speaker": "I", "text": "Das heißt, Sie mappen die Testfälle direkt zu RFCs. Wie granular ist dieses Mapping?"}
{"ts": "129:42", "speaker": "E", "text": "Relativ granular. Jeder kritische Testfall trägt im Meta-Tag die RFC-Nummer und die SLA-Kategorie. For example, a load test on the IAM login endpoint will be tagged both with RFC-IAM-075 and SLA-P1. Damit können wir in der Traceability-Matrix sofort sehen, welche SLAs betroffen sind, wenn ein Test bricht."}
{"ts": "130:10", "speaker": "I", "text": "Gab es Situationen, wo dieses Mapping zu false positives geführt hat?"}
{"ts": "130:24", "speaker": "E", "text": "Ja, gelegentlich. Especially when RFC descriptions are too broad. In solchen Fällen nutzen wir eine interne Heuristik – wir prüfen den letzten Commit-Diff und filtern Tests, die nur peripher betroffen sind."}
{"ts": "130:46", "speaker": "I", "text": "Wie gehen Sie mit Flaky Tests um, die in solchen Cross-Projekt-Kontexten auftauchen?"}
{"ts": "131:00", "speaker": "E", "text": "Wir isolieren sie zunächst in eine quarantine suite. Dort laufen sie dreimal hintereinander unter identischen Bedingungen. If the failure repro rate is over 50%, they are flagged in the Flaky Risk Dashboard, das Teil der Hera QA-Platform ist."}
{"ts": "131:28", "speaker": "I", "text": "Und dieses Dashboard wird auch von anderen Projekten genutzt?"}
{"ts": "131:40", "speaker": "E", "text": "Genau, Orion und Aegis-Teams haben Read-Access. So können sie sehen, ob ein Test, der ihre Komponenten berührt, aktuell stabil ist. Das reduziert den Koordinationsaufwand erheblich."}
{"ts": "132:02", "speaker": "I", "text": "Können Sie ein Beispiel für einen Trade-off geben, den Sie in so einem Kontext machen mussten?"}
{"ts": "132:18", "speaker": "E", "text": "Klar. Einmal hatten wir ein kritisches Gateway-Update (RB-GW-022) und nur 48 Stunden bis zum Release-Freeze. We decided to skip two low-priority regression suites on Hera, documented in Ticket QA-HERA-882, und haben die Entscheidung im Audit-Log mit Verweis auf das Risk Acceptance Document RAD-2023-09 hinterlegt."}
{"ts": "132:50", "speaker": "I", "text": "Gab es dafür später ein Audit?"}
{"ts": "133:00", "speaker": "E", "text": "Ja, drei Wochen später im Quarterly QA Audit. Das Team konnte anhand des Audit-Logs und der verlinkten Runbooks nachvollziehen, warum wir den Scope reduziert hatten und dass die Risiken akzeptabel waren."}
{"ts": "144:00", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die Cross-System Bugs zurückkommen – wie genau identifizieren Sie im Hera-Setup Abhängigkeiten, die z. B. auch das Orion Edge Gateway betreffen?"}
{"ts": "144:05", "speaker": "E", "text": "Also, wir nutzen im Build-Phase-Kontext eine Dependency-Matrix, die wir wöchentlich aktualisieren. Die ist in ConCheck eingebettet und markiert P-HER Tests, die RFC-IDs wie RFC-GW-221 referenzieren. Dadurch sehen wir sofort, wenn ein Hera-Test einen Gateway-Endpoint berührt."}
{"ts": "144:12", "speaker": "I", "text": "And when such a dependency fails, do you have an automatic escalation path to those teams?"}
{"ts": "144:16", "speaker": "E", "text": "Yes, wir haben eine automatische Rule im Orchestrator: Wenn ein Testfall mit Tag cross-gateway fehlschlägt, wird automatisch ein Ticket Typ BUG-XSYS angelegt, z. B. BUG-XSYS-1427, und der SRE-Lead des Gateways bekommt Slack- und E-Mail-Alerts."}
{"ts": "144:24", "speaker": "I", "text": "Wie ist das mit IAM-Komponenten, gerade in Bezug auf RB-IAM-075?"}
{"ts": "144:28", "speaker": "E", "text": "Wir haben für IAM eine ähnliche Regel. Zusätzlich gibt es im Runbook RBK-HER-IAM-03 den Schritt, wie wir bei Auth-Flows vorgehen: Temporäre Staging-User anlegen, Replay der Testsequenz, dann Vergleich der Audit-Logs."}
{"ts": "144:36", "speaker": "I", "text": "Sounds like a lot of coordination overhead. How do you avoid bottlenecks here?"}
{"ts": "144:40", "speaker": "E", "text": "Wir haben einen wöchentlichen Cross-QA-Sync, 30 Minuten, strictly time-boxed. Und wir fahren bei kritischen Defects eine fast-lane Policy – das heißt, wir dürfen temporär weniger Regression Suites fahren, wenn die SLA P1<4h sonst gerissen würde."}
{"ts": "144:48", "speaker": "I", "text": "Sie sprachen vorhin von nicht dokumentierten Heuristiken. Können Sie ein Beispiel geben?"}
{"ts": "144:53", "speaker": "E", "text": "Klar, intern sagen wir oft: 'If two unrelated modules fail within 24h, check the shared infra first.' Das steht so nicht in POL-QA-014, aber wir haben aus Erfahrungswerten gelernt, dass es oft ein Queue- oder Cache-Problem ist."}
{"ts": "145:01", "speaker": "I", "text": "Interesting. And do you document when you apply this heuristic?"}
{"ts": "145:05", "speaker": "E", "text": "Ja, wir loggen das im Incident-Postmortem unter 'Investigation Path'. Zum Beispiel im Postmortem INC-HER-2024-055 haben wir genau diese Heuristik protokolliert und konnten so justify, warum wir nicht erst alle Unit-Tests durchlaufen haben."}
{"ts": "145:13", "speaker": "I", "text": "Wie gehen Sie mit der Traceability um, wenn Sie Tests reduzieren, aber später ein Audit ansteht?"}
{"ts": "145:18", "speaker": "E", "text": "Wir hängen die Entscheidung an das entsprechende Jira-Ticket, z. B. RISK-ACCEPT-HER-019. Dort verlinken wir die betroffenen Test-Suites, den Grund für die Reduktion, und den genehmigenden Product Owner. Das Audit-Team zieht sich diese Infos direkt."}
{"ts": "145:26", "speaker": "I", "text": "And what's the trade-off you see most often between Orion and Hera testing cycles?"}
{"ts": "145:30", "speaker": "E", "text": "Most often it's der Release-Takt: Orion rollt alle zwei Wochen, Hera alle drei. Wenn Orion einen Patch braucht, müssen wir Hera teilweise 'fast-forwarden', was heißt, wir skippen low-risk tests, guided by RBT Score <0.2 from POL-QA-014 Appendix C."}
{"ts": "146:00", "speaker": "I", "text": "Lassen Sie uns nochmal konkret auf die Cross-System Bugs eingehen – im Hera-Kontext, wie dokumentieren Sie die Root Cause Analysis, wenn sowohl Gateway- als auch IAM-Module betroffen sind?"}
{"ts": "146:05", "speaker": "E", "text": "Also, wir nutzen dafür primär das RCA-Template aus RUN-QA-042, das hat separate Sections für jedes betroffene Subsystem. Ich schreibe den initialen Befund meist auf Deutsch, aber die technischen Details, especially stack traces, dokumentieren wir in English, damit auch die SRE in Dublin das verstehen."}
{"ts": "146:14", "speaker": "I", "text": "Und wie verbinden Sie das dann mit den bestehenden SLAs?"}
{"ts": "146:18", "speaker": "E", "text": "Wir haben im Jira-Workflow ein Pflichtfeld 'SLA-Ref', da trage ich z.B. SLA-HER-SEC-05 ein, wenn es eine Security-Reponse-Time betrifft. Dadurch können wir später im Audit-Log nachvollziehen, ob wir innerhalb der agreed 48h Response geblieben sind."}
{"ts": "146:27", "speaker": "I", "text": "Gibt's dafür auch eine Art Abgleich mit den Testorchestrierungsplänen?"}
{"ts": "146:31", "speaker": "E", "text": "Ja, wir haben ein Mapping-Skript, das nightly läuft und die Testplan-IDs mit den SLA-Refs verknüpft. So sehen wir, wenn ein SLA-gebundener Testfall plötzlich flaky wird."}
{"ts": "146:39", "speaker": "I", "text": "Speaking of flaky, haben Sie ein recent Beispiel, wo ein flaker Test in Hera einen Cross-Project Impact hatte?"}
{"ts": "146:44", "speaker": "E", "text": "Ja, Test HER-GW-INT-22 war so einer. Er prüft JWT-Token-Handling zwischen Hera und Orion Gateway. Der ist sporadisch fehlgeschlagen wegen einer Race Condition in der Token Renewal Logik. Das hat uns gezwungen, Runbook RB-GW-011P zu aktualisieren."}
{"ts": "146:55", "speaker": "I", "text": "Und wie haben Sie entschieden, ob Sie den Test vorübergehend deaktivieren oder fixen?"}
{"ts": "147:00", "speaker": "E", "text": "Wir haben eine Risk-Heatmap genutzt. Severity war high, likelihood medium, also haben wir den Test nicht deaktiviert, sondern mit einem Retry-Wrapper versehen und parallel den Bug gefixt. Das steht auch so im Ticket QA-HER-778."}
{"ts": "147:09", "speaker": "I", "text": "Diese Heatmap – ist das ein offizielles Tool oder eher eine interne Heuristik?"}
{"ts": "147:13", "speaker": "E", "text": "Offiziell ist sie in POL-QA-014 verankert, aber wir ergänzen intern zusätzliche Faktoren wie 'cross-project blast radius'. That's not in the policy, but it's a gut feeling metric we track in Confluence."}
{"ts": "147:22", "speaker": "I", "text": "Interessant… und wie gehen Sie mit den Auditability-Anforderungen um, wenn solche gut feeling Metriken ins Spiel kommen?"}
{"ts": "147:27", "speaker": "E", "text": "Wir legen ein 'Decision Note' an, wo wir die nicht dokumentierten Faktoren beschreiben. Even if it's subjective, we timestamp it and link to related tickets. So kann später ein Auditor sehen, warum wir so entschieden haben."}
{"ts": "147:36", "speaker": "I", "text": "Können Sie ein Beispiel nennen, wo das im Audit hilfreich war?"}
{"ts": "147:40", "speaker": "E", "text": "Im Audit Q4 2023 wollte der Prüfer wissen, warum wir Testabdeckung bei HER-IAM-SEC-07 reduziert hatten. Dank Decision Note DN-2023-11 konnten wir zeigen, dass das Risiko durch parallel laufende Gateway-Tests mitigiert war."}
{"ts": "147:36", "speaker": "I", "text": "Lassen Sie uns noch einmal auf die Cross-Project Dependencies eingehen: Wie genau tracken Sie im Hera QA Dashboard Abhängigkeiten zu Orion Edge Gateway, ohne dass es zu Scope Creep kommt?"}
{"ts": "147:41", "speaker": "E", "text": "Wir haben dafür im Dashboard eine eigene Dependency-Matrix, die auf den Testfall-Tags basiert. Each tag references a component ID, z.B. GW-COMP-12, und wir nutzen ein internes Tool namens LinkVerity, um diese automatisch gegen die aktuellen RFC-Mappings zu validieren."}
{"ts": "147:48", "speaker": "I", "text": "Heißt das, wenn ein Gateway-Change im RFC-Stream auftaucht, werden automatisch betroffene Hera-Tests geflaggt?"}
{"ts": "147:53", "speaker": "E", "text": "Genau, und zwar innerhalb von 30 Minuten nach dem Merge ins Gateway-Repo. Wir haben das in Runbook RB-HER-DEP-002 dokumentiert, inklusive der Notification Rules für das QA-Slack-Channel."}
{"ts": "147:59", "speaker": "I", "text": "Und bei Aegis IAM, same principle?"}
{"ts": "148:02", "speaker": "E", "text": "Ähnlich, aber dort haben wir wegen sensibler Auth-Flows einen zusätzlichen Manual Review Step. Das ist in POL-QA-014 Appendix C beschrieben – wir dürfen keine automatisierten Regression-Trigger auf Live-Credentials ausführen."}
{"ts": "148:09", "speaker": "I", "text": "Wie priorisieren Sie, wenn sowohl Gateway als auch IAM gleichzeitig Änderungen haben?"}
{"ts": "148:14", "speaker": "E", "text": "Da greifen unsere nicht dokumentierten Heuristiken – wir bewerten den potenziellen Sicherheitsimpact höher als Performance-Änderungen. So würde ein IAM-Auth-Bug immer vorgezogen, selbst wenn im Gateway ein Performance-Degradation-Alert läuft."}
{"ts": "148:21", "speaker": "I", "text": "Können Sie ein Beispiel geben, wann so etwas passiert ist?"}
{"ts": "148:25", "speaker": "E", "text": "Ja, im Ticket QA-HER-INC-453 hatten wir parallel ein Memory Leak im Gateway und eine MFA-Bypass-Lücke im IAM. We froze Gateway tests for 48h, moved all QA capacity to IAM remediation."}
{"ts": "148:33", "speaker": "I", "text": "Gab es intern Kritik an dieser Entscheidung?"}
{"ts": "148:36", "speaker": "E", "text": "Ein bisschen, ja. Manche Stakeholder wollten das Leak sofort fixen, aber wir konnten mit Audit-Log EX-HER-SEC-2023-77 belegen, dass das IAM-Issue höhere Compliance-Risiken trug."}
{"ts": "148:43", "speaker": "I", "text": "Wie stellen Sie sicher, dass solche Abwägungen später nachvollziehbar bleiben?"}
{"ts": "148:47", "speaker": "E", "text": "Wir verbinden die Entscheidung direkt mit Artefakten: Decision Record DR-HER-015 im Confluence, verlinkt auf die relevanten Tickets, Runbooks und den Risk Assessment Spreadsheet im QA-Share."}
{"ts": "148:54", "speaker": "I", "text": "Und diese Records werden auditiert?"}
{"ts": "148:57", "speaker": "E", "text": "Ja, quartalsweise durch unser internes Compliance-Team, plus stichprobenartige Checks vom externen Auditor im Rahmen des SLA-QA-2024."}
{"ts": "149:06", "speaker": "I", "text": "Lassen Sie uns noch mal auf die Sicherheitsaspekte der Hera-Orchestrierung eingehen. Wie genau integrieren Sie Security Test Suites früh in Ihre Pipelines?"}
{"ts": "149:13", "speaker": "E", "text": "Wir haben im Build-Phase-Kontext einen festen Hook in Stage 2 der CI, wo das Security Regression Pack aus RUN-SC-021 geladen wird. Das ist dokumentiert in Runbook RB-HER-SEC-05, und wir priorisieren dort OWASP Top 10 relevanten Testfälle."}
{"ts": "149:23", "speaker": "I", "text": "And how do you ensure that these security regressions are actually linked back to the originating RFCs or SLAs for traceability?"}
{"ts": "149:30", "speaker": "E", "text": "We maintain a mapping table in our QA Confluence space, wo jede Test-ID auf die RFC-ID und die zugehörige SLA-Section gemappt ist. Example: HER-SEC-TC-14 → RFC-HER-044 → SLA-S2-Availability."}
{"ts": "149:42", "speaker": "I", "text": "Und bei Flaky Tests – welche spezifischen Maßnahmen laufen da gerade?"}
{"ts": "149:48", "speaker": "E", "text": "Wir fahren seit Sprint 18 einen Flake-Score-Algorithmus, der die letzten 50 Runs pro Test auswertet. Ab Score > 0,3 wird der Test in die Quarantäne-Queue verschoben und mit Tag 'FLK-RISK' versehen, siehe Ticket HER-QA-482."}
{"ts": "149:59", "speaker": "I", "text": "Do you have any test cases in Hera that directly validate Gateway or IAM components?"}
{"ts": "150:05", "speaker": "E", "text": "Ja, die Suite HER-XSYS-GW-02 prüft API-Handshake mit Orion Edge Gateway, und HER-XSYS-IAM-03 testet Token-Refresh gegen Aegis IAM. Beide Suites basieren auf den in RFC-OR-GW-011 und RFC-AE-IAM-075 beschriebenen Schnittstellen."}
{"ts": "150:16", "speaker": "I", "text": "How do you coordinate with other teams when such a cross-system bug is found?"}
{"ts": "150:22", "speaker": "E", "text": "Wir nutzen den Cross-System Incident Channel im internen Chat. Sobald ein Bug wie CS-BUG-447 gemeldet ist, wird ein Joint Debug Call mit SRE und Security einberufen, und wir referenzieren direkt die relevanten Runbooks beider Teams."}
{"ts": "150:34", "speaker": "I", "text": "Welche nicht dokumentierten Heuristiken nutzen Sie, um Prioritäten für Cross-Project Tests zu setzen?"}
{"ts": "150:40", "speaker": "E", "text": "Ehrlich gesagt: wir schauen auf \"Blast Radius\" – wenn ein Modul mehr als drei kritische Downstream-Abhängigkeiten hat, wird es bevorzugt getestet. Das ist nirgendwo offiziell, aber im Team seit Jahren gelebte Praxis."}
{"ts": "150:51", "speaker": "I", "text": "Gab es jüngst eine Entscheidung, bei der Sie bewusst Testabdeckung reduziert haben, um ein Release zu halten?"}
{"ts": "150:57", "speaker": "E", "text": "Ja, im Sprint 20 haben wir die Lasttests gegen IAM ausgelassen, um die SLA S2 zu wahren. Decision wurde in Ticket HER-SCOPE-221 dokumentiert, mit Verweis auf Audit-Log AL-HER-2024-03."}
{"ts": "151:08", "speaker": "I", "text": "And how do you make sure such scope cuts are auditable later on?"}
{"ts": "151:14", "speaker": "E", "text": "Wir hängen immer den Entscheidungsthread, die betroffenen Test-IDs und die Risikobewertung an das Scope-Ticket an. Zusätzlich wird im wöchentlichen QA Audit Report ein eigener Abschnitt 'Scope Deviations' geführt."}
{"ts": "151:06", "speaker": "I", "text": "Bevor wir zu den finalen Entscheidungen kommen, könnten Sie noch mal schildern, wie Sie im Build-Phase-Kontext mit Security zusammenarbeiten, gerade wenn Hera neue Module integriert?"}
{"ts": "151:12", "speaker": "E", "text": "Ja, klar. Wir haben eine wöchentliche Sync-Session mit dem Security Chapter, da prüfen wir alle geplanten Test-Orchestrierungen gegen die Policy SEC-07. Wenn ein Modul z. B. neu ist, legen wir sofort einen Pre-Auth-Testplan an, um early vulnerabilities zu catchen."}
{"ts": "151:22", "speaker": "I", "text": "Und diese Pre-Auth-Pläne – sind die formal in einem Runbook hinterlegt oder eher ad-hoc?"}
{"ts": "151:29", "speaker": "E", "text": "Formell, ja. Sie sind im Runbook QA-RB-042 beschrieben. Aber ehrlich gesagt, wir passen sie on the fly an, wenn wir von SRE neue Incident Patterns kriegen."}
{"ts": "151:39", "speaker": "I", "text": "Können Sie ein Beispiel geben, wo so eine Anpassung nötig war?"}
{"ts": "151:45", "speaker": "E", "text": "Letzte Woche: SRE meldete einen anomaly spike im Orion Edge Gateway bei TLS renegotiation. Wir haben daraufhin im Hera-Pre-Auth-Testplan eine zusätzliche handshake latency Messung eingebaut."}
{"ts": "151:56", "speaker": "I", "text": "So eine Änderung – verlinken Sie die dann auf ein bestimmtes RFC oder Ticket?"}
{"ts": "152:02", "speaker": "E", "text": "Ja, in Jira-Ticket QA-HER-2219, das wiederum referenziert RFC-NET-118. Dadurch bleibt die Traceability bis ins Change Advisory Board erhalten."}
{"ts": "152:12", "speaker": "I", "text": "Okay. Und wie schnell können Sie solche Cross-System-Änderungen in die laufende Test-Orchestrierung einpflegen?"}
{"ts": "152:18", "speaker": "E", "text": "Normalerweise innerhalb von 24h, sometimes faster. Wir haben ein Fast-Track-Protokoll, dokumentiert in QA-RB-FAST-05, falls der Bug als Severity 1 eingestuft wird."}
{"ts": "152:28", "speaker": "I", "text": "Im Fall TLS renegotiation: severity 1 oder darunter?"}
{"ts": "152:34", "speaker": "E", "text": "Severity 1, klar. Das betraf Compliance-SLA COM-SLA-004, wo jede Session-Init über 150ms ein potenzieller breach ist."}
{"ts": "152:44", "speaker": "I", "text": "Wie dokumentieren Sie die Entscheidung, dass Sie andere Testfälle zurückstellen, um das zu priorisieren?"}
{"ts": "152:50", "speaker": "E", "text": "Wir nutzen ein Priorisierungstableau in Confluence, verlinkt auf das Audit-Log QA-AUD-2024-02. Dort steht, welche Test Suites verschoben wurden und warum."}
{"ts": "153:00", "speaker": "I", "text": "Gab es intern Diskussionen über das Risiko dieser Verschiebung?"}
{"ts": "153:06", "speaker": "E", "text": "Ja, zwei Entwickler wollten die UI-Regressionsläufe nicht verschieben. But we had to decide under time pressure. Wir haben die Entscheidung im Change Record CR-HER-77 mit allen Pros und Cons dokumentiert, so bleibt sie auditierbar."}
{"ts": "153:06", "speaker": "I", "text": "Lassen Sie uns mal konkret auf einen Cross-System-Bug eingehen, der sowohl Hera als auch Orion Edge Gateway betroffen hat. Können Sie bitte den Ablauf schildern?"}
{"ts": "153:11", "speaker": "E", "text": "Ja, klar. Das war der Incident INC-HER-4721. Wir haben im Hera-Orchestrator einen Timeout beobachtet, der im Log mit einer Gateway-Handshake-Exception korrelierte. In der Runbook-RB-GW-011 steht, dass wir erst die Gateway-Schnittstelle isolieren müssen bevor wir Hera-Tests neu triggern."}
{"ts": "153:18", "speaker": "I", "text": "And how did you coordinate that isolation with the Gateway team?"}
{"ts": "153:22", "speaker": "E", "text": "Wir haben im Incident-Channel sofort eine Bridge-Call eingerichtet. Neben mir war der SRE vom Gateway-Team dabei. Wir haben dann anhand der SLA-GW-2.4 geprüft, ob die Response-Zeit außerhalb der Toleranz lag. That confirmed it was their side first."}
{"ts": "153:30", "speaker": "I", "text": "Gab es dabei Abhängigkeiten zum Aegis IAM?"}
{"ts": "153:34", "speaker": "E", "text": "Interessanterweise ja. Die Auth Tokens für den Gateway-Handshake werden vom IAM generiert. In RFC-IAM-075 ist beschrieben, wie Retries zu handhaben sind. In diesem Fall wurde der Retry-Mechanismus im Hera-Test falsch konfiguriert, wodurch der Fehler eskalierte."}
{"ts": "153:42", "speaker": "I", "text": "So you had a three-way dependency to manage under time pressure."}
{"ts": "153:46", "speaker": "E", "text": "Genau. Und hier kam unsere nicht dokumentierte Heuristik ins Spiel: Wir priorisieren bei Multi-System-Fails immer den Pfad mit der geringsten Mean Time to Repair laut letzten drei Audit-Logs. That way we limit blast radius fastest."}
{"ts": "153:54", "speaker": "I", "text": "Wie haben Sie das im Testfall-Repository nachvollziehbar gemacht?"}
{"ts": "153:59", "speaker": "E", "text": "Wir haben im Testfall TF-HER-GW-92 einen Verweis auf beide Runbooks ergänzt und im Jira-Ticket QA-HER-1287 die cross-links dokumentiert. Zusätzlich ein Evidence-Tab angelegt mit Log-Snippets und SLA-Checks."}
{"ts": "154:06", "speaker": "I", "text": "Und wenn Sie jetzt an die Abwägung Testabdeckung vs. Time-to-Market denken – wie hat dieser Fall Ihre Entscheidung beeinflusst?"}
{"ts": "154:11", "speaker": "E", "text": "Wir mussten fünf Regressionstests aus der finalen Pipeline streichen, um das Gateway-Fix-Fenster zu erwischen. Im Decision-Log DEC-HER-033 haben wir vermerkt, dass laut Risk Assessment RA-2023-17 das Restrisiko akzeptabel war."}
{"ts": "154:18", "speaker": "I", "text": "Did you get any pushback from compliance on that reduced scope?"}
{"ts": "154:22", "speaker": "E", "text": "Ja, Compliance wollte eine nachträgliche Auditierbarkeit sicherstellen. Deshalb haben wir die Ausführungsprotokolle der letzten vollständigen Testläufe angehängt und mit den verkürzten Läufen verglichen, um transparent die Coverage-Lücken zu zeigen."}
{"ts": "154:30", "speaker": "I", "text": "Können Sie ein Beispiel geben, wie diese Dokumentation später genutzt wurde?"}
{"ts": "154:34", "speaker": "E", "text": "Bei der Q4-Auditprüfung hat der Auditor explizit DEC-HER-033 und die anhängenden Logs geprüft. Durch die klare Traceability zu Tickets und Runbooks konnten wir belegen, dass die Entscheidung fundiert war und keine kritischen Sicherheitslücken offenblieben."}
{"ts": "155:06", "speaker": "I", "text": "Lassen Sie uns nochmal konkret auf die Teststrategie eingehen – wie haben Sie in Hera die Security-Regression-Checks ganz am Anfang der Build-Phase integriert, ohne den Durchsatz der Orchestrierung massiv zu verlangsamen?"}
{"ts": "155:13", "speaker": "E", "text": "Wir haben da eine Kombination gefahren: statische Security-Scanner direkt im Pre-merge Hook und dynamische Pen-Test-Skripte nur auf nightly builds. So konnte ich den Speed halten und trotzdem unsere Safety-first Policy wahren."}
{"ts": "155:22", "speaker": "I", "text": "And how did you map those checks back to our internal Risk-Based Testing Policy, POL-QA-014?"}
{"ts": "155:28", "speaker": "E", "text": "Das Mapping haben wir im Testfall-Repository gepflegt – jeder Security-Testcase hat ein Metafeld 'Risk-Level' und 'PolicyRef'. So lassen sich Reports direkt gegen POL-QA-014 prüfen."}
{"ts": "155:37", "speaker": "I", "text": "Sie haben vorhin mal das Orion Edge Gateway erwähnt – gibt es in Hera Testcases, die direkt Abhängigkeiten zu dessen Auth-Komponenten prüfen?"}
{"ts": "155:45", "speaker": "E", "text": "Ja, wir haben zum Beispiel TC-HER-GW-042, der simuliert einen Token-Refresh aus dem Gateway in Kombination mit Hera's Orchestration-API. Das ist kritisch, weil Aegis IAM dazwischen hängt."}
{"ts": "155:55", "speaker": "I", "text": "So that’s our multi-hop middle link – how do you ensure if IAM changes won’t break Hera’s pipeline indirectly?"}
{"ts": "156:02", "speaker": "E", "text": "Wir haben einen wöchentlichen Cross-System Test-Run mit Mock-Gateway und echtem IAM-Staging. Wenn ein Run fehlschlägt, triggert unser Jenkins-Job automatisch ein Ticket im Board 'XPROJ-BUG'."}
{"ts": "156:14", "speaker": "I", "text": "Interessant. Welche nicht dokumentierten Heuristiken nutzen Sie, um Prioritäten bei solchen Cross-Project Runs zu setzen?"}
{"ts": "156:20", "speaker": "E", "text": "Ganz ehrlich, ich schaue auf zwei Signale: Anzahl der kürzlich gemergten RFCs im Zielsystem und die Fehlerhistorie aus den letzten drei Runs. Hohe RFC-Dichte plus frische Fehler = hohe Priorität."}
{"ts": "156:31", "speaker": "I", "text": "Kommen wir zu einem Trade-off: Describe a time you reduced test scope to hit a release date."}
{"ts": "156:37", "speaker": "E", "text": "Das war im Sprint 21-B. Wir haben weniger Browser-Matrix getestet, nur Chrome und Firefox LTS, um Release R-HER-1.4 einzuhalten. Dokumentiert in Ticket QADEC-552 mit Verweis auf Runbook RB-QA-REL-07."}
{"ts": "156:49", "speaker": "I", "text": "Wie stellen Sie sicher, dass solche Entscheidungen auditierbar bleiben?"}
{"ts": "156:54", "speaker": "E", "text": "Ich hänge die Entscheidung immer als Kommentar mit Begründung und Evidenz-Links ans Release-Ticket. Zusätzlich taggen wir den Commit mit 'scope-reduction'."}
{"ts": "157:03", "speaker": "I", "text": "And in post-mortems, do you revisit those scope cuts to measure impact?"}
{"ts": "157:09", "speaker": "E", "text": "Ja, wir fahren einen Retro-Check. Falls ein Fehler in genau der ausgelassenen Test-Matrix auftritt, markieren wir das im Lessons-Learned-Register und passen die Heuristiken in RB-QA-REL-07 an."}
{"ts": "158:06", "speaker": "I", "text": "Lassen Sie uns nochmal auf die Teststrategie für sicherheitsrelevante Regressionen eingehen. Wie genau greifen Sie da in der Build-Phase von Hera ein?"}
{"ts": "158:12", "speaker": "E", "text": "Also, wir haben da ein mehrstufiges Screening. Zuerst laufen die Security Smoke Tests basierend auf Runbook RB-SEC-042, das uns erlaubt, critical vulnerabilities sofort zu blockieren. Danach triggern wir automatisiert die Traceability-Checks gegen die POL-QA-014 Risk-Based Testing Policy."}
{"ts": "158:25", "speaker": "I", "text": "And how do you validate that these smoke tests actually catch new regression patterns?"}
{"ts": "158:29", "speaker": "E", "text": "Wir fahren regelmäßig Replay-Sessions mit historischen Incidents, z.B. aus Ticketset SEC-INC-2022-Q4. We inject those payloads into the current build to see if the orchestration catches them."}
{"ts": "158:42", "speaker": "I", "text": "Interessant. Und gibt es eine direkte Kopplung an andere Projekte, sagen wir Orion Edge Gateway?"}
{"ts": "158:47", "speaker": "E", "text": "Ja, genau hier wird's tricky. Hera orchestriert Tests, die in RB-GW-011 direkt auf Gateway-Protokolle zugreifen. We have to coordinate with the Orion QA team to ensure protocol version changes are mirrored in our test cases."}
{"ts": "158:59", "speaker": "I", "text": "Können Sie den Ablauf schildern, wenn ein Cross-System-Bug auftaucht, der sowohl Gateway als auch IAM betrifft?"}
{"ts": "159:04", "speaker": "E", "text": "Klar. Wir eröffnen parallel zwei Tickets, z.B. QA-HERA-274 und QA-IAM-889, und referenzieren sie gegenseitig. Then, per unwritten rule, the team with the higher SLA impact gets priority in fix scheduling."}
{"ts": "159:17", "speaker": "I", "text": "Welche nicht dokumentierten Heuristiken helfen Ihnen, diese Priorität schnell einzuschätzen?"}
{"ts": "159:22", "speaker": "E", "text": "Eine Faustregel ist: wenn der Bug Authentication Flows blockiert, zählt er automatisch als P1, egal ob im Gateway oder IAM. If it's only impacting telemetry, we might downgrade to P3 unless a compliance deadline is looming."}
{"ts": "159:36", "speaker": "I", "text": "Gab es zuletzt eine Situation, in der Sie zwischen Abdeckung und Time-to-Market abwägen mussten?"}
{"ts": "159:41", "speaker": "E", "text": "Ja, beim Hera Sprint 18. We had only 36 hours before release freeze. Wir haben dann Testpaket TP-HERA-SEC-05 um zwei Low-Risk-Cases gekürzt, gestützt auf Audit-Log AL-2023-118, um die Release-Deadline zu halten."}
{"ts": "159:54", "speaker": "I", "text": "Welche Evidenz haben Sie genutzt, um diese Kürzung zu rechtfertigen?"}
{"ts": "159:59", "speaker": "E", "text": "Neben dem Audit-Log haben wir die letzten drei stabilen Runs von TP-HERA-SEC-05 angeführt, alle grün. Plus ein internes Memo im Confluence, verlinkt zu RFC-HERA-117, das den geringen Impact dokumentiert."}
{"ts": "160:12", "speaker": "I", "text": "Und wie stellen Sie sicher, dass solche Entscheidungen später auditierbar bleiben?"}
{"ts": "160:17", "speaker": "E", "text": "Wir pflegen ein Decision Register, in dem jeder Trade-off mit Ticket-IDs, Runbook-Referenzen und SLA-Notizen verknüpft ist. That way, any auditor can reconstruct the rationale even months later."}
{"ts": "160:06", "speaker": "I", "text": "Lassen Sie uns nochmal konkret werden—wie genau wenden Sie die Risk-Based Testing Policy POL-QA-014 im aktuellen Hera-Build an?"}
{"ts": "160:15", "speaker": "E", "text": "Also, wir haben für Hera eine Mapping-Tabelle erstellt, die die Policy-Kriterien mit den Test-Metriken verknüpft. For example, any component tagged as 'critical' in our CMDB gets mapped to a mandatory regression suite. Wir haben zusätzlich einen Threshold-Score eingeführt—über 7,5 fließen direkt in die High-Risk-Kategorie."}
{"ts": "160:34", "speaker": "I", "text": "Und diese Scores, stammen die aus manueller Bewertung oder automatisierten Scans?"}
{"ts": "160:41", "speaker": "E", "text": "Beides, ehrlich gesagt. Wir nutzen statische Code-Analysen aus dem Hera-Pipeline-Tool, aber auch manuelle Einschätzungen aus Security Reviews. Automatisierte Scans geben uns die Baseline, die dann durch Security- und SRE-Feedback justiert wird."}
{"ts": "160:58", "speaker": "I", "text": "Speaking of SRE—wie sehen Ihre Schnittstellen zu den SRE-Teams aus?"}
{"ts": "161:04", "speaker": "E", "text": "Wir haben wöchentliche Syncs. Außerdem gibt’s eine direkte Slack-Integration in unseren Orchestrator, so dass flaky tests mit SLA-Relevanz sofort als Incident an das SRE-Channel gepusht werden. Das ist besonders wichtig, wenn ein Test einen SLA-Breach simuliert."}
{"ts": "161:22", "speaker": "I", "text": "How do you balance speed of orchestration with that safety-first company value?"}
{"ts": "161:28", "speaker": "E", "text": "Wir nutzen Parallelisierung, aber nur für Low-Risk-Testgruppen. High-Risk wird strikt sequenziell gefahren, um deterministische Logs zu behalten. The trick is: wir classify risk early, so we can spin up fast jobs without compromising critical paths."}
{"ts": "161:46", "speaker": "I", "text": "Wie stellen Sie sicher, dass sicherheitsrelevante Regressionen früh erkannt werden?"}
{"ts": "161:53", "speaker": "E", "text": "Wir haben im Hera-Orchestrator Security-Gates, die mit den Outputs aus dem Tool SecuLint-5.2 arbeiten. Jeder Commit, der eine sicherheitskritische Dependency ändert, triggert sofort einen spezifischen Regression-Cluster. Dazu gehört ein Runbook RB-HER-SEC-09, das genau beschreibt, welche Tests in welcher Reihenfolge laufen müssen."}
{"ts": "162:15", "speaker": "I", "text": "Can you walk me through linking test cases to specific RFCs or SLAs?"}
{"ts": "162:21", "speaker": "E", "text": "Jeder Testfall bekommt in Jira-Hera ein Custom Field 'Trace-ID'. Diese ID ist mit dem RFC-Dokument und der zugehörigen SLA-Referenz in Confluence verknüpft. For SLA breaches, wir markieren Tests mit der SLA-ID, so dass Reports direkt SLA-Verletzungen aufzeigen können."}
{"ts": "162:39", "speaker": "I", "text": "Welche Maßnahmen treffen Sie, um Flaky Tests zu identifizieren und deren Risiko zu bewerten?"}
{"ts": "162:46", "speaker": "E", "text": "Wir analysieren über 10 Runs hinweg die Varianz der Ausführungszeiten und Fehlerraten. Anything over 15% failure variance gets tagged as flaky. Dann bewerten wir das Risiko: wenn der Test eine kritische User Journey abdeckt, kommt er in die 'Prioritize Fix'-Liste im Runbook RB-HER-QA-FT-02."}
{"ts": "163:04", "speaker": "I", "text": "Gibt es in Hera Testfälle, die direkt Abhängigkeiten zu Gateway- oder IAM-Komponenten prüfen?"}
{"ts": "163:11", "speaker": "E", "text": "Ja, wir haben ein Cross-System-Suite 'HER-XSYS-01', die sowohl das Orion Edge Gateway als auch Aegis IAM in Staging anspricht. Die Tests sehen vor, dass Auth-Flows und Data-Pipelines simultan geprüft werden, um mögliche Deadlocks oder Auth-Timeouts zu finden."}
{"ts": "161:30", "speaker": "I", "text": "Wenn wir nochmal auf die Risk-Based Testing Policy POL-QA-014 zurückkommen – können Sie ein aktuelles Beispiel nennen, wie Sie diese in der Hera Build-Phase angewendet haben?"}
{"ts": "161:37", "speaker": "E", "text": "Ja, klar. In Sprint 42 hatten wir einen neuen Scheduler-Algorithmus im Orchestrator. Laut POL-QA-014 mussten wir das Risiko in der Kategorie 'Concurrency & Deadlock' einstufen. Wir haben dann priorisiert nur die High-Risk Szenarien durch den vollen Regression-Run geschickt, low-risk wurden mit Smoke-Tests abgedeckt."}
{"ts": "161:51", "speaker": "I", "text": "Und wie haben Sie das gegenüber den Stakeholdern begründet?"}
{"ts": "161:55", "speaker": "E", "text": "Mit einem Auszug aus Runbook QA-RB-201, Kapitel 4.2, wo genau diese Priorisierungsmethode beschrieben ist. Zusätzlich haben wir Ticket QA-HERA-773 im JIRA verlinkt, das die Risk Matrix enthält."}
{"ts": "162:05", "speaker": "I", "text": "Switching gears – how do you connect those risk-based choices to the SRE team's incident history?"}
{"ts": "162:10", "speaker": "E", "text": "We pull the last two quarters of incident postmortems from SRE Confluence, filter for orchestration-related outages, und mappen die root causes auf unsere Testfall-Kategorien. So sehen wir, ob wir vielleicht zu viel in low-risk investiert haben."}
{"ts": "162:24", "speaker": "I", "text": "Gab es da konkrete Änderungen?"}
{"ts": "162:27", "speaker": "E", "text": "Ja, nach Incident SRV-HERA-018 haben wir den Test-Trigger für IAM-Token-Refresh von weekly auf daily hochgesetzt. Das war eine Schnittstelle zur Aegis IAM API, und das Mapping hat uns gezeigt, dass wir da eine Lücke hatten."}
{"ts": "162:39", "speaker": "I", "text": "Das klingt nach einem klaren Cross-System-Link. How did you coordinate with the IAM team to implement that?"}
{"ts": "162:44", "speaker": "E", "text": "Wir haben im gemeinsamen Channel #qa-crossproj einen Change-Request CR-IAM-442 gepostet, die IAM-Leads haben dann ihre Mock-Endpunkte für unsere Testumgebung angepasst. Parallel haben wir in Hera den Orchestrator so konfiguriert, dass er die neuen Mocks in nightly runs nutzt."}
{"ts": "162:58", "speaker": "I", "text": "Gab es dabei Probleme mit den SLAs?"}
{"ts": "163:02", "speaker": "E", "text": "Minimal. SLA-QA-05 erlaubt uns für nicht-produktive APIs eine Downtime von 4 Stunden/Monat, und wir haben in Absprache mit den SREs ein 2-Stunden-Maintenance-Fenster geblockt. Das war in Ticket OPS-SLA-223 dokumentiert."}
{"ts": "163:14", "speaker": "I", "text": "Und wenn wir jetzt den Blick auf Trade-offs richten: Wann mussten Sie zuletzt Testabdeckung bewusst reduzieren, um Time-to-Market zu halten?"}
{"ts": "163:20", "speaker": "E", "text": "Das war beim Hera Patch 3.2. Wir standen vor dem Release-Freeze und hatten noch 18 offene Medium-Risk-Cases. Basierend auf der Heuristik 'Frequency × Impact' haben wir acht davon ins nächste Sprint verschoben. Belegt habe ich das mit Audit-Log QA-AUD-2023-09 und einer Abnahme durch den Product Owner."}
{"ts": "163:36", "speaker": "I", "text": "Und wie stellen Sie sicher, dass solche Kürzungen später nachvollziehbar sind?"}
{"ts": "163:40", "speaker": "E", "text": "Alle Entscheidungen kommen in das Decision Register im Hera-Wiki, mit Verweis auf relevante Tickets, Runbook-Passagen und die genehmigende Person. Außerdem taggen wir im Git-Repo den Commit, der die Tests auskommentiert oder verschoben hat, mit 'deferred-test'."}
{"ts": "163:30", "speaker": "I", "text": "Lassen Sie uns nochmal auf die Schnittstellen eingehen, speziell zu Security. Können Sie mir ein konkretes Beispiel nennen, wie Sie POL-QA-014 auf Hera angewendet haben?"}
{"ts": "163:35", "speaker": "E", "text": "Ja, äh, zum Beispiel im Sprint 42 haben wir den Risk-Based Testing Ansatz aus POL-QA-014 direkt auf das neue Auth-Module angewendet. Die Policy gab vor, dass wir bei ‚high risk‘ Komponenten mindestens zwei unabhängige PenTest-Suites fahren müssen, auch wenn das den CI-Run um 15 Minuten verlängert."}
{"ts": "163:42", "speaker": "I", "text": "And how did you keep orchestration speed acceptable in that case?"}
{"ts": "163:46", "speaker": "E", "text": "Wir haben parallelisiert, indem wir die Security-Suites auf separaten Hera-QA-Nodes schedult haben. That reduced the bottleneck; plus wir haben die Flaky-Test-Erkennung auf low-priority moved, um high-risk Checks zuerst durchzubekommen."}
{"ts": "163:54", "speaker": "I", "text": "Und die Hauptschnittstelle zu SRE – wie war die in diesem Szenario?"}
{"ts": "163:59", "speaker": "E", "text": "SRE hat uns die hardened Test-Environment-Images bereitgestellt. Sie mussten sicherstellen, dass die TLS-Configs konsistent mit RFC-SEC-088 waren. Wir hatten wöchentliche Syncs und ein Shared Runbook RB-HERA-SRE-014, um Environment-Drift zu vermeiden."}
{"ts": "164:06", "speaker": "I", "text": "Können Sie erläutern, wie Sie sicherheitsrelevante Regressionen früh erkennen?"}
{"ts": "164:10", "speaker": "E", "text": "Wir haben Canary-Testjobs, die jede Nacht gegen den aktuellen Merge-Branch laufen. Diese sind getagged mit 'SEC-REG'. Through our dashboard, any failure in those triggers an immediate ticket in JIRA-HERA with Severity 1."}
{"ts": "164:18", "speaker": "I", "text": "And for traceability, how exactly do you link test cases to RFCs or SLAs?"}
{"ts": "164:22", "speaker": "E", "text": "Jeder Testfall hat ein 'TraceID'-Feld, das die RFC- oder SLA-ID enthält, etwa RFC-HERA-021 oder SLA-API-005. The Hera Orchestrator exports a mapping CSV nightly, und das wird ins Compliance-Repo gepusht."}
{"ts": "164:29", "speaker": "I", "text": "Gibt es Testfälle, die direkt Abhängigkeiten zu Gateway- oder IAM-Komponenten prüfen?"}
{"ts": "164:33", "speaker": "E", "text": "Ja, besonders im Bereich Token-Validation. Wir haben Cross-Project Suites, die Hera-Auth gegen Orion Edge Gateway API v3 testen. Außerdem prüfen wir, ob IAM’s RB-IAM-075 konforme Claims liefert – das ist via Multi-Hop-Testflow implementiert."}
{"ts": "164:41", "speaker": "I", "text": "How do you coordinate when a bug spans RB-GW-011 and RB-IAM-075?"}
{"ts": "164:45", "speaker": "E", "text": "Wir öffnen ein Joint Incident im Tool 'CollabOps', attachen alle relevanten Testlogs, und taggen sowohl Gateway- als auch IAM-QA-Leads. Then we follow Runbook RB-CROSS-002, welches die Reihenfolge der Fix-Validation zwischen den Projekten regelt."}
{"ts": "164:53", "speaker": "I", "text": "Beschreiben Sie eine Situation, in der Sie zwischen Testabdeckung und Time-to-Market abwägen mussten."}
{"ts": "164:57", "speaker": "E", "text": "Im Release 3.4 von Hera gab es einen fix für ein Medium-Risk Issue, das aber 40 zusätzliche Regressionstests erfordert hätte. Wir haben anhand der Audit-Logs und Ticket HERA-QA-7783 entschieden, nur die High-Coverage-Suites zu fahren, gestützt auf Risikoanalyse RA-HERA-12. That decision was fully documented im Change-Log und von Compliance akzeptiert."}
{"ts": "165:06", "speaker": "I", "text": "Lassen Sie uns nochmal auf das Thema Traceability eingehen. Wie genau mappen Sie im Hera Build alle sicherheitsrelevanten Testfälle auf die entsprechenden RFCs?"}
{"ts": "165:15", "speaker": "E", "text": "Wir nutzen dafür unser internes Mapping-Tool 'LinkTracer'. Es erlaubt uns, jede Test-ID mit einer RFC-Referenz wie RFC-HER-SEC-022 zu verbinden, und zusätzlich hinterlegen wir im QA-Runbook RB-HER-TR-08 die Implementation Notes. This ensures any auditor can verify the origin of the test requirement."}
{"ts": "165:28", "speaker": "I", "text": "Und wie fließt das in Ihre Risk-Based Testing Policy POL-QA-014 ein?"}
{"ts": "165:38", "speaker": "E", "text": "POL-QA-014 gibt ja Prioritätsstufen vor. Wir bündeln alle RFCs mit High-Security-Flag in eine eigene Orchestrierungs-Queue. That way, even if time is short, those tests run first in parallel pipelines."}
{"ts": "165:52", "speaker": "I", "text": "Verstanden. Können Sie ein Beispiel nennen, wo diese Priorisierung einen kritischen Fehler früh erkannt hat?"}
{"ts": "166:03", "speaker": "E", "text": "Ja, bei Build 412 hatten wir eine neue Auth-API-Version. Ein High-Flag-Test TC-HER-AUTH-17 schlug fehl, weil die Response-Codes nicht mit SLA-AEG-SEC-05 übereinstimmten. Without that early run, this would have propagated into the Orion Edge Gateway deployment."}
{"ts": "166:19", "speaker": "I", "text": "Das bringt mich zu Cross-Projekt Tests. Wie koordinieren Sie sich, wenn so ein Fehler sowohl Hera als auch Orion betrifft?"}
{"ts": "166:30", "speaker": "E", "text": "Wir haben einen Cross-System-Standup zweimal pro Woche. Bei RB-GW-011 Incidents öffnen wir einen Joint Ticket Thread im System 'CollabTrack'. We then link it to both project boards, so Orion- und Hera-Teams sehen dieselben Logs und Steps."}
{"ts": "166:46", "speaker": "I", "text": "Nutzen Sie dafür dokumentierte Prozesse oder eher gewachsene Heuristiken?"}
{"ts": "166:55", "speaker": "E", "text": "Ehrlich gesagt beides. Es gibt das offizielle Cross-Project Escalation Runbook RB-XSYS-02, aber im Alltag nutzen wir auch die 'Friday Push' Regel: if a cross-system fix is pending, avoid merging it after Thursday noon to reduce weekend on-call load."}
{"ts": "167:10", "speaker": "I", "text": "Wie wirkt sich diese Regel auf Ihre Time-to-Market Ziele aus?"}
{"ts": "167:20", "speaker": "E", "text": "Sie verlangsamt Releases minimal, aber senkt das Risiko von Hotfixes massiv. Wir hatten im Q2 einen Fall, Ticket HER-OPS-234, wo ein zu später Merge zu einer IAM-Auth-Unterbrechung führte. That outage cost us more than the delay would have."}
{"ts": "167:36", "speaker": "I", "text": "Das ist ein gutes Beispiel für einen Trade-off. Welche Evidenz haben Sie damals gesammelt, um die Regel zu rechtfertigen?"}
{"ts": "167:46", "speaker": "E", "text": "Wir haben ein Incident Post-Mortem verfasst, Log-Snippets aus dem Gateway und IAM extrahiert und mit Zeitstempeln versehen, plus den CI/CD Pipeline Report aus JenkinsCopy gespeichert. All das haben wir im Audit-Ordner HER-AUD-2023-Q2 abgelegt."}
{"ts": "168:02", "speaker": "I", "text": "Und diese Unterlagen sind für Audits jederzeit abrufbar?"}
{"ts": "168:11", "speaker": "E", "text": "Ja, über unser Confluence-Archiv mit Zugriffsrechten nach dem Need-to-Know-Prinzip. Additionally, we mirror critical evidence to the secure archive node in the Berlin datacenter, following SOP-SAFE-07."}
{"ts": "167:06", "speaker": "I", "text": "Lassen Sie uns bitte noch einmal konkret auf die Teststrategie eingehen, speziell wie Sie bei Hera sicherstellen, dass sicherheitsrelevante Regressionen früh erkannt werden."}
{"ts": "167:16", "speaker": "E", "text": "Wir setzen hier eine Kombination aus statischer Codeanalyse und gezielten Security Smoke Tests ein. Die Smoke Tests sind in der Orchestrierung so verankert, dass sie vor jeder größeren Merge-Operation laufen – das ist in Runbook RB-HER-SEC-002 hinterlegt."}
{"ts": "167:29", "speaker": "I", "text": "And how do you link those smoke tests to formal requirements, like RFCs or SLAs, for traceability?"}
{"ts": "167:38", "speaker": "E", "text": "Wir nutzen ein Mapping-Template aus unserem QA-Tool, das jede Test-ID mit einer RFC-Nummer und der relevanten SLA-Klausel verbindet. Zum Beispiel ist Test HSEC-014 direkt mit RFC-HER-045 und SLA-QA-007 verknüpft, sodass bei einem Audit sofort ersichtlich ist, welcher Service-Level abgesichert wird."}
{"ts": "167:55", "speaker": "I", "text": "Welche Maßnahmen treffen Sie, um flaky Tests zu identifizieren und deren Risiko zu bewerten?"}
{"ts": "168:02", "speaker": "E", "text": "Wir haben ein Flaky-Detection-Modul in den Orchestrator integriert, das über 10 Läufe hinweg Failure-Patterns analysiert. Für Hera bedeutet das: ab 3 nicht-reproduzierbaren Failures in 5 Runs wird ein Risk-Flag gesetzt, und das geht als Ticket in JIRA-QA-HER unter dem Label 'flaky-high' zur Bewertung."}
{"ts": "168:20", "speaker": "I", "text": "Gibt es Testfälle in Hera, die direkt Abhängigkeiten zu Gateway- oder IAM-Komponenten prüfen?"}
{"ts": "168:28", "speaker": "E", "text": "Ja, wir haben die H-INTEG-2xx Serie. H-INTEG-205 prüft z.B. den AuthN-Flow gegen Aegis IAM, während H-INTEG-212 die Datenströme zum Orion Edge Gateway validiert. Beide hängen von simulierten Endpunkten aus den anderen Projekten ab."}
{"ts": "168:44", "speaker": "I", "text": "How do you coordinate when you find a cross-system bug, maybe impacting RB-GW-011 and RB-IAM-075 simultaneously?"}
{"ts": "168:54", "speaker": "E", "text": "Da starten wir einen sogenannten Cross-Impact Call mit den QA-Leads der betroffenen Projekte. Wir referenzieren dann die jeweiligen Runbooks RB-GW-011 und RB-IAM-075 im Ticket und legen in Confluence eine gemeinsame Incident-Page an, wo wir Ursache, Fix-Plan und Retest-Termine dokumentieren."}
{"ts": "169:12", "speaker": "I", "text": "Welche nicht dokumentierten Heuristiken nutzen Sie, um Prioritäten für solche Cross-Project Tests zu setzen?"}
{"ts": "169:20", "speaker": "E", "text": "Ein Punkt ist die 'User Blast Radius'-Schätzung: Wenn ein Fehler potenziell mehr als 30% aktiver Sessions betrifft, priorisieren wir hoch, selbst wenn er nicht in einem kritischen Pfad laut Dokumentation liegt. Das steht so nicht im offiziellen QA-Handbuch, hat sich aber bewährt."}
{"ts": "169:37", "speaker": "I", "text": "Beschreiben Sie bitte eine Situation, in der Sie zwischen Testabdeckung und Time-to-Market abwägen mussten."}
{"ts": "169:45", "speaker": "E", "text": "Beim Hera Sprint 14 Release hatten wir nur 48 Stunden für Regressionstests. Wir haben dann auf Basis der Risk-Based Testing Policy POL-QA-014 die Low-Risk Tests aus der Suite entfernt, um die Kernpfade zu sichern. Das wurde mit Ticket QA-HER-321 und den Logs aus Test-Orchestrator Run #8842 dokumentiert."}
{"ts": "170:05", "speaker": "I", "text": "What evidence did you use to justify that reduced scope?"}
{"ts": "170:13", "speaker": "E", "text": "Neben den Orchestrator-Logs habe ich den letzten Audit-Report AUD-HER-2023-09 angeführt, in dem die Low-Risk Pfade seit drei Releases stabil waren. Das hat die Entscheidung untermauert und war später für das Compliance-Review ausschlaggebend."}
{"ts": "175:06", "speaker": "I", "text": "Lassen Sie uns nochmal konkret werden: wie stellen Sie sicher, dass die Risk-Based Testing Policy im Build-Phase-Alltag nicht nur ein Dokument bleibt, sondern tatsächlich den Test-Plan beeinflusst?"}
{"ts": "175:18", "speaker": "E", "text": "Also, wir binden die POL-QA-014 direkt in unser Jira-Workflow-Template ein. Every new epic in Hera bekommt automatisch ein Risk-Score-Feld, das mit den Kriterien aus der Policy gefüttert wird. Das zwingt das Team quasi, risk-high stories zuerst in die orchestrierten Test-Suites aufzunehmen."}
{"ts": "175:39", "speaker": "I", "text": "Okay, und wie interagieren Sie dann mit Security oder SRE, wenn sich dieser Risikoscore ändert?"}
{"ts": "175:47", "speaker": "E", "text": "Mit Security machen wir einen wöchentlichen Risk-Alignment-Call. Wenn ein Score von medium auf high springt, schicken wir ein Alert an den SRE-On-Call via PagerDuty-Bridge. They can then adjust monitoring probes in their staging clusters to mirror our high-risk tests."}
{"ts": "176:06", "speaker": "I", "text": "How do you balance that added orchestration overhead with the need for speed? Sie haben ja im Build-Phase enge Deadlines."}
{"ts": "176:15", "speaker": "E", "text": "Wir nutzen ein zweistufiges Orchestrierungs-Setup: zuerst laufen nur die smoke-high-risk tests in parallel pipelines, danach die komplette Suite. That way, we catch showstoppers early without blocking the whole build."}
{"ts": "176:33", "speaker": "I", "text": "Sie haben vorhin Flaky Tests erwähnt. Wie genau identifizieren Sie diese im Hera-Kontext?"}
{"ts": "176:42", "speaker": "E", "text": "Wir korrelieren die letzten 50 Runs pro Test aus dem Orchestrator-Log mit den Build-IDs. If a test flips status >10% over that window without code changes, it hits our FLK-Threshold in Runbook RB-HER-025."}
{"ts": "177:00", "speaker": "I", "text": "Und wie gehen Sie mit sicherheitsrelevanten Regressionen um, die vielleicht nur sporadisch auftreten?"}
{"ts": "177:10", "speaker": "E", "text": "Für Security-Regressionen haben wir in RB-HER-SEC-011 den sogenannten Shadow-Test-Mode. That mode replays auth flows against the previous stable build. Ein sporadischer Fehler wird so mehrfach getriggert und validiert, bevor er als Incident hochgestuft wird."}
{"ts": "177:31", "speaker": "I", "text": "Can you link these tests to specific RFCs or SLAs in your tooling?"}
{"ts": "177:39", "speaker": "E", "text": "Ja, jeder orchestrierte Testfall hat ein Meta-Tag mit der RFC-ID oder SLA-ID. For example, our login latency test references SLA-HER-002, und bei Änderungen in RFC-HER-019 wird automatisch ein Re-Run der betroffenen Cases angestoßen."}
{"ts": "177:57", "speaker": "I", "text": "Wie fließt das in die Cross-Project-Koordination, z. B. wenn Hera und Orion Edge Gateway beide betroffen sind?"}
{"ts": "178:06", "speaker": "E", "text": "Wenn z. B. unser Auth-Test auf ein Gateway-Timeout läuft, taggen wir den Bug mit RB-GW-011 und RB-IAM-075. That triggers a shared Confluence page update und einen Sync-Call mit den jeweiligen QA-Leads von Orion und Aegis."}
{"ts": "178:24", "speaker": "I", "text": "Und wie dokumentieren Sie den Trade-off, wenn Sie z. B. Testabdeckung reduzieren, um den Release-Termin zu halten?"}
{"ts": "178:33", "speaker": "E", "text": "Wir erstellen ein Decision-Log in unserem Audit-Repo mit Verweis auf das entsprechende Jira-Ticket, z. B. HERA-REL-087. There we link the impacted test cases, die Risikobewertung aus RB-HER-014 und die Freigabe von Product Owner und Security Lead."}
{"ts": "185:06", "speaker": "I", "text": "Okay, lassen Sie uns noch einmal tiefer in eine konkrete Entscheidung gehen – bei der letzten Build-Iteration gab es ja den Konflikt zwischen der SLA-Anforderung SLA-HER-22 und dem Release-Termin, richtig?"}
{"ts": "185:19", "speaker": "E", "text": "Ja, genau. Wir hatten den Fall, dass die Lasttests im orchestrierten Pipeline-Run länger dauerten als geplant, und damit hätten wir SLA-HER-22 zur Antwortzeit nicht halten können. We had to decide whether to cut scope or delay."}
{"ts": "185:37", "speaker": "I", "text": "Und Sie haben sich dann für eine leicht reduzierte Testabdeckung entschieden? Können Sie den Prozess beschreiben?"}
{"ts": "185:49", "speaker": "E", "text": "Wir sind durch Runbook RB-HER-OPS-07 gegangen, das einen Entscheidungsbaum enthält. Step three explicitly says 'Assess critical path cases against contractual SLAs'. Wir haben alle kritischen Szenarien behalten, aber zwei Low-Priority Regression Suites verschoben."}
{"ts": "186:12", "speaker": "I", "text": "Gab es dafür formale Evidenz? Also Tickets oder Audit-Einträge?"}
{"ts": "186:21", "speaker": "E", "text": "Ja, wir haben das in Ticket QA-HER-482 dokumentiert, inklusive Link zu den relevanten SLA-Dokumenten und Approval von Release-Management. Außerdem Audit-Log-Eintrag AL-HER-2024-03-15-01."}
{"ts": "186:42", "speaker": "I", "text": "Verstehe. Und wie haben Sie das Risiko für Security bewertet, wenn Sie zwei Suites verschieben?"}
{"ts": "186:53", "speaker": "E", "text": "Die Suites hatten nur indirekten Bezug zu Security, mostly UI edge cases. Wir haben aber einen Quick-Scan mit dem SecTeam gemacht, documented in SecNote-HER-19, um sicherzustellen, dass keine Injection- oder Auth-Bypass-Risiken ungetestet bleiben."}
{"ts": "187:18", "speaker": "I", "text": "Wie ist das intern angekommen? Gab es Gegenwind?"}
{"ts": "187:26", "speaker": "E", "text": "Ein bisschen. Some dev leads argued that even low-priority regressions could cascade. Aber die Heuristik aus POL-QA-014 sagt klar, dass Blocking-Defects Vorrang haben. Das haben wir transparent kommuniziert."}
{"ts": "187:49", "speaker": "I", "text": "Und gab es im Nachgang einen Review dieser Entscheidung?"}
{"ts": "188:00", "speaker": "E", "text": "Ja, im wöchentlichen QA-Guild-Meeting. We reviewed the metrics from the release: keine kritischen Bugs, SLA eingehalten. Das hat die Entscheidung im Nachhinein validiert."}
{"ts": "188:18", "speaker": "I", "text": "Könnte man sagen, dass dieser Fall als Referenz für künftige Time-to-Market-Trade-offs dient?"}
{"ts": "188:27", "speaker": "E", "text": "Definitiv. Wir haben den Fall in unser Knowledge Base unter KB-HER-Tradeoffs gespeichert, mit Lessons Learned und Querverweisen zu Runbooks und Tickets."}
{"ts": "188:45", "speaker": "I", "text": "Sehr gut. Abschließend noch: Wie stellen Sie sicher, dass solche Trade-offs nicht zur Regel werden?"}
{"ts": "188:55", "speaker": "E", "text": "Wir haben ein Limit in der QA-Policy: max zwei Scope-Reductions pro Quartal ohne CTO Approval. Plus, any deviation triggers a mandatory post-mortem, documented and traceable."}
{"ts": "192:46", "speaker": "I", "text": "Könnten Sie mir jetzt bitte ein Beispiel geben, wie Sie einen Cross-System Bug zwischen Hera und dem Orion Edge Gateway priorisiert haben, als gleichzeitig ein Release-Datum fix war?"}
{"ts": "193:01", "speaker": "E", "text": "Ja, also, äh, letztes Quartal hatten wir den Incident HERA-INT-223, der direkt die API-Schnittstelle zum Gateway betraf. We had a fixed release window due to customer onboarding, so wir mussten den Bug innerhalb von 48 Stunden triagen."}
{"ts": "193:22", "speaker": "E", "text": "Ich habe dafür das Runbook RB-GW-011/Hotfix-Prozess geöffnet und zusammen mit dem SRE-Team einen Patch-Testlauf orchestriert, der nur die betroffenen Endpunkte validiert hat. Dadurch konnten wir die Regression isolieren."}
{"ts": "193:43", "speaker": "I", "text": "Wurde dabei die volle Regression-Suite von Hera ausgeführt, oder haben Sie bewusst reduziert?"}
{"ts": "193:53", "speaker": "E", "text": "Wir haben reduziert, bewusst. Only about 30% of the full suite, gezielt jene Tests, die laut Traceability-Matrix mit RFC-HERA-042 und SLA-QA-07 verknüpft waren. Das war ein kalkulierter Trade-off."}
{"ts": "194:15", "speaker": "I", "text": "Und wie haben Sie diese Entscheidung dokumentiert, damit sie später auditierbar bleibt?"}
{"ts": "194:24", "speaker": "E", "text": "Ich habe direkt im Ticket HERA-INT-223 die Entscheidung begründet, inklusive Verweis auf die relevanten SLA-Abschnitte und die Risk-Based Testing Policy POL-QA-014. Zusätzlich gibt es im Audit-Log den Vermerk mit meiner QA-Lead-ID."}
{"ts": "194:45", "speaker": "I", "text": "Gab es dazu Rückfragen vom Security-Team?"}
